{"title":"All You Need is to Wait","time_limit":2000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/all-you-need-is-to-wait/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nAll the citizens in the magic world cheer for you, the clever programmers! With your help, the war in the magic world finally ends!\n\nNow, our hero zplinti1 is back to work. He works in a computer game company, and his new product is a war-like game, but at the most time the players just sit at their computers and watch how the war going on.\n\nThe war breaks with the United Kingdom of Red and the United Kingdom of Black. We will call them Red and Black in the following paragraphs. They will keep invading the other’s territory until one wins at last.\n\nThe map of the war is a map with n cities, and m roads connecting them, forming an undirected graph. It’s guaranteed the graph is connected. \n\nAt first, some cities are captured by Red, some are captured by Black, and others are unoccupied. Then the cities might get united. That is, if two cities from the same country can be reached to each other without passing any city not captured by their country, they will get united and form a sub-graph. Each maximum sub-graph is called a kingdom.**The size of a kingdom is the cities the kingdom contains. The size of a country is also the cities the country contains.**\n\nThe game processes in Two steps.\n\n#### For the First Part:\n\nIn each second, each kingdom begin to invade the unoccupied cities that are directly connected by that kingdom at the same time. For each unoccupied city, if there are more than one kingdoms invading, we judge the battle’s result in this way:\n\n1. Check if all the biggest kingdoms (There might only be one such biggest kingdom!) among those are from the same country. If it is true, the city belongs to that country.\n2.\tOtherwise, among all those kingdoms invading the city, we count the total size of the kingdoms from Red and the total size of the kingdoms from Black. If they are different, the city belongs to the bigger country.\n3.\tOtherwise, count the total size of Red and total size of Black. If they are different, the bigger one gets the city.\n4.\tIf it is still impossible to judge the battle’s result, the city will belong to the country Black. (I won’t tell you zplinti1 loves Bearchild very much, and `Black` and `Bearchild` all begins with letter `B`!)\n\nAfter each second, the number of the kingdoms and the size of each kingdom might change, since there are more cities getting connected.\n\nIf all the cities are occupied, the Game will get into the second part.\n\n#### For the second Part: \n\nSince there are no unoccupied cities on the map, two countries start to invade each other!\n\nIn each second, every kingdom will start to invade all the kingdoms that is directly connected to that kingdom, whose size is smaller, and belongs to the other country. And the invading will always succeed instantly, and all the cities of that kingdom will be captured. But all the invading happen at the same time, so while kingdom B is invading kingdom C, kingdom B’s original cities might be captured by kingdom A.\n\nThe war will end, when there can be no invading any more. Then you need to output the result of the war.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of input contains a number $T$, indicating the number of test cases.$(T\\leq 30)$\n\nFor each case, the first line contains two integers $n$ and $m$: the number of cities and the roads $(1\\leq n\\leq 100,000, 1\\leq m\\leq 200,000)$. Then $m$ lines follow, each with two integers $u$ and $v$, with means there is a undirected road between city $u$ and $v$ $(0\\leq u, v< n)$. \n\nThe following line contains a number $P$ $(1\\leq P\\leq 100)$. Then $P$ lines follow, each line with two integers $city_i$ and $from_i$. If $from_i$ equals $0$, it means $city_i$ is captured by country Red. If $from_i$ equals $1$, it means it is captured by country Black $(0\\leq city_i< n, 0\\leq from_i\\leq 1)$. All the $city_i$ will be different. All the other cities apart from those cities are unoccupied at first.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each case, output `Case #i: ` first. ($i$ is the number of the test case, from $1$ to $T$). If the country Red captures all the cities at last, output `Red`, if the country Black captures all the cities, output `Black`, if there is a tie, output two numbers, the first is the number of cities belonging to Red, the second is the number of the cities belonging to Black.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3\n4 4\n0 1\n1 2\n2 3\n0 3\n2\n0 0\n1 1\n4 4\n0 1\n1 2\n2 3\n1 3\n3\n0 1\n2 0\n3 0\n3 2\n0 1\n1 2\n2\n0 0\n2 1</td><td>Case #1: 2 2\nCase #2: Red\nCase #3: Black</td></tr></table>\n\n"}]}