{"title":"An Easy Problem for Elfness","time_limit":2500,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/an-easy-problem-for-elfness/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nPfctgeorge is totally a tall rich and handsome guy. He plans to build a huge water transmission network that covers the whole southwest China. To save the fund, there will be exactly one path between two cities.\n\nSince the water every city provides and costs every day is different, he needs to transfer water from one particular city to another as much as possible in the next few days. However the pipes which connect the cities have a limited capacity for transmission. (Which means the water that transfer though the pipe should not exceed a particular amount) So he has to know the maximum water that the network can transfer in the next few days.\n\nHe thought it's a maximum flow problem, so he invites an expert in this field, Elfness (Also known as Xinhang senior sister) to help him figure it out.\n\nUnlike Pfctgeorge, Elfness quickly finds that this problem is much easier than a normal maximum flow problem, and is willing to help Pfctgeorge.\n\n\"Oh well, this problem is not a tough one. We can ...''\n\nAbruptly, Pfctgeorge's iPhone rings, and ... the ringtone is `Mo Di Da Biao Ke`.\n\n\"You can make that? Excellent! ''Pfctgeorge hangs up his iPhone, and turns to Elfness.\n\n\"Here's good news for you. A construction team told me that every pipe's capacity can be extended for one day. And the price for extending one unit capacity varies from day to day. ''\n\n\"Eh well, that's a good news for you, not me. Now it's rather like a minimum cost flow problem, right? But it's still not a tough one, let me have a think. ''\n\nAfter a few seconds' thought, Elfness comes up with a simple solution.\n\n\"Ok, we can solve it like... ''\n\nAbruptly, here comes `Mo Di Da Biao Ke` again.\n\n\"Seriously? You can build new pipes? Thank you very much. ''\n\n\"OK, my dear Elfness, we got more good news. Another construction team said they can build one or more pipes between any two cities and their pipes are exactly like the original ones except that they only work for one day. And the capacity of the new pipes is only one, but they can be extended, too. Of course, their price to build a single pipe also varies in days. ''\n\n\"You mean the new pipes can be extended too? Wow, things are getting more interesting. Give me a few minutes. ''\n\nElfness takes out his new ultrabook which is awarded in VK cup and does some basic calculation.\n\n\"I get it. The problem can be solved ...''\n\n`Mo Di Da Biao Ke` again, but this time it's from Elfness's phone.\n\n\"As you see, I have to go out. But I know someone else who can also solve this; I'll recommend this guy for you. ''\n\nAnd of course, that poor guy is YOU. Help Pfctgeorge solve his problem, and then the favorability about you from Elfness will raise a lot.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line has a number $T$ ($T\\leq 10$) , indicating the number of test cases.\n\nThe first line of each test case is two integers $N$ ($1\\leq N\\leq 100000$) \nand $M$ ($1\\leq M\\leq 100000$), indicating the number of the city that the original network \nconnects and the number of days when Pfctgeorge needs to know about the maximum water transmissions. \nThen next $N-1$ lines each describe a pipe that connects two cities. The format will be \nlike $U$, $V$, $cap$ ($1\\leq U$, $V\\leq N$ and $0\\leq cap<10000$), which means the $ids$ of the\ntwo cities the pipe connects and the transmission limit of the pipe. As is said in description, \nthe network that the cities and pipes form is a tree (an undirected acyclic graph).\n\nThen next $M$ lines of the test case describe the information about the next few days. \nThe format is like $S$, $T$, $K$, $A$, $B$. $S$ means the source of the water while $T$ means the sink. $K$ means the total budget in the day. $A$ means the cost for a construction team to build a new pipe and $B$ means the cost for a construction team to extend the capacity of a pipe.\n\nI am glad to list the information of building a new pipe and extending the capacity.\n\n1. Pfctgeorge can build a new pipe between any two cities, no matter they have been directly connected or not. Pfctgeorge can build more than one new pipe between any two cities.\n2. The capacity of the pipe that was newly built is **`one`**.\n3. Pfctgeorge can extend the capacity of any existed pipe including the newly built one and the original one.\n4. Each time you extend the capacity of one pipe, the capacity of that pipe increases one.\n5. The cost of building a new pipe is $A$ and the cost of extending a pipe is $B$.\n6. You can take any constructions in any times and the only limit is to make sure the total costs not exceed the budget.\n7. **`All the work that construction team does only lasts one single day`**.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor every case, you should output `Case #t:` at first, without quotes. The $t$ is the case \nnumber starting from $1$.\n\nThen for each day, output the maximum water Pfctgeorge can transfer from $S$ and $T$ with a\nbudget of $K$.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n5 1\n1 2 2\n1 3 5\n2 4 1\n4 5 2\n1 5 3 3 2\n5 5\n1 2 10\n2 3 2\n3 4 7\n2 5 7\n1 5 0 1 3\n1 3 0 2 3\n1 5 3 2 3\n1 2 7 3 1\n1 3 2 3 1</td><td>Case #1:\n2\nCase #2:\n7\n2\n8\n17\n4</td></tr></table>\n\n"}]}