{"title":"Apparent Magnitude","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/apparent-magnitude/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\n*The scale now used to indicate magnitude originates in the Hellenistic practice of dividing stars visible to the naked eye into six magnitudes. The brightest stars were said to be of first magnitude ($m = 1$), while the faintest were of sixth magnitude ($m = 6$), the limit of human visual perception (without the aid of a telescope). Each grade of magnitude was considered twice the brightness of the following grade (a logarithmic scale). This somewhat crude method of indicating the brightness of stars was popularized by Ptolemy in his Almagest, and is generally believed to originate with Hipparchus. This original system did not measure the magnitude of the Sun. *\n\n*In 1856, Norman Robert Pogson formalized the system by defining a typical first magnitude star as a star that is $100$ times as bright as a typical sixth magnitude star; thus, a first magnitude star is about $2.512$ times as bright as a second magnitude star. The fifth root of $100$ is known as Pogson's Ratio. *\n\n<p class=\"text-right\">-- from Wikipedia</p>\n\nThe apparent visual magnitude and its corresponding relative brightness are listed below (the accurate ratio is $\\sqrt[5]{100}$ , and we use a rounded value here for simplicity ). Your task is to decide the apparent visual magnitude according to a given relative brightness.\n\n<table class=\"table\">\n<thead>\n<tr><th>Apperant magnitude</th><th>Brightness relative to Vega</th></tr>\n</thead>\n<tbody>\n<tr><td>$1$</td><td>$[0.400, 1.000)$</td></tr>\n<tr><td>$2$</td><td>$[0.160, 0.400)$</td></tr>\n<tr><td>$3$</td><td>$[0.063, 0.160)$</td></tr>\n<tr><td>$4$</td><td>$[0.025, 0.063)$</td></tr>\n<tr><td>$5$</td><td>$[0.010, 0.025)$</td></tr>\n<tr><td>$6$</td><td>$[0.004, 0.010)$</td></tr>\n</tbody>\n</table>\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input is $T$ (no more than $1000$), which stands for the number of test cases you need to solve. \nEvery case contains one line with a single real number standing for the star's brightness relative to Vega.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor every test case, you should output `Case #k: ` first, where $k$ indicates the case number and counts from $1$, then output the grade of apparent magnitude. If the star is equally bright or brighter than Vega you should output `Too Bright`. If the star is less bright than a sixth magnitude star you should output `Invisible`. (The test data is specially designed so that you can simply ignore the precision problem of the float number)\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>5\n1.0001\n0.8\n0.17\n0.015\n0.001</td><td>Case #1: Too Bright\nCase #2: 1\nCase #3: 2\nCase #4: 5\nCase #5: Invisible</td></tr></table>\n\n"}]}