{"title":"Balloon Game Once More","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/balloon-game-once-more/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nIn referees' office, a long line of balloons are prepared.\nAll balloons of the same color are are adjacent to each other.\n\nBut God Kufeng happened to destroy some balloons.\nTo help the DAGE (Aniki, Big Brother), Kennethsnow and Sakuya are going to solve it.\n\nLuckily, all the destroyed balloons are adjacent to each other.\n\nThe destroyed balloons are shown in `?`, and Kennethsnow and Sakuya can replace those places with new balloons of any color.\nThe only limitation is that, all the balloons of the same color including the remaining ones and new ones are adjacent to each other, still.\n\nSo, for `a???c`, both `aabcc` and `aabdc` are OK, but they can't change the balloons to `abbac`, \nsince all balloons of color a are not adjacent to each other anymore.\n\nKennethsnow wants the total number of different colors to be odd, while Sakuya wants it to be even.\nSo they decides to play a game.\n\nAnd they take turns replacing a destroyed balloon with a new one. Kennethsnow moves first, then Sakuya, then Kennethsnow again ...\n\nEach of them can choose the color of the balloon as they like, as long as the limitation is not violated.\n\nKennethsnow wants you to find whether he has a strategy to win(making the number of color odd), if both of them play optimally.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThere is one line in the input, containing a string which consists of `a` - `z` and `?`.\n\n`a` - `z` here means $26$ kinds of different color, and the `?` means the destroyed balloon.\n\nThe length of the string will not exceed $10^5$.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nOutput `Yes` if Kennethsnow can win, otherwise output `No`.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>a?z</td><td>Yes</td></tr></table>\n\n"}]}