{"title":"Bathroom","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/bathroom/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nJiangAn's bathroom is divided into $N$ ($1\\leq N\\leq 50$) rooms labeled from $1$ to $N$. And there are some compartments in each room. If the compartment is available, it will be labeled with a number. Otherwise it will be labeled with `XX`. Each number of the compartment in one room is uniqueness.\n\nThe compartments in one room are arranged only in the shape of `U` (Such as the room $1$ and room $2$ in sample) or `II` (for example the sample of room $3$). If a student wants to have a shower, he should swipe his card on the machine firstly. In order to facilitate your understanding, we would name this machine with A. The machine A will assign an available compartment for him randomly. And this compartment is marked as in use at the same time.\n\nWhen he finished his shower, he should swipe his card again on machine B. The machine B will calculate the cost and this compartment is marked as available again. As we know, many people don't like the compartments in corners, (Such as No.$01$, No.$05$, No.$08$ and No.$12$ compartments in room $1$, No.$15$, No.$17$, No.$20$ compartments in room $2$, And No.$01$, No.$05$, No.$06$, No.$10$ compartments in room $3$) At least I don't. zsasuke doesn't like the compartments in \ncorners too. And he also doesn't like the compartment whose \nthe room number connecting the compartment number is a prime number. \n(Such as room $1$ No.$01$ compartment, $101$ is a prime number).\n\nEvery time zsasuke is assigned to a compartment he doesn't like, he will immediately swipe his card on machine B to cancel this allocation, then swipe his card on machine A again. He won't stop this until he is assigned to a satisfactory compartment. (What a selfish person! Students in queue after him must curse him...) But sometimes, it may take many times to get a satisfactory compartment. Recently, our clever zsasuke think of a new idea that he can take many cards to the bathroom. (We assumed that he borrowed enough cards from his schoolmates, what a selfish person!) If his first card is assigned to a unsatisfactory compartment, he will immediately swipe the second card on machine A to get a new compartment (Do not need to cancel previous assigning), until the compartment he got is satisfactory.\n\nzsasuke wants to know how much the new method better than the old one. So can you do him a favor, What is expecting number of times zsasuke needs to swiping his card(s) on machine A to get a satisfactory compartment for the two methods respectively?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input is an integer $T$ which stands for the number of test cases.\n\nFor each test case, the first line is an integer $N$ and $N$ lines follow which stands for the information of each room.\n\nFor each room, the first line is an integer $L$, indicating that this room has $L$ lines. The following $L$ lines stand for the map of the room and each line has at most $600$ chars. We guarantee the arrangement of compartments in the room strictly correspond with the description above.\n\nThe shape of every compartment is strictly as follows:\n```\n----\n|##|\n----\n```\n\nThe `##` is either a number of exactly $2$ digits (leading zeros may \nappeared) or `XX`. Otherwise it is not a compartment.\nHere is sad news that zsasuke's teammate, onmylove has used this \nmap paper as scratch paper. So on the map there may appear some other\nredundant chars. But fortunately, the redundant chars will not \ncover the origin compartments, or make up any new compartments.\nAfter the description of room there is a line contains an integer\nM which stands for how many people taking a shower when zsasuke come\nto the bathroom. And following $M$ lines, each line contains two integers $X$ and $Y$,\nwhich stands for the No.$Y$ compartment in room $X$ is used now.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, output one line contain two floating-point numbers \n(rounded to $6$ digits after decimal point), which stands for the expecting\nnumber of times zsasuke needs for old and new methods respectively, separated by a space.\nIf there is no usable compartment, output a line with `No available room!`.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>1\n3\n11\n----     ----\n|01|     |12|\n----     ----\n|02|     |11|\n----     ----\n|03|     |10|\n----     ----\n|04|     |09|\n-------------\n|05|06|07|08|\n-------------\n9\n----  ----\n|XX|  |20|\n----  ----\n|13|  |19|\n----  ----\n|14|  |18|\n----------\n|15|16|17|\n----------\n11\n----  ---- :)\n|01|  |10| Orz\n----01---- =.=||\n|02|==|09|\n----- ---- ---\n|03|04|08| |11|\n---------- ---\n|04|  |07|\n----  ----\n|05|  |06|\n----  ----\n5\n1 2\n1 3\n2 13\n3 02\n3 09</td><td>2.272727 2.166667</td></tr></table>\n\n"}]}