{"title":"Battle for Silver","time_limit":999,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/battle-for-silver/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nPiet Hein was a Dutch naval officer during the Eighty Years' War between the United Provinces of The Netherlands and Spain.\nHis most famous victory was the capture of the *Zilvervloot* (`Silver Fleet`) near Cuba in 1628, where he intercepted\na number of Spanish vessels that were carrying silver from the Spanish colonies in the Americas to Spain.\nDetails about this famous naval battle are sketchy, so the description below may contain some historical inaccuracies.\n\nThe Silver Fleet consisted of vessels containing silver coins. Piet Hein's basic strategy was simple:\n  tow away a number of vessels from the fleet, in order to capture their contents.\n\nIn an attempt to prevent the Dutch from carrying out this plan, the Spanish tied all the ships in their fleet together\nusing huge iron chains. Each vessel in their fleet was fixed to at least one other vessel; any two vessels\nwere connected by at most one chain; and the Spanish made sure that the chains did not cross each other, otherwise they\ncould get tied up into a knot. As an end result, the vessels and the chains connecting them formed a connected, planar graph.\n\nHowever, the Spanish preventive measures only made their situation worse. As an experienced naval officer, Piet Hein knew that\ntowing away a group of ships was easiest if, for every two ships in the group, the ships were connected by a chain. He called\nsuch groups *chaingroups*.\n\nPiet Hein ordered his men to tow away all the ships in the chaingroup that contained the largest amount of booty,\nafter severing the links with the remaining ships in the Spanish fleet with a few highly accurate canon shots.\nThe total booty in a chaingroup is the total number of silver coins in the vessels that make up the chaingroup.\n\n<p class=\"text-center\"><img src=\"/source/lutece/battle-for-silver/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vODg5LzIwMTQwNTIzMTIxMTM4NjMyOS5wbmc=.png\" alt=\"title\"></p>\n\n*The Silver Fleet represented as a graph: each dot denotes a vessel in the fleet, while each line denotes a chain that connects two vessels.\n         The vessels that are connected in the figure by the dashed lines correspond to the chaingroup that provides the highest total value of silver coins.\n         In this case, Piet Hein loots 4500 silver coins from the fleet.*\n\nGiven a description of the Silver Fleet, find the value of the chaingroup with the highest amount of booty\n(i.e., total number of silver coins in the ships that make up the chaingroup).\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nFor each test-case:\n* A line containing two integers $v$ $(2 \\leq v \\leq 450)$ and $e$ $(1 \\leq e \\leq 900)$, the number of vessels in the fleet and the number of chains, respectively.\n* Then, $v$ lines specifying $S\\_1, S\\_2, \\ldots, S\\_v$, the amount of silver coins carried by vessel $i$ $(1 \\le i \\le v)$.\n   The $S_i$ will be positive integers, where $100 \\leq S\\_i \\leq 6000$.\n* Then, for each chain, a line containing two integers $c\\_{start}$ and $c\\_{end}$,\n   the two vessels connected by the chain, where ($1 \\le c\\_{start} < c\\_{end} \\leq v$).\n\nEach fleet forms a connected, planar graph.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, one line containing a single positive integer: the number of silver coins that is captured by Piet Hein's fleet.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>4 6\n100\n5000\n1000\n2000\n1 2\n1 3\n1 4\n2 3\n2 4\n3 4\n6 8\n1500\n1000\n100\n2000\n500\n300\n1 2\n1 3\n1 4\n2 4\n3 5\n4 5\n4 6\n5 6</td><td>8100\n4500</td></tr></table>\n\n"}]}