{"title":"Bigger Python.","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/bigger-python/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nThere's nothing wrong with falling in love with a programming language for her looks. I mean, let's face it - Python does have a rockin' body of modules, and a damn good set of utilities and interpreters on various platforms. Her whitespace-sensitive syntax is easy on the eyes, and it's a beautiful sight to wake up to in the morning after a long night of debugging. The way she sways those releases on a consistent cycle - she knows how to treat you right, you know?\n\nBut let's face it - a lot of other languages see the attention she's getting, and they get jealous. Really jealous. They try and make her feel bad by pointing out the GIL, and they try and convince her that she's not \"good enough\" for parallel programming or enterprise-level applications. They say that her lack of static typing gives her programmers headaches, and that as an interpreted language, she's not fast enough for performance-critical applications.\n\nShe hears what those other, older languages like Java and C++ say, and she thinks she's not stable or mature enough. She hears what those shallow, beauty-obsessed languages like Ruby say, and she thinks she's not pretty enough. But she's trying really hard, you know? She hits the gym every day, trying to come up with new and better ways of JIT'ing and optimizing. She's experimenting with new platforms and compilation techniques all the time. She wants you to love her more, because she cares.\n\nBut then you hear about how bad she feels, and how hard she's trying, and you just look into her eyes, sighing. You take Python out for a walk - holding her hand - and tell her that she's the most beautiful language in the world, but that's not the only reason you love her.\n\nYou tell her she was raised right - Guido gave her core functionality and a deep philosophy she's never forgotten. You tell her you appreciate her consistent releases and her detailed and descriptive documentation. You tell her that she has a great set of friends who are supportive and understanding - friends like Google, Quora, and Facebook. And finally, with tears in your eyes, you tell her that with her broad community support, ease of development, and well-supported frameworks, you know she's a language you want to be with for a long, long time.\n\nAfter saying all this, you look around and notice that the two of you are alone. Letting go of Python's hand, you start to get down on one knee. Her eyes get wide as you try and say the words - but she just puts her finger on your lips and whispers, \"Yes\".\n\nThe moon is bright. Python is beautiful.\n\nIn this problem,I will give you some python code,you should run the beautiful code.\n\nIn the code,there are only two algorithm:\n\n1.assignment statement.Assign the value of A to B, where the B is legal .like:\n\ncode:\n\na=1   //a=1\n\nb=1   //b=1\n\na=5+b   //a=6\n\n2.output statement  print(A1[, A2, …]).The value of each variable or constant in the bracket after the print shoule be output. Between each of the two values separated with a space.But the end of the statement shoule be a new line.like:\n\ncode:\n\na = 123//a=123\n\nprint(a, 4564)\n\nprint(a,a)\n\nresult:\n\n123 4564\n\n123 123\n\nTo make the problem easier,the code will obey following rules:\n\n1.It can be runned with Python 3.5.1\n\n2.The length of each variable names is smaller than 30.\n\n3.There are only \"print\" , \"=\" , \"+\" , \"-\" , \"(\" , \") , \"*\" ,  and variable names in the code.\n\n4.In the code,there are no blank space.\n\n5.The variable names only contain upper letters or lower letters.\n\n6.We guarantee that the variable that appeared in the assignment statement on the right side or appear in the output statement will be assigned.\n\n7.We guarantee the constant will be smaller than $1000000000$ and be bigger than $-1000000000$\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nOne statement per line.\n\nThe lines is smaller than $60$.\n\nThe length of the code will be smaller than $5000$\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput the answer~\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>a=5+7+9\nb=3+(5-7)*2\nprint(a,b)\na=a+a+a\nprint(a)</td><td>21 -1\n63</td></tr><tr><td>a=-1+(-1)\nb=-1\nprint(a,b)</td><td>-2 -1\n</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nI love python,do you?\n"}]}