{"title":"Board","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/board/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nIn the Olympic days, we pay much attention on the medal-board. Now you should show us the board if we give you the result of all the matches.\n\nIn the board, the countries should be ordered by the gold medals. If a tie occurred, we will order them by the silver medals, if there is still a tie, we will compare them by the bronze medals. If two countries got the same medals in all the three scales, we will list them by lexicographic order of their names(you may assume that the countries' names won't be repeated).\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input contains a number $T$ indicate the test cases.\n\nFor each test case,\n\nYou will get $N$ ($1\\leq N\\leq 1000$) in the first line indicate the number of countries.\n\nThen $N$ lines, each line contains a string indicate the $i\\_{th}$ country’s name, no two country share the same name.\n\nThe next line you will get an integer $M$ ($1\\leq M\\leq 1000$) denotes the number of items we have in the Olympic game.\n\nThen $M$ items come, for each items, you will get $4$ lines, the first line will be the name of this item, the next $3$ line each give you the nationality of the players in this item from gold to bronze. You can assume the nationality is included in the above country names.\n\nEach of the string above contains no more than $80$ letter (`a` to `z` and `A` to `Z`).\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, you should output the final medal-board, the countries should be ordered by rules mentioned above, the output format should the same with the sample, after each case, output a blank line.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>1\n3\nChina\nUSA\nRussia\n1\nFootball\nChina\nUSA\nRussia</td><td>China 1 0 0\nUSA 0 1 0\nRussia 0 0 1</td></tr></table>\n\n"}]}