{"title":"Bolts And Nuts","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/bolts-and-nuts/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nWhen visiting the Sun Island during 2010 ACM/ICPC Asia Regional Contest Harbin Site, Cc and Zxh found a lot of bolts(螺栓) and nuts(螺帽). They decided to play a game using them. \n\nThe rule is: they handle these bolts and nuts in turn and always begin with Cc in every game. In every turn one of them can do one of these three operations:\n1. pair a nut and a bolt;\n2. throw a single nut which was not pair with any bolt into the river; \n3. throw a single bolt which was not pair with any nut into the river;\n\nOf course, every bolt can only be paired with one nut at most.The same with every nut.\n\nThe game will be end with one of Cc and Zxh founding they can't do any one of these three operations, and this player is loser.\n\nYou are required to write a program to determine who will be the winner in a game.\n\nSuppose that both of Cc and Zxh are clever and they will do their best in the game.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input contains one integer $T$($T\\leq 200$), which indicates the number of test cases.\n\nThen, $T$ lines follow. Every line indicates one test case. Every test case only contains two integers $a$,$b$($0\\leq a,b\\leq 10000$),the number of bolts and nuts.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, output one line. First ,output `Case #C: `, where $C$ is the number of test case, from $1$ to $T$.\nThen, output the winner of the game, `Zxh` or `Cc`.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3\n0 0\n1 1\n1 2</td><td>Case #1: Zxh\nCase #2: Cc\nCase #3: Cc</td></tr></table>\n\n"},{"title":"Note","format":"markdown","require":["katex"],"content":"\nThe first case of the sample, there is no bolt or nut and begin with Cc, so Cc lose.\n\nThe second case,Cc can pair the nut and bolt first, then there is no single bolt or nut ,so Zxh lose.\n\nThe third case Cc can throw a bolt into the river, then left two nuts,Zxh can only throw a nut into the river, and Cc throw away the last nut.Now, there is no bolt or nut, so Zxh lose.\n"}]}