{"title":"Cent Savings","time_limit":2000,"memory_limit":256,"url":"https://acm.uestc.edu.cn/problem/cent-savings/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\n![title](/source/lutece/cent-savings/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTExNC8yMDE1MDUxNjAwMTQ1MTg3NTY4LmpwZw==.jpg)\n\nTo host a regional contest like NWERC a lot of preparation is necessary: organizing rooms and computers, making a good problem set, inviting contestants, designing T-shirts, booking hotel rooms and so on. I am responsible for going shopping in the supermarket.\n\nWhen I get to the cash register, I put all my n items on the conveyor belt and wait until all the other customers in the queue in front of me are served. While waiting, I realize that this supermarket recently started to round the total price of a purchase to the nearest multiple of 10 cents (with 5 cents being rounded upwards). For example, 94 cents are rounded to 90 cents, while 95 are rounded to 100.\n\nIt is possible to divide my purchase into groups and to pay for the parts separately. I managed to find d dividers to divide my purchase in up to d+1 groups. I wonder where to place the dividers to minimize the total cost of my purchase. As I am running out of time, I do not want to rearrange items on the belt.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input consists of:\n\n>#####one line with two integers n $(1≤n≤2000)$ and d $(1≤d≤20)$, the number of items and the number of available dividers;\n>#####one line with n integers p1,… pn $(1≤pi≤10000$ for $1≤i≤n)$, the prices of the items in cents. The prices are given in the same order as the items appear on the belt.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput the minimum amount of money needed to buy all the items, using up to d dividers.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>5 1\n13 21 55 60 42</td><td>190</td></tr><tr><td>5 2\n1 1 1 1 1</td><td>0</td></tr></table>\n\n"}]}