{"title":"Choosing Capital for Treeland","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/choosing-capital-for-treeland/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nThe country Treeland consists of $n$ cities, some pairs of them are connected with unidirectional roads. Overall there are $n-1$ roads in the country. We know that if we don't take the direction of the roads into consideration, we can get from any city to any other one.\n\nThe council of the elders has recently decided to choose the capital of Treeland. Of course it should be a city of this country. The council is supposed to meet in the capital and regularly move from the capital to other cities (at this stage nobody is thinking about getting back to the capital from these cities). For that reason if city a is chosen a capital, then all roads must be oriented so that if we move along them, we can get from city a to any other city. For that some roads may have to be inversed.\n\nHelp the elders to choose the capital so that they have to inverse the minimum number of roads in the country.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThere are multiple test cases. \n\nThe first line of each test case contains integer $n$ ($2\\le n\\le 2\\times 10^5$) — the number of cities in Treeland. Next $n-1$ lines contain the descriptions of the roads, one road per line. A road is described by a pair of integers $s\\_i$, $t\\_i$ ($1\\le s\\_i,t\\_i\\le n$; $s\\_i\\neq t\\_i$) — the numbers of cities, connected by that road. The $i\\_{th}$ road is oriented from city $s\\_i$ to city $t\\_i$. You can consider cities in Treeland indexed from $1$ to $n$.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case,in the first line print the minimum number of roads to be inversed if the capital is chosen optimally. In the second line print all possible ways to choose the capital — a sequence of indexes of cities in the increasing order.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>16\n1 2\n3 2\n4 1\n5 3\n6 1\n2 7\n1 8\n4 9\n10 4\n11 2\n12 9\n5 13\n14 2\n15 7\n3 16</td><td>7\n10</td></tr></table>\n\n"}]}