{"title":"Constellations","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/constellations/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nIndira likes stars very much. In her childhood, the star tales were always huge attractions to her, with which she lived, dreamed and grew up. The little girl afterwards didn't become an astronomer though, Indira still loves to collect different stories of the constellations. 88 lovely constellations in the same sky, countless engaging tales at various touches.\n\nWhen Indira wrote to her boyfriend at the end of each month, she would sometimes put down some of the stories. However, she didn't do so today. After writing for long time, she noticed the boy, who had an irrelevant taste, weren't too keen on these stories. Resigned though, Indira didn't want to give in. As a smart girl majoring in math, she realized that it would bean opportunity to punish the boy.\n\nAfter reviewing the letter she had finished writing, Indira estimated each sentence with a degree of constellation.She only uses English letters(both uppercase and lowercase), blanks and some half-width characters(where newline characters and blanks may exist, but we can ignore it for simplicity). Each character can be mapped with a unique number:\n* `[a...z] -> [0...25]`\n* `[A...Z] -> [26...51]`\n* `[,] -> [52]` (comma)\n* `[.] -> [53]` (period)\n* `[!] -> [54]` (exclamatory mark)\n* `[?] -> [55]` (question mark)\n\nAfter we ignore the redundant characters, each sentence can be transformed to a string without blanks, and each of its continuous substrings(where the empty substring is not included) can be seen as a $56$-base number. For instance, `I miss you` can be shorten into `Imissyou`, which contains substrings like (`s`)$\\_{56}= (18)\\_{10}$, (`is`)$\\_{56}= (466)\\_{10}$, (`missyou`)$\\_{56}=(374677865764)\\_{10}$,etc. When the number represented by a substring is divisible by 88(the number of constellations) under base $10$, Indira treats it as a substring of constellation.\n\nThe degree of constellation of a sentence is defined to be the number of substrings of constellation in this sentence. It is allowed to begin a substring with letter'a', and same substrings that exists at different positions counts as well.\n\nIndira has got the answers, but she needs your help to check them. Given a letter by Indira, you’re now required to figure out the degree of constellation of each sentence inside.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nAn integer $N$ will exist in the first line of input, indicating the number of sentences.\n\nThe following $N$ lines, each with a string, showthe sentences in Indira's letter.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput thedegree of constellationfor each sentence.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3\nYou had me at first sight.\nI miss you.\nYours, Indira</td><td>4\n0\n4</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nThe total length of all the sentences(including the blanks) will not exceed $4\\times 10^6$. The C style input method is recommended for faster input.\n"}]}