{"title":"Count Presents","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/count-presents/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nOn the day of Xiao Ming's birthday, he received lots of presents from his uncles, aunts, brothers and sisters, a pencil from Uncle Wang, a box of sweets from Aunt Zhang, a lovely toy car from his big brother, and a toy pistol from his good friend Xiao Qiang. The numbers of the presents are too many to count, triggering that it is not available for Xiao Ming to remember from whom did he receive those presents. Fortunately, Xiao Ming still remembers the accurate time he received each gift. The sweets were received in the morning, his brother gave the gift to him at noon and the toy pistol was received in the afternoon when he went out to play games with Xiao Qiang while the box of Chinese chess were not on Xiao Ming’s bed until the night.\n\n![.*](/source/lutece/count-presents/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTc0LzIwMTQwMjAyMjM0MjE2NzY2MzQucG5n.png)\n\nThough lots of presents Xiao Ming has received, he finds that many of them are the same as others. Xiao Ming has found another $2$ boxes that contain the same pencils that Uncle Wang gave him, so as the sweets. The curious boy wants to know how many kinds of different presents are received **during a certain period of time**, can you help him?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nFirstly the inputs will tell you the name of the presents and the time when the presents are received, the followings are Xiao Ming’s questions. The first line of the inputs is $T$(no more than $10$), which stands for the number of test cases you need to solve, for each case you must solve it independently and print the answer as the requests.\n\nAfter $T$, the inputs will be each test case. The first line of each case will be $N$, representing for the numbers of presents Xiao Ming has received. The form of the following $N$ lines is: name time, which stands for the name of the presents and the time it is received. The name is a string with a length no more than $10$. **To simplify the question, we use integers from $0$ to $86400$ to indicate the time ( $86400$ is excluded ). The data will guarantee that the receiving time for each gift will be different and the value of the receiving time for each gift in the input will be non-decreasing.**\n\n$Q$ is given in the following line, which means that Xiao Ming has $Q$ questions to ask for you. Then the following $Q$ lines will be Xiao Ming’s questions, the maximum number of $Q$ will be $100000$. Every question contains $2$ elements: $s$, $t$, $0\\leq s\\leq t < 86400$, which stands for the start time and end time of the period Xiao Ming wants to ask you. Be careful that **the moment s and t are also contained in the time period**. For details please refer to the samples.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nPlease output the answer for all test cases. **Print a blank line after each test case**.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n5\ncandy 1538\npencil 3305\ntoycar 4437\npencil 7126\nchess 12548\n4\n0 3304\n1537 9000\n0 10000\n0 86399\n10\nchunge 3460\nfeimao 7571\nfeimao 8254\nkaohongshu 15468\njichibang 17629\njichibang 19875\njichibang 27047\nyangdaniu 28052\nzengge 33854\nyangdaniu 34494\n7\n7377 16406\n22851 39403\n32266 64046\n27715 57687\n17861 46069\n20905 40493\n0 31179</td><td>1\n3\n3\n4\n\n2\n3\n2\n2\n3\n3\n5</td></tr></table>\n\n"}]}