{"title":"DaFuWeng","time_limit":3000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/dafuweng/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nAfter this contest, lxhgww and hhb will formally say farewell to ACM/ICPC, which means the drop scene for the time of ACMilan!!! To recall the happy memory in the summer of 2007, after a busy training day, the three guys prefer to play a game, the DaFuWeng!\n\nThe game is played on a line of grids, the player have an unusual dice which gets numbers from $0$ to $N$. In each round of game, player can throw out the dice and get a number Num, then he will step forward Num steps. If you get out of the grids, you have to throw the dice again. There are some fruits lie in the grid, for each grid you get in at first, you can take the fruits.\n\nWhen you throw out the dice, assume the probability for each number you get is the same, so ACMilan want to know the mathematical expectation of fruits you can get.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input contains one integer $T$, which indicates the number of test cases. For each test case, in the first line, there are two integers $M$ and $N$, where $M$ is the number of grids in this game and $N$ is the number describing dice as aforementioned. ($M\\leq 10^5$, $1\\leq N\\leq 6$). Following $M$ lines have one integer in each. The integer in $i\\_{th}$ line is the number of fruits in the $i\\_{th}$ grid. Note that, in the beginning of the game, you are supposed to stand in the $0\\_{th}$ grid. When you step in to the $M\\_{th}$ grid, the game is over.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each case, output one line containing the expectation of fruits you can get. And remember to round the answer to the first digit after the decimal point.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>1\n2 1\n5\n6</td><td>11.0</td></tr></table>\n\n"}]}