{"title":"Doodle","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/doodle/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nQiQi is a child.\n\nChild always has dreams.\n\nDreams can be sometimes excellent.\n\nThe most excellent dream may be being an artist who enjoys doodling.\n\nQiQi loves doodling since he was a very young boy. After all these years’ hard training, he becomes a very skilled doodler. Today he gets a board which has n rows and m columns. QiQi would like to use his colorful brushes to doodle. Before QiQi starts his work, he plans exactly one color for each cell, meaning that this cell can’t be paint with other colors at any time. Besides, QiQi also plans the least number of times he should doodle for each cell. In each doodle, he can use his brush to doodle some continuous cells vertically or horizontally with the same color.\n\nNow QiQi want to know how many times at least he has to doodle?\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input is an integer $T$ ($T\\leq 20$), which stands for the number of test cases you need to solve.\n\nEvery test case begins with $2$ integers $n$, $m$($1\\leq n, m\\leq 20$) indicating the size of the board. Then n lines follow, each line consists of m integers (each integer is between $1$ and $400$). The $j\\_{th}$ integer of the $i\\_{th}$ line represents the color for that cell(different integers stand for different colors). Then n lines follow, each line consists of $m$ integers. The $j\\_{th}$ integer of the $i\\_{th}$ line represents the least number of times QiQi would like to doodle for that cell (each integer is between $0$ and $10000$).\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor every test case, you should output `Case #k: ` first, where k indicates the case number and starts at $1$. Then output an integer indicating the least number of times QiQi has to doodle.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n2 2\n1 1\n2 2\n1 1\n1 1\n2 2\n1 2\n2 1\n1 1\n1 1</td><td>Case #1: 2\nCase #2: 4</td></tr></table>\n\n"}]}