{"title":"Effective Infection Time","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/effective-infection-time/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nYou are estimating the threat level of quarantined zones that have been abandoned to the infection. One of the key variables in determining a zone's threat level is the EIT (Effective Infection Time). This information is essential for planning strike dates to reclaim quarantined zones. The EIT is calculated according to the following rules:\n\n* The EIT is the result of a function of two dates: The infection date and the strike date.\n* All years are in A.Z. (After Zombie).\n* Every month counts for a fraction of an EIT after its last day has passed. This means the month of the strike date does not count for EIT.\n* The first calendar year of the infection is calculated as $\\frac{1}{2}$ EIT. \n * If the end of the year is not reached, each month only counts for a fraction of the $\\frac{1}{2}$ EIT. If a zone was infected in January of the first year, then the $\\frac{1}{2}$ EIT is spread across $12$ months $\\frac{\\frac{1}{2}}{12} \\approx 0.0417$ EIT per month). If a zone was infected in March of the first year, then the $\\frac{1}{2}$ EIT is spread across $10$ months$\\frac{\\frac{1}{2}}{10} = 0.0500$ EIT per month).\n * If the end of the year is reached, the year counts as a full $\\frac{1}{2}$ EIT, regardless of the infection month. In other words, a zone infected in February of $15$ A.Z. counts as only $\\frac{1}{2}$ (one-half) EIT after December $15$ A.Z. A zone infected in December of the same year will also count as $\\frac{1}{2}$ EIT.\n* All following years are calculated as $1$ EIT. Each calendar month, beginning with January, counts for $\\frac{1}{12}$ EIT ($\\approx 0.0833$ EIT).\n* Every zone infected on the same month will have the same EIT for any given strike date. Therefore only the month and year are given.\n\nThe number and order of months in a calendar year remains the same as the modern Gregorian calendar.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line will be an integer $N$, where $1 \\leq N \\leq 50$ giving the number of zones. For each zone, a pair of lines of will be provided:\n* The first line contains the infection date. The second contains the strike date.\n* The first integer of a date represents the month, $M (1 \\leq M \\leq 12)$, and the second integer represents the year, $Y (0000 \\leq Y \\leq 0030)$. The year will always have $4$ digits.\n* The strike date will never precede the infection date.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nOutput the EIT for each zone on its own line. The EIT must be rounded to the fourth digit after the decimal point. The ones-digit must always be printed even if it is a zero.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n2 0009\n11 0012\n3 0010\n10 0010</td><td>3.3333\n0.3500</td></tr></table>\n\n"}]}