{"title":"Equal Sum Partitions","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/equal-sum-partitions/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nAn equal sum partition of a sequence of numbers is a grouping of the numbers (in the same order as the original sequence) in such a way that each group has the same sum. For example, the sequence:`2 5 1 3 3 7`\n\nmay be grouped as:`(2 5) (1 3 3) (7)`\n\nto yield an equal sum of $7$.\n\nNote: The partition that puts all the numbers in a single group is an equal sum partition with the sum equal to the sum of all the numbers in the sequence.\n\nFor this problem, you will write a program that takes as input a sequence of positive integers and returns the smallest sum for an equal sum partition of the sequence.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of input contains a single integer $P$, ($1\\leq P\\leq 1000$), which is the number of data sets that follow. The first line of each data set contains the data set number, followed by a space, followed by a decimal integer $M$, ($1\\leq M\\leq 10000$), giving the total number of integers in the sequence. The remaining line(s) in the dataset consist of the values, $10$ per line, separated by a single space. The last line in the dataset may contain less than $10$ values.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each data set, generate one line of output with the following values: The data set number as a decimal integer, a space, and the smallest sum for an equal sum partition of the sequence.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3\n1 6\n2 5 1 3 3 7\n2 6\n1 2 3 4 5 6\n3 20\n1 1 2 1 1 2 1 1 2 1\n1 2 1 1 2 1 1 2 1 1</td><td>1 7\n2 21\n3 2</td></tr></table>\n\n"}]}