{"title":"Evil QQ","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/evil-qq/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nLong long ago when there was a place where some strange kinds of creature such as MonsterQQ, RabbitQQ live in. One day you just woke up and found your friend QQ spell some strange incantation and transport you there. See what a evil your friend QQ is. So you have to face the situation that MonsterQQ is so dangerous and hungary and if you meet anyone of them someday, it will eat you immediately.\n\nSuppose there are $n$ MonsterQQs and $m$ RabbitQQs and you lived there now.So there are $n + m + 1$ creatures there initially. Everyday only a pair of them would meet each other, and which would be chosen to meet another would have the same probability and what happened then is as following:\n1. If you meet a RabbitQQ, then nothing would happen that day.\n2. If two RabbitQQ meet each other, then nothing would happen that day.\n3. If a MonsterQQ meet you, then the MonsterQQ eat you and you die.\n4. If a MonsterQQ meet a RabbitQQ, then the MonsterQQ eat the RabbitQQ, too.\n5. If two MonsterQQ meet each other, then they will fight with each other and both of them will die.\n\nHere is my question: what's the probability you would survive eventually?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input contains a single integer $T$($T\\leq 1000$) indicates the number of cases that follow.Next $T$ lines each contains two interger $n$ and $m$($0\\leq n, m\\leq 50$) indicates the number of MonsterQQ and the number of RabbitQQ.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, output one line. First ,output `Case #C: `, where $C$ is the number of test case, from $1$ to $T$. Then, output the answer to this question, which should be printed accurately rounded to six decimals.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n2 0\n3 0</td><td>Case #1: 0.333333\nCase #2: 0.000000</td></tr></table>\n\n"}]}