{"title":"False Sense of Security","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/false-sense-of-security/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nFreddy discovered a new procedure to grow much bigger cauliflowers. He wants to share thisfinding with his fellow gardener Tommy but he does not want anyone to steal the procedure. Sothe two gardeners agreed upon using a simple encryption technique proposed by M. E. Ohaver.\n\nThe encryption is based on the Morse code, which represents characters as variable-length sequences of dots and dashes. The following table shows the Morse code sequences for all letters:\n\n![.*](/source/lutece/false-sense-of-security/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vNzkyLzIwMTQwMzIyMjEyMDA3MjkwNS5wbmc=.png)\n\nNote that four possible dot-dash combinations are unassigned. For the purposes of this problem we will assign them as follows (note these are not the assignments for actual Morse code):\n\n![.*](/source/lutece/false-sense-of-security/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vNzkyLzIwMTQwMzIyMjEyMTAxOTQyNi5wbmc=.png)\n\nIn practice, characters in a message are delimited by short pauses, typically displayed as spaces. Thus, the message ACM GREATER NY REGION is encoded as:\n\n`.- -.-. -- ..-- --. .-. . .- - . .-. ..-- -. -.-- ..-- .-. . --. .. --- -.`\n\nThe Ohaver's encryption scheme is based on mutilating Morse code, namely by removing the pauses between letters. Since the pauses are necessary (because Morse is a variable-length encoding that is not prefix-free), a string is added that identifies the number of dots and dashes in each character. For example, consider the message `.--.-.--`. Without knowing where the pauses should be, this could be `ACM`, `ANK`, or several other possibilities. If we add length information, such as `.--.-.-- 242`, then the code is unambiguous.\n\nOhaver's scheme has three steps, the same for encryption and decryption: \n1. Convert the text to Morse code without pauses but with a string of numbers to indicate code lengths. \n2. Reverse the string of numbers. \n3. Convert the dots and dashes back into the text using the reversed string of numbers as code lengths.\n\nAs an example, consider the encrypted message `AKADTOF IBOETATUK IJN`. Converting to Morse code with a length string yields:\n\n`.--.-.--..----..-...--..-...---.-.--..--.-..--...----. 232313442431121334242`\n\nBy reversing the numbers and decoding, we get the original message `ACM GREATER NY REGION`.\n\nThe security of this encoding scheme is not too high but Freddy believes it is sufficient for his purposes. Will you help Freddy to implement this encoding algorithm and to protect his sensitive information?\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe input will consist of several messages encoded with Ohaver's algorithm, each of them on one line. Each message will use only the twenty-six capital letters, underscores, commas, periods, and question marks. Messages will not exceed $1000$ characters in length.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each message in the input, output the decoded message on one line.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>FENDSVTSLHW.EDATS,EULAY\nTRDNWPLOEF\nNTTTGAZEJUIIGDUZEHKUE\nQEWOISE.EIVCAEFNRXTBELYTGD.\n?EJHUT.TSMYGW?EJHOT\nDSU.XFNCJEVE.OE_UJDXNO_YHU?VIDWDHPDJIKXZT?E\nADAWEKHZN,OTEATWRZMZN_IDWCZGTEPION</td><td>FALSE_SENSE_OF_SECURITY\nCTU_PRAGUE\nTWO_THOUSAND_THIRTEEN\nQUOTH_THE_RAVEN,_NEVERMORE.\nTO_BE_OR_NOT_TO_BE?\nTHE_QUICK_BROWN_FOX_JUMPS_OVER_THE_LAZY_DOG\nADAPTED_FROM_ACM_GREATER_NY_REGION</td></tr></table>\n\n"},{"title":"Note","format":"markdown","require":["katex"],"content":"\nAdapted from Greater New York ACM Regionals 2001\n"}]}