{"title":"Finding Nemo","time_limit":10000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/finding-nemo/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nNemo is a naughty boy. One day he went into the deep sea all by himself. Unfortunately, he became lost and couldn't find his way home. Therefore, he sent a signal to his father, Marlin, to ask for help.\n\nAfter checking the map, Marlin found that the sea is like a labyrinth with walls and doors. All the walls are parallel to the $X$-axis or to the $Y$-axis. The thickness of the walls are assumed to be zero.\n\nAll the doors are opened on the walls and have a length of $1$. Marlin cannot go through a wall unless there is a door on the wall. Because going through a door is dangerous (there may be some virulent medusas near the doors), Marlin wants to go through as few doors as he could to find Nemo.\n\nFigure-$1$ shows an example of the labyrinth and the path Marlin went through to find Nemo. \n\n![title](/source/lutece/finding-nemo/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vNDAzLzIwMTQwODEyMjI0NzIwNTU4Ni5qcGc=.jpg)\n\nWe assume Marlin's initial position is at $(0, 0)$. Given the position of Nemo and the configuration of walls and doors, please write a program to calculate the minimum number of doors Marlin has to go through in order to reach Nemo.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input is an integer $T$ ($T \\leq 100$), which stands for the number of test cases you need to solve.\n\nEach test case is started by two non-negative integers $M$ and $N$. $M$ represents the number of walls in the labyrinth and $N$ represents the number of doors.\n\nThen follow $M$ lines, each containing four integers that describe a wall in the following format:`x y d t`\n\n$(x, y)$ indicates the lower-left point of the wall, $d$ is the direction of the wall -- $0$ means it's parallel to the $X$-axis and $1$ means that it's parallel to the $Y$-axis, and $t$ gives the length of the wall.\n\nThe coordinates of two ends of any wall will be in the range of $[1,199]$.\n\nThen there are $N$ lines that give the description of the doors:`x y d`\n$x, y, d$ have the same meaning as the walls. As the doors have fixed length of $1$, $t$ is omitted.\n\nThe last line of each case contains two positive float numbers:`f1 f2`\n$(f\\_1, f\\_2)$ gives the position of Nemo. And it will not lie within any wall or door.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor every test case, you should output `Case #k: ` first, where $k$ indicates the case number and starts at $1$. please output the minimum number of doors Marlin has to go through in order to rescue his son. If he can't reach Nemo, output $-1$.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n8 9\n1 1 1 3\n2 1 1 3\n3 1 1 3\n4 1 1 3\n1 1 0 3\n1 2 0 3\n1 3 0 3\n1 4 0 3\n2 1 1\n2 2 1\n2 3 1\n3 1 1\n3 2 1\n3 3 1\n1 2 0\n3 3 0\n4 3 1\n1.5 1.5\n4 0\n1 1 0 1\n1 1 1 1\n2 1 1 1\n1 2 0 1\n1.5 1.7</td><td>Case #1: 5\nCase #2: -1</td></tr></table>\n\n"}]}