{"title":"First Blood!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/first-blood/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nCaptain Chen attended a programming contest. He was not happy with the result for the lack of first blood earned by him. \nFirst blood here means being the first one to solve a problem.\nHowever, the host suddenly said that there was something wrong with the database.\n\nThe database here is quite simple, only two keys are involved, that is the team's name and it's submission result.\nThe name of Captain Chen's team is `Captain_Chen` itself.\nAnd the format of the submission result is `X_ZZ`. `X` here means the id of the problem, can be one of the letter between `A` ... `Z`. `ZZ` here is the result of the submission, can be `AC` or `WA`, meaning `Accepted` or `Wrong Answer`.\n\nNow, the host said they missed ** ONLY ONE ** submission result, thus all the submission results after that submission were wrongly placed.\nAdditionally, the missing submission is known to be a `Wrong Answer`, however, the actual position of the missing one is still unclear.\n\nCaptain Chen wants to know the maximum number of first blood he have a chance to earn, among all the possible positions of the missing submission.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input contains $3$ integers, $N, M, K$ $100\\leq N\\leq 150, 1\\leq M\\leq 12, 1\\leq K\\leq 10^6$, indicating the number of teams, the number of problems, the number of submission results.\n\nThe next $K-1$ lines contains two strings, indicating the team's name and the submission result. The id of the problem starts from `A`.\n\nThe last line contains one string, indicating the team's name.\n\nThe team's name is a string without `space`, and its length will not exceed $20$\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput the maximum number of first blood he have a chance to earn in a line.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3 2 5\nGOD_Kufeng A_AC\nCaptain_Chen B_WA\nGOD_Kufeng B_AC\nDaye B_AC\nCaptain_Chen</td><td>1</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nThanks to the missing submission result, there will be $K$ teams' names and $K-1$ submission results.\n\nFor the sample case, a possible missing submission might be `A_WA`, if we insert this submission at the beginning, the database will look like this:\n\nGOD_Kufeng A_WA\n\nCaptain_Chen A_AC\n\nGOD_Kufeng B_WA\n\nDaye B_AC\n\nCaptain_Chen B_AC\n\nSo, Captain_Chen gets the `first blood` for Problem A, however, there can be no way for him to get the `first blood` for Problem B at the same time, so the best answer is $1$.\n"}]}