{"title":"Flagstone Walk","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/flagstone-walk/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nThe main hall of UESTC is far from the dormitory. However, poor Hongshu has to go there every day to talk with his teachers. This is the most unhappy thing on the earth. However, Hongshu is so optimistic that he still digs a lot of fun during that boring period.\n\nThere is a long flagstone walk on the way from the dormitory to the main hall. This flagstone walk has $N$ lines and four flagstones arranged in each line. Hongshu always start from rightmost flagstone of the first line. In order to make this walk funny, he would always step onto the left or right flagstone in the next line if there is. For example, if Hongshu stands at the second rightmost flagstone of the third line, he would choose to step to the first or third rightmost one of the forth line. Note that Hongshu has only one choice when he is at the corner of one line.\n\nBecause Hongshu has to go to the main hall every day, he wants to know how many different ways to step across the flagstone walk. Can you help him?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input is an integer $T$ ($T \\leq 20$), which stands for the number of test cases you need to solve.\nEach case consists of an integer $N$ ($1\\leq N\\leq 20$) on a single line, which stands for the length of the walk.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each case, print the number of ways on a single line.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3\n2\n3\n4</td><td>1\n2\n3</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nHongshu has $3$ ways to choose when the length of walk is $4$.\n\n![.*](/source/lutece/flagstone-walk/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vOTkvMjAxNDAxMjkwMDE2MjIyMTEyLnBuZw==.png)\n"}]}