{"title":"Fly Through","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/fly-through/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nThe home of flower fairies is being devastated by a monster called Littlefatcat. They have to leave the place where their generations lived with no other choices. CC, the greatest investigator of flower fairies, found a paradise in the west and will lead all the flower fairies there. This paradise is full of flowers and safe from attack of Littlefatcat. However, there are lots of huge rocks on the way to the paradise.\n\n![.*](/source/lutece/fly-through/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTAwLzIwMTQwMTI5MDAxODQ1ODkzMy5wbmc=.png)\n\nFlower fairies are of different levels which are determined by their power. Fairies of higher level will fly higher. A fairy will persist in flying at the height corresponding to his or her level for honor and self-respect. Also, rocks on the way have specific height. When the route of a fairy hit a rock, the fairy will have to use magic to fly through the rock.\nBeing aware of the height of all rocks and the specific height each fairy can fly at, CC want to know how many rocks each fairy will fly through.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line will be `N M`, representing for the numbers of rocks and fairies. \n\nThe following line will give $N$ numbers, giving the height of the rocks from the east to west.\n\nThen $M$ lines followed. On the $i_{th}$ line, a number representing the specific height of fairy numbered $i$ can fly at will be given.\n\nAll numbers are positive and not bigger than $100000$.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nPlease output the number of rocks each fairy has to fly through in order to get to the paradise in a single line.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>5 3\n1 2 3 4 5\n2\n4\n6</td><td>4\n2\n0</td></tr></table>\n\n"}]}