{"title":"Fun House","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/fun-house/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nAmerican Carnival Makers Inc. (ACM) has a long history of designing rides and attractions. One of their more popular attractions is a fun house that includes a room of mirrors. Their trademark is to set up the room so that when looking forward from the entry door, the exit door appears to be directly ahead. However, the room has double-sided mirrors placed throughout at 45 degree angles. So, the exit door can be on any of the walls of the room. The set designer always places the entry and mirrors, but can never seem to be bothered to place the exit door. One of your jobs as part of the construction crew is to determine the placement of the exit door for the room given an original design.\n\nThe final diagram for a sample room is given below. The asterisk (*) marks the entry way, lower case x's mark the walls, the mirrors are given by the forward and backward slash characters (/ and \\\\), open spaces with no visual obstructions are marked by periods (.), and the desired placement of the exit is marked with an ampersand (&). In the input diagram, there is an 'x' in place of the '&', since the exit has not yet been located. You need to alter the input diagram by replacing the proper 'x' with an '&' to identify the exit. Note that entrances and exits can appear on any of the walls (although never a corner), and that it is physically impossible for the exit to be the same as the entrance. (You don't need to understand why this is so, although it may be fun to think about.)\n\n![title](/source/lutece/fun-house/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTA3Ny8yMDE1MDQxODIzMjEzMDM5NjE2LmpwZw==.jpg)\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nEach room will be preceded by two integers, W and L, where 5 ≤ W ≤ 20 is the width of the room including the border walls and 5 ≤ L ≤ 20 is the length of the room including the border walls. Following the specification of W and L are L additional lines containing the room diagram, with each line having W characters from the alphabet: { * , x , . , / , \\ }. The perimeter will always be comprised of walls, except for one asterisk (*) which marks the entrance; the exit is not (yet) marked. A line with two zeros indicates the end of input data.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, the first line will contain the word, HOUSE, followed by a space and then an integer that identifies the given fun house sequentially. Following that should be a room diagram which includes the proper placement of the exit door, as marked by an ampersand (&).\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>11 6\nxxxxxxxxxxx\nx../..\\...x\nx..../....x\n*../......x\nx.........x\nxxxxxxxxxxx\n5 5\nxxxxx\n*...x\nx...x\nx...x\nxxxxx\n5 5\nxxxxx\nx./\\x\n*./.x\nx..\\x\nxxxxx\n6 6\nxxx*xx\nx/...x\nx....x\nx/./.x\nx\\./.x\nxxxxxx\n10 10\nxxxxxxxxxx\nx.../\\...x\nx........x\nx........x\nx.../\\..\\x\n*...\\/../x\nx........x\nx........x\nx...\\/...x\nxxxxxxxxxx\n0 0</td><td>HOUSE 1\nxxxxxxxxxxx\nx../..\\...x\nx..../....x\n*../......x\nx.........x\nxxxxxx&xxxx\nHOUSE 2\nxxxxx\n*...&\nx...x\nx...x\nxxxxx\nHOUSE 3\nxxxxx\nx./\\x\n*./.x\nx..\\&\nxxxxx\nHOUSE 4\nxxx*xx\nx/...x\nx....x\nx/./.&\nx\\./.x\nxxxxxx\nHOUSE 5\nxxxxxxxxxx\nx.../\\...x\nx........x\nx........x\n&.../\\..\\x\n*...\\/../x\nx........x\nx........x\nx...\\/...x\nxxxxxxxxxx</td></tr></table>\n\n"},{"title":"Note","format":"markdown","require":["katex"],"content":"\nIn both Java and C++ the backslash character (\\) has special meaning as an escape character within character and string literals. You must use the combination \\\\ to express a single backslash within a character or string literal within source code.\n"}]}