{"title":"Furry Nuisance","time_limit":2000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/furry-nuisance/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nIn order to protect himself from evil bunnies, Freddy decided to install an automatic system to detect them in pictures from surveillance cameras. Sophisticated software detects important points in the picture and lines between them. Unfortunately, the terrain in the pictures is quite varied and lot of the points and lines are actually not bunnies.\n\nYou have made the following observation: Each bunny has four paws and a body joining them.Based on this observation, write a program to decide whether a given picture can possibly contain a bunny.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input contains several test cases. The first line of each test case contains two integers $n$ and $m$ ($0\\leq n\\leq 10,000$, $0\\leq m\\leq 20,000$), giving the number of points and lines in the image,respectively. Each of the m following lines contains two distinct integers $x$ and $y$ ($1\\leq x, y\\leq n$),indicating that the points $x$ and $y$ are directly joined by a line. You may assume that each pair of points is joined by at most one direct line and that no point is directly joined with itself.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each input instance, output `YES` if the picture can contain a bunny, and `NO` otherwise.The picture can contain a bunny if it is possible to remove some of the points and lines so that the resulting image is connected and has exactly $4$ paws.\n\nThe image is said to be connected if (and only if ) each two points are joined with each other by one or more successive lines. A paw is a point which is directly joined with exactly one other point.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2 1\n1 2\n5 4\n1 2\n1 3\n1 4\n1 5</td><td>NO\nYES</td></tr></table>\n\n"}]}