{"title":"Gathering","time_limit":2000,"memory_limit":256,"url":"https://acm.uestc.edu.cn/problem/gathering/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\n![title](/source/lutece/gathering/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTExOC8yMDE1MDUxNjE2MzI0NTI2MzczLmpwZw==.jpg)\n\nThe citizens of Fictitia have had enough! The city keeps getting bigger and bigger, and all the more boring. Fictitia consists of horizontal and vertical streets only. The distance between each pair of neighboring parallel streets is always the same; we take this as the unit distance. Surely some variation could not hurt?\n\nIn order to draw more support and make their unhappiness known to the municipality, a group of citizens has agreed to gather at an intersection of the city to protest. The question is: which intersection? Since there is not much difference between them, the idea was raised to select an intersection $(x^∗,y^∗)$ that minimizes the total distance everyone has to travel. Since everyone lives close to an intersection, the individual distance travelled by someone who lives at $(x,y)$ is given by $|x−x^∗|+|y−y^∗|$.\n\nHowever, this could present a problem for the people who live far away, since they might have trouble getting there in time. Therefore it was decided that the intersection should be at most a certain distance $d$ away from everyone. Given that restriction, can you help them identify an intersection that minimizes the total distance everyone has to travel?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input consists of:\n\n>#####one line with one integer n $(2≤n≤100000)$, the number of citizens;\n>#####n lines each with two integers x and y $(0≤x,y≤10^9)$, the coordinates of each citizen’s house;\n>#####one line with one integer d $(0≤d≤2⋅10^9)$, the maximum distance that each citizen should have to travel.\n\nIt is possible for multiple citizens to live at the same intersection.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput one line with a single integer: the smallest possible total distance that all citizens need to travel. If there is no intersection that everyone lives within a distance d of, output “impossible” instead.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>5\n3 1\n4 1\n5 9\n2 6\n5 3\n10</td><td>18</td></tr><tr><td>5\n3 1\n4 1\n5 9\n2 6\n5 3\n5</td><td>20</td></tr><tr><td>5\n3 1\n4 1\n5 9\n2 6\n5 3\n4</td><td>impossible</td></tr></table>\n\n"}]}