{"title":"Ginkgo","time_limit":3000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/ginkgo/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nYou know, this year's UESTC programming contest is coming. After the register time, we learn that the number of participants exceeded $600$! No doubt every former and current UESTC ACMer is waiting long for this moment. They have imagined thousands of balloons simultaneously rise up for several times, but now, the dream comes true!\n\nAfter the opening ceremony, the organizers started to debate on the holding place. One of them, Richard, offered an idea:\n\n\"It's a historic time, right? So, why not make the tournament hall in the ginkgo forest?\"\n\nWhat an attractive option! Running a competition in the open air could relieve the pressure, also we make all UESTCers experience a real ACM/ICPC contest!\n\nThe committee finally approved this suggestion, and let Richard submit a detailed plan first. After a short while, Richard found he was in trouble with enclosing an empty ground due to his poor geometry knowledge. So, he posted this problem in hopes that any smart guy could help him (He will offer you a balloon as your prize, ^_^).\n\nRichard's problem is: During the final phase, as all teams are scattered in the forest, they are permitted to select any place they like in the forest. To restrict the participants, we use string to enclose a polygon ground with all teams setting inside or on the boundary of this polygon. We fasten the string to the trees, so we should pick some trees as the vertices of this polygon.\n\nThe problem is, Richard wanted to choose the fewest trees to finish this task. It's hard, and he has worked on this for days. However, you may know an efficient solution for this puzzle.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input contains one integer $T$, which indicate the number of test cases.\n\nFor each case, the first line contains two numbers $n$ ($3\\leq n\\leq 500$) and $m$ ($3\\leq m\\leq 500$), standing for n teams and m trees. The next $n$ lines contain the location of the $n$ teams, each line has two real numbers $x$ and $y$, describing the $x$ and $y$ coordinates. The next $m$ lines contain the location of the $m$ trees, and also two real numbers $x$ and $y$ on each line describe the coordinate.\n\nTo simplify the problem, the absolute values of all $x$-coordinates and $y$-coordiantes are less than $10001$.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOnly one number, indicating the fewest trees used to form a satisfied polygon; or $-1$ meaning there's no such polygon.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n6 5\n1 3\n4 6\n5 4\n4 1\n3 5\n2 3\n1 6\n6 6\n6 1\n7 4\n1 1\n2 4\n3 1\n3 3\n1 1\n2 2\n3 3\n5 1</td><td>4\n3</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\n1. Assume $v\\_1$ and $v\\_2$ are two vertices of your polygon, and there's another vertex $v\\_3$. If $v\\_3$ lies on the line formed by $v\\_1$ and $v\\_2$, you don't need to take $v\\_3$ into account (See Sample $2$ for clarification).\n2. Of course, no two teams take a seat in the same place, and no two trees are planted in the same place either.\n"}]}