{"title":"HS BDC","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/hs-bdc/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nIELTS is around the corner! love8909 has registered for the exam, but he still hasn’t got prepared. Now he decides to take actions. But when he takes out the New Oriental IELTS Vocabulary, he finds there are so many words. But love8909 doesn’t get scared, because he has got a special skill. If he can make a list with some meaningful words, he will quickly remember these words and will not forget them. If the last letter of some word Wa is the same as the first letter of some word Wb, then you can connect these two words and make a list of two words. If you can connect a word to a list, you will make a longer list.\n\nWhile love8909 is making the list, he finds that some words are still meaningful words if you reverse them. For example, if you reverse the word `pat`, you will get another meaningful word `tap`.\n\nAfter scanning the vocabulary, love8909 has found there are $N$ words, some of them are meaningful if reversed, while others are not. Now he wonders whether he can remember all these words using his special skill.\n\nThe N-word list must contain every word once and only once.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nAn integer $T$ ($T\\leq 50$) comes on the first line, indicating the number of test cases.\n\nOn the first line of each test cases is an integer $N$ ($N\\leq 1000$), telling you that there are $N$ words that love8909 wants to remember. Then comes $N$ lines. Each of the following $N$ lines has this format: word type. Word will be a string with only `a`~`z`, and type will be $0$(not meaningful when reversed) or $1$(meaningful when reversed). The length of each word is guaranteed to be less than $20$.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nThe format of the output is like `Case t: s`, $t$ is the number of the test cases, starting from $1$, and s is a string.\nFor each test case, if love8909 can remember all the words, s will be `Well done!`, otherwise it’s `Poor boy!`\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3\n6\naloha 0\narachnid 0\ndog 0\ngopher 0\ntar 1\ntiger 0\n3\nthee 1\nearn 0\nnothing 0\n2\npat 1\nacm 0</td><td>Case 1: Well done!\nCase 2: Well done!\nCase 3: Poor boy!</td></tr></table>\n\n"},{"title":"Note","format":"markdown","require":["katex"],"content":"\nIn the first case, the word `tar` is still meaningful when reversed, and love8909 can make a list as `aloha-arachnid-dog-gopher-rat-tiger`. In the second case, the word `thee` is still meaningful when reversed, and love8909 can make a list as `thee-earn-nothing`. In the third case, no lists can be created.\n"}]}