{"title":"Hyacinth","time_limit":2000,"memory_limit":256,"url":"https://acm.uestc.edu.cn/problem/hyacinth/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\n![title](/source/lutece/hyacinth/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTExOS8yMDE1MDUxNjIyMTY0MjUzNDgyLmpwZw==.jpg)\n\nAs a new employee at the Northwestern Europe Routing Company (NWERC), you do a lot of thinking about wireless network architectures. Lately you learned about a multi-channel mesh network architecture (called Hyacinth) that equips each mesh network node with multiple network interface cards (NICs) to increase the network throughput. You can choose a channel frequency for each NIC. In order to communicate, for every two network nodes that are in range of each other, their NICs must share at least one common frequency. The theoretical throughput is optimal when the total number of used frequencies in the network is maximal.\n\nYour bosses at NWERC want you to figure out a procedure for assigning frequencies to the NICs such that the number of frequencies in use is maximized, subject to the constraint that all pairs of adjacent nodes must be able to communicate. A frequency is considered used if any pair of nodes within range of each other share that frequency. In the mesh network that you will be dealing with, each node is equipped with exactly two NICs (i.e., each node can use at most two frequencies). Since you are new at NWERC, your bosses further restrict the network layouts to make your job easier: the network graph will form a tree.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input consists of:\n\n>#####one line with one integer n $(2≤n≤10000)$, the number of nodes in the network;\n>#####n−1 lines, each with two space-separated integers i and j, with $1≤i,j≤n$ signifying that the (one-indexed) network nodes i and j are in range of each other.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput a frequency assignment for each of the $2n$ NICs such that all adjacent nodes can communicate and the number of used frequencies is maximized. You should output $n$ lines, where the ith line contains the two frequencies of network node i. Valid frequencies are nonnegative integers less than $10^9$.\n\n`If there are several correct answers, you can output any of them. `\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n1 2</td><td>23 42\n42 23</td></tr><tr><td>14\n1 2\n1 3\n1 4\n2 5\n2 6\n3 7\n4 8\n4 9\n4 10\n7 11\n7 12\n7 13\n7 14</td><td>4711 815\n666 4711\n4711 42\n815 7\n47 666\n666 54\n23 42\n7 2\n7 1\n7 3\n23 4\n42 5\n23 6\n42 8</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\n`Sample Output is not the only answer of Sample Input.` Any answer satisfying the conditions will be considered correct.\n\nFor example, in the first case, the following output is also find.\n\n>#####42 23\n>#####23 42\n"}]}