{"title":"Indoorienteering","time_limit":10000,"memory_limit":256,"url":"https://acm.uestc.edu.cn/problem/indoorienteering/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\n![title](/source/lutece/indoorienteering/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTEyMC8yMDE1MDUxNjE3MTQzOTI5NTc0LmpwZw==.jpg)\n\nLukáš really likes orienteering, a sport that requires locating control points in rough terrain. To entertain the NWERC participants Lukáš wants to organize an orienteering race. However, it would be too harsh for the participants to be outdoors in this cold Swedish November weather, so he decided to jump on the new trend of indoor races, and set the race inside the B building of Linköping University.\n\nLukáš has already decided on the locations of the control points. He has also decided on the exact length of the race, so the only thing remaining is to decide in which order the control points should be visited such that the length of the total race is as he wishes. Because this is not always possible, he asks you to write a program to help him.\n\nNote from the organizer: the NWERC indoorienteering race for this year has been cancelled since we neglected to apply for an orienteering permit in time from the university administration. (We still need you to solve the problem so that we can organize it for next year.)\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input consists of:\n\n>#####one line with two integers n $(2≤n≤14)$ and L $(1≤L≤10^{15})$, the number of control points and the desired length of the race, respectively;\n>#####n lines with n integers each. The jth integer on the ith line, dij, denotes the distance between control point i and j ($1≤ dij ≤L$ for $i≠j$, and $dii=0$). For all $1≤i,j,k≤N$ it is the case that $dij=dji$ and $dij≤dik+dkj$.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput one line with “possible” if it is possible to visit all control points once in some order and directly return to the first one such that the total distance is exactly L, and “impossible” otherwise.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>4 10\n0 3 2 1\n3 0 1 3\n2 1 0 2\n1 3 2 0</td><td>possible</td></tr><tr><td>3 5\n0 1 2\n1 0 3\n2 3 0</td><td>impossible</td></tr></table>\n\n"}]}