{"title":"Infected Land","time_limit":10000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/infected-land/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nThe earth is under an attack of a deadly virus. Luckily, prompt actions of the Ministry of\nHealth against this emergency successfully confined the spread of the infection within a square\ngrid of areas. Recently, public health specialists found an interesting pattern with regard to the\ntransition of infected areas. At each step in time, every area in the grid changes its infection\nstate according to infection states of its directly (horizontally, vertically, and diagonally) adjacent areas.\n\n* An infected area continues to be infected if it has two or three adjacent infected areas.\n* An uninfected area becomes infected if it has exactly three adjacent infected areas.\n* An area becomes free of the virus, otherwise.\n\nYour mission is to fight against the virus and disinfect all the areas. The Ministry of Health\nlets an anti-virus vehicle prototype under your command. The functionality of the vehicle is\nsummarized as follows.\n\nAt the beginning of each time step, you move the vehicle to one of the eight adjacent areas.\nThe vehicle is not allowed to move to an infected area (to protect its operators from the\nvirus). It is not allowed to stay in the same area.\n\nFollowing vehicle motion, all the areas, except for the area where the vehicle is in, change\ntheir infection states according to the transition rules described above.\n\nSpecial functionality of the vehicle protects its area from virus infection even if the area\nis adjacent to exactly three infected areas. Unfortunately, this virus-protection capability\nof the vehicle does not last. Once the vehicle leaves the area, depending on the infection\nstates of the adjacent areas, the area can be infected.\n\nThe area where the vehicle is in, which is uninfected, has the same effect to its adjacent\nareas as an infected area as far as the transition rules are concerned.\n\nThe following series of figures illustrate a sample scenario that successfully achieves the goal.\nInitially, your vehicle denoted by `@` is found at $(1, 5)$ in a $5\\times 5$-grid of areas, and you see some infected areas which are denoted by `#`’s.\n\n![title](/source/lutece/infected-land/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMjEzLzIwMTQwMzE3MjEyNTQ4MTg5MS5qcGc=.jpg)\n\nFirstly, at the beginning of time step $1$, you move your vehicle diagonally to the southwest,\nthat is, to the area $(2, 4)$. Note that this vehicle motion was possible because this area was not\ninfected at the start of time step $1$.\n\nFollowing this vehicle motion, infection state of each area changes according to the transition\nrules. The column “$1$-end” of the figure illustrates the result of such changes at the end of time step $1$. Note that the area $(3, 3)$ becomes infected because there were two adjacent infected areas and the vehicle was also in an adjacent area, three areas in total.\n\nIn time step $2$, you move your vehicle to the west and position it at $(2, 3)$.\nThen infection states of other areas change. Note that even if your vehicle had exactly three\ninfected adjacent areas (west, southwest, and south), the area that is being visited by the vehicle is not infected. The result of such changes at the end of time step $2$ is as depicted in “$2$-end”.\n\nFinally, in time step $3$, you move your vehicle to the east. After the change of the infection\nstates, you see that all the areas have become virus free! This completely disinfected situation\nis the goal. In the scenario we have seen, you have successfully disinfected all the areas in three time steps by commanding the vehicle to move $(1)$ southwest, $(2)$ west, and $(3)$ east.\n\nYour mission is to find the length of the shortest sequence(s) of vehicle motion commands that\ncan successfully disinfect all the areas.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe input is a sequence of datasets. The end of the input is indicated by a line containing a\nsingle zero. Each dataset is formatted as follows.\n\nHere, n is the size of the grid. That means that the grid is comprised of $n\\times n$ areas. You\nmay assume $1\\leq n\\leq 5$. The rest of the dataset consists of $n$ lines of $n$ letters. Each letter $a\\_{ij}$\nspecifies the state of the area at the beginning: `#` for infection, `.` for free of virus, and `@` for the initial location of the vehicle. The only character that can appear in a line is `#`, `.`, or `@`.Among $n\\times n$ areas, there exists exactly one area which has `@`.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each dataset, output the minimum number of time steps that is required to disinfect all the\nareas. If there exists no motion command sequence that leads to complete disinfection, output\n$-1$. The output should not contain any other extra character.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3\n...\n.@.\n...\n3\n.##\n.#.\n@##\n3\n##.\n#..\n@..\n5\n....@\n##...\n#....\n...#.\n##.##\n5\n#...#\n...#.\n#....\n...##\n..@..\n5\n#....\n.....\n.....\n.....\n..@..\n5\n#..#.\n#.#.#\n.#.#.\n....#\n.#@##\n5\n..##.\n..#..\n#....\n#....\n.#@..\n0</td><td>0\n10\n-1\n3\n2\n1\n6\n4</td></tr></table>\n\n"}]}