{"title":"Instantaneous Transference","time_limit":3000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/instantaneous-transference/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nIt was long ago when we played the game Red Alert. There is a magic function for the game objects which is called instantaneous transfer. When an object uses this magic function, it will be transferred to the specified point immediately, regardless of how far it is.\n\nNow there is a mining area, and you are driving an ore-miner truck. Your mission is to take the maximum ores in the field.\n\nThe ore area is a rectangle region which is composed by $n \\times m$ small squares, some of the squares have numbers of ores, while some do not. The ores can't be regenerated after taken. \n\nThe starting position of the ore-miner truck is the northwest corner of the field. It must move to the eastern or southern adjacent square, while it can not move to the northern or western adjacent square. And some squares have magic power that can instantaneously transfer the truck to a certain square specified. However, as the captain of the ore-miner truck, you can decide whether to use this magic power or to stay still. One magic power square will never lose its magic power; you can use the magic power whenever you get there.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input is an integer $T$ which indicates the number of test cases.\n\nFor each of the test case, the first will be two integers $N, M (1 \\leq N, M \\leq 40)$.\n\nThe next $N$ lines will describe the map of the mine field. Each of the N lines will be a string that contains $M$ characters. Each character will be an integer $X (0 \\leq X \\leq 9)$ or a `*` or a `#`. The integer $X$ indicates that square has $X$ units of ores, which your truck could get them all. The `*` indicates this square has a magic power which can transfer truck within an instant. The `#` indicates this square is full of rock and the truck can't move on this square. You can assume that the starting position of the truck will never be a `#` square.\n\nAs the map indicates, there are $K$ `*` on the map. Then there follows $K$ lines after the map. The next $K$ lines describe the specified target coordinates for the squares with `*`, in the order from north to south then west to east. (the original point is the northwest corner, the coordinate is formatted as north-south, west-east, all from $0$ to $N - 1,M - 1$).\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case output the maximum units of ores you can take.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>1\n2 2\n11\n1*\n0 0</td><td>3</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nThe data used in this problem is unofficial data prepared by allenlowesy. So any mistake here does not imply mistake in the offcial judge data.\n"}]}