{"title":"Interesting Marble","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/interesting-marble/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nMarble (also called \"Hitting the bricks\") is a famous video game with a long history. During the game, the player is required to control a single ball to hit the bricks above. The ball will rebound when touching the wall or the paddle the player controls at the bottom. If the player's paddle misses the ball's rebound, the game will over.\n\nLvba developed a new version of the game. The new game is played inside a $S\\times S$ square. There are no bricks, but a lot of balls. Those balls will move simultaneously at the beginning of the game. All the balls' horizontal and vertical velocity is equal to $1$ or $-1$, so there are four different moving directions in total. The player has a paddle at the bottom, if the paddle misses a ball's rebound, that ball will fall off and disappear. \n\nThe goal of the new game is to find an initial position of the paddle at the bottom, and a strategy to move the paddle horizontally, to make sure that maximum number of balls will not fall off the bottom and will move inside the square forever. The moving speed of the paddle is also equal to $1$.\n\n![title](/source/lutece/interesting-marble/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vNTc1LzIwMTQwODI3MjEyNzM2NDExMjIucG5n.png)\n\nYou may assume the balls are small enough to be regarded as points, and the paddle is a segment of length $1$. The ball will rebound when touching the paddle or the walls. The balls' initial positions are strictly inside the square. You should notice that the balls will not affect each other when their positions coincide.\n\nNow given the initial position of the balls, and their moving directions, please find the maximum number of the balls that will be kept moving forever.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input will be an integer $T$ indicating the number of cases. ($T\\leq 50$)\n\nFor each case, the first line contains two integers: $N$ ($1\\leq N\\leq 100$), $S$ ($1\\leq S\\leq 10000$), representing the number of the balls, and the side length of the square. Then $N$ lines follow, each in the format of `x y vx vy`.\n\n$(x,y)$ is the position of the balls. We set the original point at the lower left corner of the square, the bottom as $x$-axis, and the left wall as $y$-axis.\n\n$(v\\_x,v\\_y)$ is the ball's velocity at the beginning of the game, in which $v\\_x$ and $v\\_y$ equals $-1$ or $1$.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each case, you need to output two lines. Print `Case #k: S` first in a single line, in which $k$ represents the case number which starts from $1$, $S$ is the maximum number of balls the player can keep.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n3 4\n1 1 1 1\n2 1 1 1\n3 3 -1 1\n2 4\n1 1 -1 -1\n2 1 -1 -1</td><td>Case #1: 3\nCase #2: 2</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\n1. It is not allowed to move the paddle out of the square.\n2. The ball rebounds according to the physical law, for example, if a ball touches the left side of the wall with speed $(v\\_x=-1, v\\_y=1)$, its speed will turn to $(1,1)$; Moreover, if a ball touches the lower left corner with speed $(v\\_x=-1, v\\_y=-1)$, its speed will turn to $(1,1)$.\n3. The picture shows the second case in sample input.\n"}]}