{"title":"Jingle Balls","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/jingle-balls/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nIt will soon be time to decorate the Christmas tree.\nThe NWERC judges are already debating the optimal way to put decorations in a tree.\nThey agree that it is essential to distribute the decorations evenly over the branches of the tree.\n\nThis problem is limited to binary Christmas trees.\nSuch trees consist of a trunk, which splits into two subtrees.\nEach subtree may itself split further into two smaller subtrees and so on.\nA subtree that does not split any further is a twig.\nA twig may be decorated by attaching at most one ball to it.\n\n<p class=\"text-center\"><img src=\"/source/lutece/jingle-balls/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vODk3LzIwMTQwNTIzMTMzODE3ODQ2MTQucG5n.png\" alt=\"title\"></p>\n\n*Example of a tree with subtrees, twigs and one ball.*\n\nA decorated tree has an even distribution of balls if and only if the following requirement is satisfied: \n\nAt every point where a (sub)tree splits into two smaller subtrees $t\\_1$ and $t\\_2$, the total number of balls in the left subtree $\\mathrm{N}(t\\_1$) and the total number of balls in the right subtree $\\mathrm{N}(t\\_2)$ must either be equal or differ by one. That is:\n $~ |~ \\mathrm{N}(t\\_1) - \\mathrm{N}(t\\_2) ~| \\le 1$.\n\nIn their enthusiasm, the judges initially attach balls to arbitrary twigs in the tree.\nWhen they can not find any more balls to put in the tree, they stand back and consider the result.\nIn most cases, the distribution of the balls is not quite even.\nThey decide to fix this by moving some of the balls to different twigs.\n\nGiven the structure of the tree and the initial locations of the balls, calculate the minimum number of balls that must be moved to achieve an even distribution as defined above.\n\nNote that it is not allowed to add new balls to the tree or to permanently remove balls from the tree.\nThe only way in which the tree may be changed is by moving balls to different twigs.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nFor each test case, the input consists of one line describing a decorated tree.\n\nThe description of a tree consists of a recursive description of its subtrees.\nA (sub)tree is represented by a string in one of the following forms:\n* The string `()` represents a twig without a ball.\n* The string `(B)` represents a twig with a ball attached to it.\n* The string `(`$t\\_1$$t\\_2$`)` represents a (sub)tree that splits into the two smaller subtrees represented by $t\\_1$ and $t\\_2$, where $t\\_1$ and $t\\_2$ are strings in one of the forms listed here.\n\nA tree contains at least $2$ and at most $1000$ twigs.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, print one line of output.\n\nIf it is possible to distribute the balls evenly through the tree, print the minimum number of balls that must be moved to satisfy the requirement of even distribution.\n\nIf it is not possible to distribute the balls evenly, print the word `impossible`.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>((B)())\n((((B)(B))((B)()))(B))\n(()(((B)(B))(B)))</td><td>0\nimpossible\n1</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\n<p class=\"text-center\"><img src=\"/source/lutece/jingle-balls/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vODk3LzIwMTQwNTIzMTM0MTM1NDIyMTUucG5n.png\" alt=\"title\"></p>\n\n*Trees corresponding to the example input cases.*\n"}]}