{"title":"Kastenlauf","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/kastenlauf/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nOnce every year, Jo and his friends want to visit the local fair in Erlangen, called Bergkirchweih.\nThis year, they want to make a Kastenlauf (box run). They start at Jo's home, and have one box\n(Kasten) of beer (with twenty bottles). As they are very thirsty, they drink one bottle of beer every\n$50$ metres.\n\nAs the way from Jo's home to the Bergkirchweih is pretty long, they need more beer than they have\ninitially. Fortunately, there are stores selling beer on the way. When they visit a store, they can\ndrop their empty bottles and buy new bottles, but their total number of full bottles will not be more\nthan twenty (because they are too lazy to carry more than one full box).\n\nYou are given the coordinates of the stores, of Jo's home and of the location of the Bergkirchweih.\nWrite a program to determine whether Jo and his friends can happily reach the Bergkirchweih, or\nwhether they will run out of beer on the way.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nInput starts with one line containing the number of test cases $t$ ($t\\leq 50$).\n\nEach test case starts with one line, containing the number n of stores selling beer (with $0\\leq n\\leq 100$).\nThe next $n + 2$ lines cointain (in this order) the location of Jo's home, of the stores, and of the\nBergkirchweih. The location is given with two integer coordinates $x$ and $y$, (both in meters, $−32768\\leq\nx,y\\leq 32767$).\n\nAs Erlangen is a rectangularly laid out city, the distance between two locations is the difference of\nthe first coordinate plus the difference of the second coordinate (also called Manhattan-Metric).\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case print one line, containing either `happy` (if Jo and his friends can happily reach\nthe Bergkirchweih), or `sad` (if they will run out of beer on the way).\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n2\n0 0\n1000 0\n1000 1000\n2000 1000\n2\n0 0\n1000 0\n2000 1000\n2000 2000</td><td>happy\nsad</td></tr></table>\n\n"}]}