{"title":"Killer on the Way","time_limit":5000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/killer-on-the-way/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nHouraisan Kaguya (蓬萊山輝夜) is the NEET (not in education, employment or training) princess living in Eientei (永遠亭). She is an unemployed geek, who sits at home and surfs the Internet all day. But today is different, as the Hakurei Shrine Reitaisai Festival (博麗神社例大祭) will be hosted in Hakurei Shrine, Kaguya decides to go to buy some new doujin games. \n\nFujiwara no Mokou (藤原妹紅) detests Kaguya, and has been planing to attack her for a long time. But she nerver got the chance before because Kaguya kept staying in Eientei, under the protection of Yagokoro Eirin (八意永琳). Knowing that Kaguya will go outside today, Mokou decides to wait on certain road and attack her once she passes there. Mokou don't know which path Kaguya will choose, but she thinks that there always exits some roads where she can always meet Kaguya.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThere are multiple cases. Each case begins with two integers $2\\leq n\\leq 10000$ -- the number of villages and $2\\leq m\\leq 100000$ -- the number of roads. Then $m$ lines, each contains two integers $a$ and $b$ ($0\\leq a, b < n$), indicating a road connecting village $a$ and village $b$. Village $0$ is Eientei and Village $n-1$ is Hakurei Shrine. They are always connected by roads. There may be more than one roads between two villages.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFind out the roads where Mokou can always meet Kaguya. For each case, output the number of roads in the first line, then output the numbers of the roads in ascending order in the second line. If the number is $0$,also output a line without anything.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>3 2\n0 1\n1 2\n\n7 8\n0 1\n0 2\n1 3\n2 3\n3 4\n3 5\n4 6\n5 6</td><td>2\n0 1\n0</td></tr></table>\n\n"}]}