{"title":"Knight and Rook","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/knight-and-rook/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nTotalfrank has played chess for more than ten years. Recently he invents a chess game named Knight and Rook!\n\nThe rule of this game is simple: given a board of size $n\\times m$, which has some obstacles on it, you need to calculate the minimum number of steps to move a chessman from a start position to an end position. \n\nThere are two kinds of chessman in this game, one is knight and the other one is rook. In each step, a rook can go vertically or horizontally as long as there is no obstacle on the route, and a knight can only go to $8$ grids which are shown below:\n\n![title](/source/lutece/knight-and-rook/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMzgxLzIwMTQwNDExMTk0OTUwNDM2MzkucG5n.png)\n\nOf course, a knight can’t move to a grid which is an obstacle or out of the chess board, neither a rook can.\n\nAt the start of the game, you choose a chessman (either a knight or a rook) to put it on the start position. You can switch it to the other one during the game to move to the end position. Switch isn’t considered as one step, but you have at most one chance to switch. Please tell me the minimum number of steps you need to finish this game.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input is an integer $T$ ($T\\leq 20$), which stands for the number of test cases you need to solve.\n\nEach test case begins with two integers $n$, $m$ ($1\\leq n, m\\leq 100$) in the first line indicating the size of the board. Then n lines follow, each line consists of $m$ characters which are:\n* `.` : represents an grid which a chessman can step on.\n* `#`: represents an obstacle which a chessman cannot step on.\n* `s`: represents the start position and there is exactly one `s` on the board.\n* `t`: represents the end position and there is exactly one `t` on the board\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor every test case, you should output `Case #k: ` first, where $k$ indicates the case number and starts at $1$. Then if it’s impossible to reach the end position, just output `-1`. Otherwise, output the minimum number of steps to this question.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>4\n2 3\ns..\n..t\n2 3\ns##\n.t#\n2 3\ns#t\n...\n2 3\ns#t\n###</td><td>Case #1: 1\nCase #2: 2\nCase #3: 2\nCase #4: -1</td></tr></table>\n\n"}]}