{"title":"Maze Break","time_limit":3000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/maze-break/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nOne day, TheBeet found that there is a maze in ArXoR's company, deeply hiden in underground. Unfortunately, he was caught while tring to explore it. ArXoR was always a good man, and was going to thrown the curious man into the maze without any food and water.\n\nOf course, TheBeet wanted to escape.\n\nThe maze consists $n$ rooms numbered $0, 1, \\cdots n - 1,$ and $m$ directed tunnels between rooms. Each tunnel has a color and no two of outcoming tunnels of a room have the identical color. There is totally $k$ colors, which is numbered $0, 1, \\cdots k - 1$.\n\nBefore being thrown into the maze, TheBeet was able to dig only one hole to only one room as the exit. But he would never know which room ArXoR would thrown he into. When he was in the maze, he can not recognize which room he was standing in. All he can know is the colored outcoming tunnels of the room where he stood in.\n\nIn order to escape, TheBeet must make a sequence of colors. If there is an outcoming tunnel with the same color as the current color in the sequence, he would run through the tunnel, otherwise he would stand still and examine the next tunnel color in the sequence.\n\nBy following the whole sequence, if he can stand in the room where he had dig a hole to, he can escape, otherwise, he failed in escaping.\n\nYour task is to computer the minimal length of the sequence of colors which would guarantee TheBeet's escape.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input contains a single test case.\n\nThe first line contains three integers presenting $n m k. (1 \\leq n \\leq 30, 1 \\leq m \\leq n \\times k, 1 \\leq k \\leq 10)$\n\nThen m lines follow, each of them contain three integer $i$ $j$ $c$, which means there is a tunnel of color $c$ from room $i$ to room $j, (0 \\leq i < n, 0 \\leq j < n, i != j, 0 \\leq c < k)$\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput a single line containing an integer indicating the minimal length of the sequence of colors which would guarantee TheBeet's escape.\n\nIf such sequence doesn't exist, output `-1`.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>9 8 5\n0 1 0\n1 3 2\n5 4 4\n4 3 1\n7 6 4\n6 3 2\n8 2 3\n2 3 1</td><td>5</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nTheBeet can always escape through room $3$ by following the color sequence $43012$ no matter which room he was thrown into, and no other shorter sequence exsists.\n"}]}