{"title":"(More) Multiplication","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/more-multiplication/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nEducators are always coming up with new ways to teach math to students. In 2011, an educational software company, All Computer Math (ACM), developed an application to display products in a traditional grade school math format. ACM is now working on an updated version of the software that will display results in a lattice format that some students find to be easier when multiplying larger numbers.\n\nAn example would be when multiplying 345 * 56 = 19320 as given below, using a lattice grid with 2 rows and 3 columns, which appears inside a surrounding frame:\n\n![title](/source/lutece/more-multiplication/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTA3Ni8yMDE1MDQxODIzMDc0MjYzNjEyLmpwZw==.jpg)\n\nThe first operand, 345, is displayed above the top of the grid with each digit centered horizontally above its column of the grid, and the second operand, 56, is displayed along the righthand side with each digit centered vertically at the center of its row in the grid. A single cell of the grid, such as\n\n![title](/source/lutece/more-multiplication/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTA3Ni8yMDE1MDQxODIzMTYzMzc0NzE1LmpwZw==.jpg)\n\nrepresents the product of the digit of the first operand that is above its column and the digit of the second operand that is to the right of its row. In our example, this cell represents the product 5 times 6 = 30 that results when multiplying the 5 in 345 and the 6 in 56. Note that the 10's digit of that product is placed in the upper left portion of this cell and the 1's digit in the lower right. \n\nThe overall product is then computed by summing along the diagonals in the lattice that represent the same place values in the result. For example, in our first problem the product 19320 was computed as:\n\n1's digit\t= 0\n\n10's digit\t= 5 + 3 + 4 = 12, thus 2 with a carry of 1\n\n100's digit\t= (1 carry) + 2 + 0 + 2 + 8 = 13, thus 3 with a carry of 1\n\n1000's digit\t= (1 carry) + 2 + 5 + 1 = 9\n\n10000's digit\t= 1\n\nThe resulting product is placed with the one's digit below the grid at the far right and, depending on its length, with the most significant digits wrapped around the left side of the grid. Each digit of the final product appears perfectly aligned with the corresponding diagonal summands.\n\nTo provide an aesthetic view, we use a series of minus (-) characters for horizontal lines, pipe (|) characters for vertical lines, and slash (/) characters for diagonal lines. Furthermore, we use a plus (+) character wherever a horizontal and vertical line meet. Each multiplication lattice is subsequently \"boxed\" by an outer border. There is a row containing the first operand which is between the topmost border and the top line of the grid, and a row between the bottom of the grid and the bottom border, which contains some portion of the resulting product. There is one column between the leading | and the left edge of the inner grid, which may contain a portion of the resulting product, and one column after the right edge of the inner grid but before the rightmost | border, which contains the second operand. If the product is not long enough to wrap around the bottom-left corner, the column between the left border and the left edge of the grid will containing only spaces. (See the later example of 3 x 3.)\n\nLeading zeros should be displayed within lattice grid cells, but leading zeros should never be displayed in the product, nor should there ever be a slash (/) character prior to the leading digit of the product. For example, consider the product of 12 * 27 = 324 below:\n\n![title](/source/lutece/more-multiplication/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTA3Ni8yMDE1MDQxODIzMTU1OTA4MjE0LmpwZw==.jpg)\n\nNote that in the top-right grid of the lattice, the product 2 * 2 = 04 is displayed with the zero for the tens digit. However, there is no thousands digit displayed in the product 324, nor is there any slash displayed above the digit 3 in that product.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe input contains one or more tests. Each test contains two positive integers, A and B, such that 1 ≤ A ≤ 9999 and 1 ≤ B ≤ 9999. The last data set will be followed by a line containing 0 0.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each data set, produce the grid that illustrates how to multiply the two numbers using the lattice multiplication technique.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>345 56\n12 27\n1 68\n9999 7\n3 3\n0 0</td><td>+---------------+\n|   3   4   5   |\n| +---+---+---+ |\n| |1 /|2 /|2 /| |\n| | / | / | / |5|\n|1|/ 5|/ 0|/ 5| |\n| +---+---+---+ |\n|/|1 /|2 /|3 /| |\n| | / | / | / |6|\n|9|/ 8|/ 4|/ 0| |\n| +---+---+---+ |\n|/ 3 / 2 / 0    |\n+---------------+\n+-----------+\n|   1   2   |\n| +---+---+ |\n| |0 /|0 /| |\n| | / | / |2|\n| |/ 2|/ 4| |\n| +---+---+ |\n| |0 /|1 /| |\n| | / | / |7|\n|3|/ 7|/ 4| |\n| +---+---+ |\n|/ 2 / 4    |\n+-----------+\n+-------+\n|   1   |\n| +---+ |\n| |0 /| |\n| | / |6|\n| |/ 6| |\n| +---+ |\n| |0 /| |\n| | / |8|\n|6|/ 8| |\n| +---+ |\n|/ 8    |\n+-------+\n+-------------------+\n|   9   9   9   9   |\n| +---+---+---+---+ |\n| |6 /|6 /|6 /|6 /| |\n| | / | / | / | / |7|\n|6|/ 3|/ 3|/ 3|/ 3| |\n| +---+---+---+---+ |\n|/ 9 / 9 / 9 / 3    |\n+-------------------+\n+-------+\n|   3   |\n| +---+ |\n| |0 /| |\n| | / |3|\n| |/ 9| |\n| +---+ |\n|  9    |\n+-------+</td></tr></table>\n\n"},{"title":"Note","format":"markdown","require":["katex"],"content":"\nThe tables must be formatted precisely as outlined by the rules and examples provided. Mistakes that involve solely errant whitespace will be categorized as Presentation Error; all other errors will be reported as Wrong Answer.\n"}]}