{"title":"Neurotic Network","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/neurotic-network/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nIn this problem, a neural net is represented by a rooted tree with weighted edges. The neural net processes information by a cascade of signals that begins at the leaf nodes: Each node in the tree computes an output value based on its upstream neighbors, and passes this value on to its downstream neighbor. The output value computed by a node is the sum of the output of each of its upstream neighbors multiplied by the weight of the edge from the upstream neighbor to the node itself. A node with no upstream neighbors (leaf nodes) always has $1$ as output. All neural nets in this problem have exactly one final output node (the root node).\n\nSometimes, a neural net can go haywire and become what is more commonly known as a neurotic network. Consider this your chance to launch a second career in psychiatry. The scenario is that someone just came in with a neurotic network in their head. What this means is that if the output of their neural net is an even number, the person will freak out and will set fire to a kitten. Therefore, it is of vital importance that you can know ahead of time whether or not a given person is safe. If it is safe, print their neural output modulo $1,000,000,007$. If you wouldn't trust the person to be around kittens who're not wrapped in fire retardant, print the string `FREAK OUT` (without the quotes).\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of input is $T$, the number of test cases. For each of the $T$ cases, the \ffirst line will be the integer $N$, the number of nodes in the tree. The next line contains $N -1$ integers $a\\_1,a\\_2,\\cdots ,a\\_{N-1}$ where $a\\_i$ is the downstream neighbour of the node with ID $i$.Then follows a line with $N - 1$ integers $w\\_1,w\\+2,\\cdots ,w\\_{N-1}$ where $w\\_i$ is the weight of the neural connection going out from the node with ID $i$. Note that the node with ID $0$ will always be the output node.\n\n$0 < T \\le 50$\n\n$0 < N \\le 10000$\n\n$0 < w\\_i \\le 10$\n\n$0 \\le a\\_i < N$\n\nThe graph is guaranteed to be a tree.\n\nThis is an I/O-heavy problem. For Java programmers, this means that you should\nuse `BufferedReader` for input reading (not `Scanner`).\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nOutput `FREAK OUT` (without the quotes) if the \ffinal value of the neural net's output node is even. Otherwise, output the final value of the output node, modulo $1,000,000,007$.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>4\n1\n4\n0 0 2\n7 7 1\n4\n0 0 2\n6 7 2\n11\n0 1 2 3 4 5 6 7 8 9\n9 9 9 9 9 9 9 9 9 3</td><td>1\nFREAK OUT\nFREAK OUT\n162261460</td></tr></table>\n\n"}]}