{"title":"No Trees But Flowers","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/no-trees-but-flowers/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nTom and Sarah soon have their second anniversary and he wants to buy her something special. Even\nthough she's very keen on any kind of tree, he thinks that this probably is too big of a gift. So, he\ndecides to buy her flowers. But not the lame cut off ones that will die after two weeks tops. No,\nhe wants to buy her flowers that may last forever. Flowers in a flower pot. Now, he has a problem.\nFinding the right flowers for his girlfriend isn’t that difficult. However, finding the right flower pot\nturns out to be much more complicated. Since he wants the flowers to live as long as possible, he\nneeds to find the best-fitting flower pot he can find. When he comes to the Arboreal and Crops\nMarket, he notices that for each bouquet of flowers there is an optimal size written for the flower\npot. However, the offered flower pots do not state their volume. The only information the shop\nassistant can provide is the outline of each flower pot given as a function. Since Tom was never\nvery good in math and his date is in less than an hour, he asks a nearby customer for help: You.\nFortunately, you brought your laptop on your shopping tour. Can you help Tom?\n\nThe outline of a flower pot is described by a function $f(x) = a\\times e^{-x^2}+b\\times \\sqrt{x}$\n, \nwhere $x$ is the \nvertical distance from the bottom of the flower pot. The body of the flower pot thus is defined by\nthe rotational body created when rotating the graph of $f$ around the $x$-axis. The height of a flower\npot is denoted by $h$.\n\nThe volumes of two flower pots differ at least by $10^{−4}$ . Also there is only one flower pot closer to\nthe optimal than any other one, with an accuracy to $10^{−4}$.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input always contains one test case which consists of several lines.\nThe first line contains a decimal number $0< V\\leq 10^5$, the optimal size for Tom's favorite flower,\nand an integer $0< N\\leq 5$, the number of flower pots available.\nThe next $N$ lines each contain three decimal numbers describing the corresponding $k^{th}$ flower pot:\n$0\\leq a_k\\leq 10$, $0\\leq b_k\\leq 10$, and $1\\leq h_k\\leq 10$.\nFor the sample input the volumes are approximately $34.72348$ and $21.77966$.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nPrint one line containing a single integer that describes the index of the best fitting flower pot. The\nindex of the first flower pot is $0$.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>25.0 2\n1.0 2.0 2.0\n2.0 1.0 2.0</td><td>1</td></tr></table>\n\n"}]}