{"title":"Pick The Sticks","time_limit":10000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/pick-the-sticks/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nThe story happened long long ago. One day, Cao Cao made a special order called \"Chicken Rib\" to his army. No one got his point and all became very panic.\nHowever, Cao Cao himself felt very proud of his interesting idea and enjoyed it.\n\nXiu Yang, one of the cleverest counselors of Cao Cao, understood the command Rather than keep it to himself, he told the point to the whole army. Cao Cao got very angry at his\ncleverness and would like to punish Xiu Yang. But how can you punish someone because he's clever? By looking at the chicken rib, he finally got a new idea to punish Xiu Yang.\n\nHe told Xiu Yang that as his reward of encrypting the special order, he could take as many gold sticks as possible from his desk. But he could only use one stick as the container. \n\nFormally, we can treat the container stick as an $L$ length segment. And the gold sticks as segments too. There were many gold sticks with different length $a\\_i$ and value $v\\_i$.\nXiu Yang needed to put these gold segments onto the container segment. No gold segment was allowed to be overlapped. Luckily, Xiu Yang came up with a good idea. On the two sides\nof the container, he could make part of the gold sticks outside the container as long as the center of the gravity of each gold stick was still within the container. This could\nhelp him get more valuable gold sticks.\n\nAs a result, Xiu Yang took too many gold sticks which made Cao Cao much more angry. Cao Cao killed Xiu Yang before he made himself home. So no one knows how many gold sticks\nXiu Yang made it in the container.\n\nCan you help solve the mystery by finding out what's the maximum value of the gold sticks Xiu Yang could have taken?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input gives the number of test cases, $T$($1\\leq T\\leq 100$). $T$ test cases follow.\nEach test case start with two integers, $N$($1\\leq N\\leq 1000$) and $L$($1\\leq L\\leq 2000$), represents the number of gold sticks and the length of the container stick. $N$ lines follow.\nEach line consist of two integers, $a\\_i$($1\\leq a\\_i\\leq 2000$) and $v\\_i$($1\\leq v\\_i\\leq 10^9$), represents the length and the value of the $i\\_{th}$ gold stick.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, output one line containing `Case #x: y`, where $x$ is the test case number (starting from $1$) and $y$ is the maximum value of the gold sticks Xiu Yang\ncould have taken.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>4\n\n3 7\n4 1\n2 1\n8 1\n\n3 7\n4 2\n2 1\n8 4\n\n3 5\n4 1\n2 2\n8 9\n\n1 1\n10 3</td><td>Case #1: 2\nCase #2: 6\nCase #3: 11\nCase #4: 3</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nIn the third case, assume the container is lay on $x$-axis from $0$ to $5$. Xiu Yang could put the second gold stick center at $0$ and put the third gold stick center at $5$,\nso none of them will drop and he can get total $2 + 9 = 11$ value. In the fourth case, Xiu Yang could just put the only gold stick center on any position of $[0,1]$,\nand he can get the value of $3$.\n"}]}