{"title":"Precious","time_limit":5000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/precious/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nGollum is finding his Precious. The precious is hiding in a magic maze. The maze can be considered as a simple polygon. Some vertexes of the polygon are doors that can only allow Gollum to get in, and the other doors can only allow Gollum to get out. \n\nGollum doesn't know that restrict, he choose a door to get in, and choose a door to get out after he has got his precious. Gollum hasn't learned math, so we believe that Gollum choose the door randomly, that means if there are $n$ doors, the probability of a door chose by Gollum is $\\frac{1}{n}$. \n\nThere is a monster in the maze, and if Gollum stay in the maze more than m minutes, the monster will wake up and eat Gollum. Gollum can move one unit distance by one minute. \n\nWe want to know the probability that Gollum got his precious.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input consists of multiply test cases. The first line of each test case contains two integers, $n$ ($3\\leq n\\leq 100$), $m$ ($0\\leq m\\leq 10000$), where $n$ is the number of vertexes of the maze, and $m$ is the time limit. \n\nThe next $n$ lines represent the maze, each line contains a coordinate, $x$, $y$ ($-10000\\leq x, y\\leq 10000$) and a DoorType. \n\nIf DoorType equals to $-1$, then you can get in from this vertex; \n\nif DoorType equals to $0$, then it's not a door; \n\nif DoorType equals to $1$, then you can get out from this vertex. The last line of each test case is a coordinate, indicating the location of the precious. You can assume that the precious is always in the maze. \n\nThe last test case is followed by a line containing two zeros, which means the end of the input.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput the probability. Please take it with $9$ factional digits\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>12 4 \n-2 -1 -1 \n-1 -1 -1 \n-1 -2 -1 \n1 -2 -1 \n1 -1 -1 \n2 -1 -1 \n2 1 1 \n1 1 1 \n1 2 1 \n-1 2 1 \n-1 1 1 \n-2 1 1 \n0 0 \n0 0</td><td>0.138888889</td></tr></table>\n\n"}]}