{"title":"Qmm and Tmm","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/qmm-and-tmm/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nIt has been said that hard-working girl is the most beautiful. In order to become the most beautiful girl in UESTC, Qmm is trying solving all the problems on all online judges including POJ and CDOJ recently. What a tremendous task! As everyone knows, there are thousands of problems online and several ones are beyond her ability. However, stubborn Qmm thinks she can achieve her goal in only one year. From the start of every day (Yes, the start! i.e. $0$ o’clock), she wakes up to find problems and write codes without a break. As the best friend of Qmm, Tmm always kindly persuade Qmm to relax for the rest of the day whenever Qmm is too tired to go on.\nLet's use a value $P$ to represent Qmm's strength. Solving problems will cost some time and strength of QMM. It takes QMM $D$ hours to solve the $D_{th}$ problem. And apart from that, the strength of Qmm will be decreased by $D$. The $D$ is counted from the latest sleep while assuming Qmm has a good sleep before the beginning. The initial strength of Qmm may be very large.\n\nEvery time the strength of Qmm is smaller than the cost of the next problem, Tmm will come and drag Qmm to sleep for the rest hours of the day.`Note that the time for sleep may be zero.` After Qmm having an hour of sleep, her strength will increase by one. \n\n![.*](/source/lutece/qmm-and-tmm/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTAyLzIwMTQwMTI5MDAzNDMzNDk0NC5wbmc=.png)\n\nGiven the strength $P_0$ of Qmm at the beginning, you are required to calculate the number of problems she solved after $N$ days.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input is $T$ (no more than $10000$), which stands for the number of test cases you need to solve. Each line of the following $T$ lines will give $2$ numbers, the initial strength $P_0$ and $N$. ($0 < P_0, N\\leq 100000000$)\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nPlease output the number of problems Qmm solved for each test case.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>4\n10 1\n10 2\n10 3\n30 4</td><td>4\n8\n13\n15</td></tr></table>\n\n"}]}