{"title":"Rain in ACStar","time_limit":3000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/rain-in-acstar/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nMaybe you have heard of Super Cow AC who is the great general of ACM Empire. However, do you know where he is from?\n\nThis is one of the ten biggest secrets of this world! And it is time to expose the truth! \n\nYes, Super Cow AC is from ACStar which is ten million light-year away from our earth. No one, even AC himself, knows how AC came to our home. The only memory in his head is the strange rain in ACStar.\n\nBecause of the special gravity of ACStar, the raindrops in ACStar have many funny features. They have arbitrary sizes, color and tastes. The most interesting parts of the raindrops are their shapes. When AC was very young, he found that all the drops he saw in air were convex hull. Once the raindrops fell to the ground, they would be absorb by the soil.\n\n![.*](/source/lutece/rain-in-acstar/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTk4LzIwMTQwMjAzMTcxNjQ0NDczMzgucG5n.png)\n\nThis year is set to be AC-year. In recognition of Great General AC's contribution to our empire, the Emperor decided to build a huge AC park. Inside this park there is a laboratory to simulate the rain in ACStar. As a researcher of this lab, you are appointed to measure the volume of rain absorbed by soil. To simplify this problem, scientists put the rain into two-dimensional plane in which the ground is represented as a straight line and the raindrops are convex polygon. So the area of the graphics stands for the volume of raindrops. \n\nYou will receive two types of instructions:\n1. `R P` (This type of instructions tell you sufficient information about the raindrops.)\n2. `Q A B` (Ask you to report the volume of rain absorbed by soil of $[A,B]$.)\n\nInstructions are given in chronological order.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the inputs is $T$(no more than $10$), which stands for the number of test cases you need to solve. \n\nAfter $T$, the inputs will be each test case. The first line of each case will be $N$(no more than $25000$), representing for the numbers of instructions. The following $N$ lines will give instructions of the two types.\n\nFor each instruction of type $1$, it will be followed by a line listing $P$ (at least $3$ and at most $5$) points representing the convex polygon of the coming raindrop. The points are started by the leftmost point and are given in counterclockwise order. It's guaranteed that no points of the same raindrop are in the same vertical line. \n\nAll numbers are positive integer no more than $1000000000$.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each instruction of type $2$, output the corresponding result, which should be printed accurately rounded to three decimals.\n\nIt is guaranteed that the result is less than $10^{8}$.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>1\n7\nQ 1 100\nR 4\n10 10 11 10 13 11 12 11\nQ 10 11\nQ 1 100\nR 3\n100 20 120 20 110 30\nQ 1 100\nQ 12 120</td><td>0.000\n0.250\n1.000\n1.000\n100.250</td></tr></table>\n\n"}]}