{"title":"The Maze Makers","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/the-maze-makers/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nThe Maze Makers is a publisher of puzzle books.  One of their most popular series is maze books.  They have a program that generates rectangular two-dimensional mazes like the one shown in Figure 1.  The rules for these mazes are: (1) A maze has exactly two exterior cell walls missing, opening to two distinct terminal cells, (2) starting from any one cell, all other cells are reachable, (3) between any two cells in the maze there is exactly one simple path. Formally, a path is a sequence of cells where each cell and its successor on the path share an edge without a wall. A simple path is a path that never repeats a cell. \n\nThe Maze Maker program uses hexadecimal digits to encode the walls and passages of a maze.  For each cell in the maze there is a corresponding hex digit.  As shown in Figure 2, the 1's and 0's in the 4 digit binary representation of a hex digit correspond to the walls (1's) and passages (0's) for each cell in the maze.  For example, the binary encoding for the hex digit B is 1011.  Starting at the top of the cell and moving clockwise around it, this digit represents a cell with a wall at the top, a passage to the right and walls at the bottom and to the left.  A path between two maze cells successively moves one cell up, down, left or right, going through passages only.\n\n![title](/source/lutece/the-maze-makers/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTA4MS8yMDE1MDQxODIzNTc1MjA4MzI4LmpwZw==.jpg)\n\nFigure 3 shows the sample maze with the hexadecimal labels in each cell.  For example, the hexadecimal digit E in the top-right cell indicates that it has a wall above it, to its right, below it, yet a passageway to its left. The hexadecimal digit 8 to its left indicates that its cell has only a wall above it. The inputs will always be self-consistent, in that the hexadecimal digits in neighboring cells will agree on whether they share a wall or passageway, and each input will always have precisely two terminal cells, each with one missing exterior wall.\n\nOur sample maze is a legitimate maze in that all cells are reachable and there is a unique simple path between any pairs of cells in the maze. Your goal is to write a program that reads the hexadecimal descriptions of a potential maze and tests to determine if it is legitimate. If there is a problem, your program must report only the first problem, as detailed below in the section titled \"Output\".\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input consists of the descriptions of one or more candidate mazes.  Each maze description will start with two integers, H and W, indicating the height and width of the maze, respectively, such that 1 ≤ H ≤ 50 and 2 ≤ W ≤ 50. Following this first line will be H rows of hexadecimal digits, with each row consisting of W digits.  The input is terminated with a line displaying a pair of zeros.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each candidate maze, the program should output the first one of the following statements that applies: \n\nNO SOLUTION  \nUNREACHABLE CELL  \nMULTIPLE PATHS  \nMAZE OK  \n\nThe classification statements are defined formally as follows:\n\n`NO SOLUTION` - There is no path through the interior of the maze between the two exterior openings.   \n`UNREACHABLE CELL` - There is at least one cell in the maze that is not reachable by following passageways from either of the openings in the exterior walls of the maze.   \n`MULTIPLE PATHS` - There exists a pair of cells in the maze that have more than one simple path between them. Two simple paths are considered to be distinct if any part of the paths differ.   \n`MAZE OK` - None of the above problems exist.\n\nNote well that for the second case given in the following examples, there is no path between the start and finish and there is an unreachable cell; the correct output should simply be `NO SOLUTION`, because that error message is listed first in the above list. Similarly, in the fourth example given, `UNREACHABLE CELL` is reported because that error has priority over the multiple paths.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>6 7\n9A8C98E\n2E5753C\n980A496\n553C53C\n53C75D5\n3E3E363\n3 3\nF9A\nD3E\n3AC\n1 8\n3AAA8AAE\n6 3\n9AC\n3C5\nA24\n9A6\n5BC\n3C7\n5 4\n8A8E\n592C\n5186\n161C\n3A63\n5 4\n8AAE\n59AC\n5386\n1E1C\n3A63\n0 0</td><td>MAZE OK\nNO SOLUTION\nMAZE OK\nUNREACHABLE CELL\nMULTIPLE PATHS\nMULTIPLE PATHS</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\n![title](/source/lutece/the-maze-makers/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTA4MS8yMDE1MDQxOTAwMDExOTE4MTMxLmpwZw==.jpg)\n"}]}