{"title":"The Suspects","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/the-suspects/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nSevere acute respiratory syndrome (SARS), an atypical pneumonia of unknown aetiology, was recognized as a global threat in mid-March 2003. To minimize transmission to others, the best strategy is to separate the suspects from others. \n\nIn the Not-Spreading-Your-Sickness University (NSYSU), there are many student groups. Students in the same group intercommunicate with each other frequently, and a student may join several groups. To prevent the possible transmissions of SARS, the NSYSU collects the member lists of all student groups, and makes the following rule in their standard operation procedure (SOP). \n\nOnce a member in a group is a suspect, all members in the group are suspects. \n\nHowever, they find that it is not easy to identify all the suspects when a student is recognized as a suspect. Your job is to write a program which finds all the suspects.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe input file contains several cases. Each test case begins with two integers $n$ and $m$ in a line, where $n$ is the number of students, and $m$ is the number of groups. You may assume that $0 < n\\leq 30000$ and $0\\leq m\\leq 500$. Every student is numbered by a unique integer between $0$ and $n−1$, and initially student $0$ is recognized as a suspect in all the cases. This line is followed by m member lists of the groups, one line per group. Each line begins with an integer $k$ by itself representing the number of members in the group. Following the number of members, there are $k$ integers representing the students in this group. All the integers in a line are separated by at least one space. \n\nA case with $n = 0$ and $m = 0$ indicates the end of the input, and need not be processed.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nFor each case, output the number of suspects in one line.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>100 4\n2 1 2\n5 10 13 11 12 14\n2 0 1\n2 99 2\n200 2\n1 5\n5 1 2 3 4 5\n1 0\n0 0</td><td>4\n1\n1</td></tr></table>\n\n"}]}