{"title":"The Castle","time_limit":1000,"memory_limit":16,"url":"https://acm.uestc.edu.cn/problem/the-castle/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nIn a stroke of luck almost beyond imagination, Farmer John was sent a ticket to the Irish Sweepstakes (really a lottery) for his birthday. This ticket turned out to have only the winning number for the lottery! Farmer John won a fabulous castle in the Irish countryside.\n\nBragging rights being what they are in Wisconsin, Farmer John wished to tell his cows all about the castle. He wanted to know how many rooms it has and how big the largest room was. In fact, he wants to take out a single wall to make an even bigger room.\n\nYour task is to help Farmer John know the exact room count and sizes.\n\nThe castle floorplan is divided into $M$ (wide) by $N$ ($1\\leq M,N\\leq 50$) square modules. Each such module can have between zero and four walls. Castles always have walls on their `outer edges` to keep out the wind and rain.\n\nConsider this annotated floorplan of a castle:\n\n```\n     1   2   3   4   5   6   7\n   #############################\n 1 #   |   #   |   #   |   |   #\n   #####---#####---#---#####---#   \n 2 #   #   |   #   #   #   #   #\n   #---#####---#####---#####---#\n 3 #   |   |   #   #   #   #   #   \n   #---#########---#####---#---#\n 4 # ->#   |   |   |   |   #   #   \n   #############################\n"},{"title":"= Wall -,| = No wall","format":"markdown","require":["katex"],"content":"-> = Points to the wall to remove to make the largest possible new room\n```\n\nBy way of example, this castle sits on a $7\\times 4$ base. A `room` includes any set of connected `squares` in the floor plan. This floorplan contains five rooms (whose sizes are $9$, $7$, $3$, $1$, and $8$ in no particular order).\n\nRemoving the wall marked by the arrow merges a pair of rooms to make the largest possible room that can be made by removing a single wall.\n\nThe castle always has at least two rooms and always has a wall that can be removed.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe map is stored in the form of numbers, one number for each module, $M$ numbers on each of $N$ lines to describe the floorplan. The input order corresponds to the numbering in the example diagram above.\n\nEach module number tells how many of the four walls exist and is the sum of up to four integers:\n\n* $1$: wall to the west\n* $2$: wall to the north\n* $4$: wall to the east\n* $8$: wall to the south\n\nInner walls are defined twice; a wall to the south in module $(1,1)$ is also indicated as a wall to the north in module $(2,1)$.\n\nLine $1$: Two space-separated integers: $M$ and $N$\n\nLine $2\\cdots $: $M\\times N$ integers, several per line.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nThe output contains several lines:\n\nLine $1$: The number of rooms the castle has.\n\nLine $2$: The size of the largest room\n\nLine $3$: The size of the largest room creatable by removing one wall\n\nLine $4$: The single wall to remove to make the largest room possible\n\nChoose the optimal wall to remove from the set of optimal walls by choosing the wall farthest to the west (and then, if still tied, farthest to the south). Name that wall by naming the module that borders it on either the west or south, along with a direction of `N` or `E` giving the location of the wall with respect to the module.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>7 4\n11 6 11 6 3 10 6\n7 9 6 13 5 15 5\n1 10 12 7 13 7 5\n13 11 10 8 10 12 13</td><td>5\n9\n16\n4 1 E</td></tr></table>\n\n"}]}