{"title":"The King of the North","time_limit":3000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/the-king-of-the-north/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nWinter is coming (or going? who can be sure these days) and a new king rises in the North. The\nmessage travels quickly these days... That is why you, the rising king, have not much time left. You\nneed to rally your bannermen behind you. But one question seems harder to answer than you would\nhave first expected. How large of a kingdom can you claim and how many men should you send for?\nYour advisors have taken a close look at the potential kingdom and have determined how many of\nyour bannermen would be required to fully defend any part of the map against your foes. As you\nare a loving and caring king, you want to minimize the number of men that have to serve in your\narmy. To give your war council a fair chance of figuring out the best kingdom to defend, you have\nto determine the size of the army that you will raise as soon as possible.\n\nLuckily, armies are not that advanced yet. You will only have to defend against armies moving\nhorizontally or vertically (an army cannot pass but your bannermen diagonally). Your kingdom\ncounts as defended, if there is not a single way to reach your castle, starting anywhere outside of\nthe map, without passing to a fully defended area. Squares on the map labeled $0$ represent high\nmountains, or walls, no one would ever be foolish enough to climb. You can assume to be save from\ninvasion without sending any bannermen to defend them. Since you are uncertain about what lurks\nbehind the wall (or in our case the borders of the map), you have to assume the worst and plans as\nif you would never be able to hold any position outside of the given map.\n\n![201308010108028531.png](/source/lutece/the-king-of-the-north/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTkvMjAxMzEyMjkwMDUxMTAxNjQzLnBuZw==.png)\n\n*Illustration of the sample input — the kingdom can be defended with a minimal army of $37$\nbannerman, located at the cross-marked positions. The kingdom itself is illustrated using a tiling\npattern. Note that you do not have to find out about the kingdom, or the position of you bannermen.\nThese questions are to be figured out by your war council.*\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input is given in the form of the (rectangular) strategic map which your advisors came up with.\nEvery square in map is assigned a number of bannermen which would be required to defend the\nposition against any potential army. The map is formatted as follows: In a first line you are given\nto integers $R$ and $C$, $3\\leq R,C\\leq 300$, specifying the dimensions of the map. This line is followed by\n$R$ lines, each containing $C$ integers $0\\leq c_i\\leq 100000$, the number of bannermen necessary to defend\neach square. Finally, you are given $0 < r < R−1$ and $0 < c < C−1$, the position of your own castle\non the map.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nOutput an integer on a single line, the smallest possible army you would require to defend any\nkingdom.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>7 8\n42 42 0 0 0 0 0 16\n42 11 14 42 42 42 10 16\n42 0 42 42 42 42 0 16\n42 0 42 42 42 42 0 42\n42 0 42 42 42 42 0 42\n42 11 42 42 42 5 5 42\n42 42 0 0 0 42 42 42\n3 4</td><td>37</td></tr></table>\n\n"}]}