{"title":"The Tamworth Two","time_limit":1000,"memory_limit":16,"url":"https://acm.uestc.edu.cn/problem/the-tamworth-two/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nA pair of cows is loose somewhere in the forest. Farmer John is lending his expertise to their capture. Your task is to model their behavior.\n\nThe chase takes place on a $10$ by $10$ planar grid. Squares can be empty or they can contain:\n\n* an obstacle,\n* the cows (who always travel together), or\n* Farmer John. \n\nThe cows and Farmer John can occupy the same square (when they `meet`) but neither the cows nor Farmer John can share a square with an obstacle.\n\nEach square is\nrepresented\nas follows:\n\n* `.` Empty square\n* `*` Obstacle\n* `C` Cows\n* `F` Farmer \n\nHere is a sample grid:\n\n```\n*...*.....\n......*...\n...*...*..\n..........\n...*.F....\n*.....*...\n...*......\n..C......*\n...*.*....\n.*.*......\n```\n\nThe cows wander around the grid in a fixed way. Each minute, they either move forward or rotate. Normally, they move one square in the direction they are facing. If there is an obstacle in the way or they would leave the board by walking `forward', then they spend the entire minute rotating $90$ degrees clockwise.\n\nFarmer John, wise in the ways of cows, moves in exactly the same way.\n\nThe farmer and the cows can be considered to move simultaneously during each minute. If the farmer and the cows pass each other while moving, they are not considered to have met. The chase ends when Farmer John and the cows occupy the same square at the end of a minute.\n\nRead a ten-line grid that represents the initial state of the cows, Farmer John, and obstacles. Each of the ten lines contains exactly ten characters using the coding above. There is guaranteed to be only one farmer and one pair of cows. The cows and Farmer John will not initially be on the same square.\n\nCalculate the number of minutes until the cows and Farmer John meet. Assume both the cows and farmer begin the simulation facing in the `north` direction. Print $0$ if they will never meet.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nLines $1-10$: Ten lines of ten characters each, as explained above\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nA single line with the integer number of minutes until Farmer John and the cows meet. Print $0$ if they will never meet.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>*...*.....\n......*...\n...*...*..\n..........\n...*.F....\n*.....*...\n...*......\n..C......*\n...*.*....\n.*.*......</td><td>49</td></tr></table>\n\n"}]}