{"title":"This Is The Job The Bear Finds","time_limit":5000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/this-is-the-job-the-bear-finds/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\n*This is the job the bear finds*\n\n*This is the job the bear finds*\n\n*This is the job the bear finds*\n\n*Not with a code but a brick.*\n\n<p class=\"text-right\">\n-- Kenneth Snow, *The Hollow Bear*\n</p>\n\nBearchild is working in a construction team. Life is hard, and his job is just carrying bricks from here to there, what a waste of time! So, our lovely Bearchild has invented a strange machine to help him.\n\nThe machine consists three parts:  A rope, a little, round pulley (regarded as points) and a big pulley which is a convex hull (Bearchild is short of money and can't make his big pulley round!). One end of the rope is fixed with bricks, the rope goes around the small pulley, and finally connects the big pulley on its contour. It's guaranteed that the small pulley is located to the left of the big one.\n\nYou can see that when the big pulley spins clockwise around its center of gravity, the bricks will be pulled up, and finally reach the small pulley as the destination. Note that the rope will circle around the contour of the big pulley as it spins.\n\nSee the picture for more information, there will be no collision when spinning.\n\n![title](/source/lutece/this-is-the-job-the-bear-finds/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vODI0LzIwMTQwNDE3MTU0ODA2MzgyMi5qcGc=.jpg)\n\nIn this problem, first of all we let the pulley spin for one or more circles so the rope becomes tight. After that, the positions of the two pulleys are given. Then you have to deal a lot of queries, for each query, the distance from the bricks and the small pulley (also as the destination) is given. Your task is to calculate the degree the pulley has yet to spin to pull the bricks to the destination.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line has a number $T$ ($T\\leq 1000$) , indicating the number of test cases.\n\nFor each test case, first line is a number $n$, which is the number of points of the big pulley (As a convex hull). Then $n$ lines follow, each with two numbers as the $x$ and $y$ coordinate of each point. Those points are given in counter-clockwise order. Then a line with two numbers, which are the $x$ and $y$ coordinate of the small pulley. Those coordinates are in the range $[-1000000,1000000]$.\n\nThen a number $m$ indicating the number of queries.\n\nFor next $q$ lines, each contains a number $l$ ($0<l<10^9$), which is the distance between the bricks and the small pulley.\n\nFor $90\\%$ of the data, we have $n,m\\leq 100$;\nAll the data have $n\\leq 10^4$, $m\\leq 10^5$, and all the numbers in the input are integers.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor every case, you should output `Case #t: ` at first, without quotes. The $t$ is the case number starting from $1$.\n\nThen $q$ lines each answers a query in the Input, which should be printed accurately rounded to three decimals.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n4\n0 0\n1 0\n1 1\n0 1\n-1 2\n2\n1\n4\n3\n0 0\n1 1\n-1 1\n-2 1\n3\n1\n2\n3</td><td>Case #1:\n90.000\n360.000\nCase #2:\n64.413\n140.446\n233.660</td></tr></table>\n\n"}]}