{"title":"Tim","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/tim/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nAs a leader,LiuBang has many excellent generals as his subordinates,Such as Hanxin,YingBu,PengYue,JiBu,FanKuai and so on.\n\nAfter LiuBang unified China,he divided his territory into n different regions and decided to send these generals out to govern them. It is common sence that one general can at most govern one region and one region can be governed by at most \none general. There exist some bidirectional roads between some regions, and for any two distinct regions, at most one road exists between them. there is no self-loop,that is to say, the structure of the regions and the roads connecting them forms a simple graph. Besides, for any two adjacent regions (a road connects them)A and B, there are at most two different simple routes from A to B(Hint:simple route contains no duplicate regions or roads)\n\nIt is rumored that if there are two adjacent regions are both being governed by these generals, the two generals who govern them will plot to rebel, LiuBang could not tolerate such situation completely. But it is also believed the more generals he send out to govern these regions, the more stable his country will be.\n\nNow LiuBang wants to know, how many generals he can send out at most while guaranteeing no rebellion would happen.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line of the input contains an integer $T$ indicating the number of cases.\n\nEach case contains two positive integers $n$, $m$ ($1\\leq n\\leq 10000$, $1\\leq m\\leq 20000$), in the first line, indicating the number of regions and the number of roads. then $m$ lines follow, each line contains $2$ positive integers $A$, $B$($1\\leq A, B\\leq n$, $A\\neq B$) indicating a road connecting region $A$ and region $B$.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nA single integer for each case indicating the maximum number of generals LiuBang could send out.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>1\n4 2\n1 2\n3 4</td><td>2</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nLiuBang Can send two generals to $1$ and $3$, but if LiuBang send the two generals\nto $1$ and $2$, they will plot to rebel as region $1$ and $2$ are adjacent.\n"}]}