{"title":"Tree Maker","time_limit":3000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/tree-maker/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nTree Lover loves trees crazily.\n\nOne day he invents an interesting game which is named Tree Maker.\n\nIn this game, all trees are **binary trees**.\n\nInitially, there is a tree with **only one** vertex and a cursor on it. Tree Lover can control the cursor to apply 5 operations to build a tree, and their formats are following:\n\n0  : Jump to the parent of the current vertex.\n\n1  : Jump to the left child of the current vertex.\n\n2  : Jump to the right child of the current vertex.\n\n3 x : Generate a tree with x vertices arbitrarily and make it the left subtree of the current vertex.\n\n4 x : Generate a tree with x vertices arbitrarily and make it the right subtree of the current vertex.\n\nWhen applying an operation, the log system will log down a record of it.\n\nTree Lover played this game for a whole day yesterday. As a forgetful man, although Tree Lover knew the shape of the tree  while playing, after a sleep he forgot it.\n\nAll he has now is the logs of operations.\n\nTree Lover wants to know: how many possible shapes of the tree can have yesterday according to the logs?\n\nCan you answer this question?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe input consists of multiple test cases.\n\nFor each test case:\n\nThe first line is an integer n (1 <= n <= 500), denoting the lines of logs.\n\nThen follow n lines of logs. The formats of logs are as described above.\n\nThe integer x of operation 3 and 4 is positive.\n\nIn each case, the number of vertices of the tree will never exceed 500.\n\nYou can assume that **the cursor will never jump to a non-existent vertex**.\n\nIf the left child of a vertex exists, operation 3 will not be applied on this vertex, and operation 4 is similar.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, ouput a single line “Case #x: y”, where x is the case number, starting from 1, and y is the answer to Tree Lover’s question.\n\nBecause the answer can be large, please output the answer mod 1000000007.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n3 3\n4 3\n2\n3 3\n1\n</td><td>Case #1: 25\nCase #2: 5</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nBecause the tree is a binary tree, if left and right subtrees of a vertex are of different shapes, after swapping them, the new tree is considered different from the original one.\n"}]}