{"title":"UmBasketella","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/umbasketella/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nIn recent days, people always design new things with multifunction. For instance, you can not only use cell phone to call your friends, but you can also use your cell phone take photographs or listen to MP3. Another example is the combination between watch and television. These kinds of multifunction items can always improve people's daily life and are extremely favored by users. \n\nThe company Mr. Umbrella invented a new kind umbrella `UmBasketella` for people in Rainbow city recently and its idea also comes from such multifunction--the combination of umbrella and daily necessities. This kind of umbrella can be used as a basket and you can put something you want to carry in it. Since Rainbow city rains very often, such innovative usage is successful and `UmBasketella` sells very well. Unfortunately, the original `UmBasketella` do not have an automatic volume control technology so that it is easily damaged when users try to put too many things in it. To solve this problem, you are needed to design an `UmBasketella` with maximum volume. Suppose that `UmBasketella` is a cone-shape container and its surface area (include the bottom) is known, could you find the maximum value of the cone?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nInput contains several test cases. Eash case contains only one real number S, representing the surface area of the cone. It is guaranteed that $ 1\\leq S \\leq 10000$.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, output should contain three lines.\n\nThe first line should have a real number representing the maximum volume of the cone. \n\nOutput the height of the cone on the second line and the radius of the bottom area of the cone on the third line.\n\nAll real numbers should rounded to $0.01$.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>30</td><td>10.93\n4.37\n1.55</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nThe data used in this problem is unofficial data prepared by 695375900. So any mistake here does not imply mistake in the offcial judge data.\n"}]}