{"title":"Virus Replication","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/virus-replication/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nSome viruses replicate by replacing a piece of DNA in a living cell with a piece of DNA that the virus carries with it. This makes the cell start to produce viruses identical to the original one that infected the cell. A group of biologists is interested in knowing how much DNA a certain virus inserts into the host genome. To find this out they have sequenced the full genome of a healthy cell as well as that of an identical cell infected by a virus.\n\nThe genome turned out to be pretty big, so now they need your help in the data processing step. Given the DNA sequence before and after the virus infection, determine the length of the smallest single, consecutive piece of DNA that can have been inserted into the first sequence to turn it into the second one. A single, consecutive piece of DNA might also have been removed from the same position in the sequence as DNA was inserted. Small changes in the DNA can have large effects, so the virus might insert only a few letters, or even nothing at all.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nThe input consists of two lines containing the DNA sequence before and after virus infection respectively. A DNA sequence is given as a string containing between $1$ and $10^5$ upper-case letters from the alphabet $(A, G, C, T)$.\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nOutput one integer, the minimum length of DNA inserted by the virus.\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>AAAAA\nAGCGAA</td><td>3</td></tr><tr><td>GTTTGACACACATT\nGTTTGACCACAT</td><td>4</td></tr></table>\n\n"}]}