{"title":"Wally World","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/wally-world/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nTwo star-crossed lovers want to meet. The two lovers are standing at distinct points in the plane (but then again, aren't we all?). They can travel freely except that there is a single wall which cannot be crossed. The wall is a line segment which is parallel to either the $x$ or $y$ axis.\n\nEach lover can move $1$ unit in $1$ second. How long will it take them to be together if they both choose the best path?\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nInput for each test case will consist of two lines each containing four integers. The first two integers will specify the $x$ and $y$ coordinates of the first lover; the next two integers will specify the $x$ and $y$ coordinates of the second lover. The next four integers will specify the start and end points of the wall. Furthermore, in all cases both lovers will not be on the (infinite) line containing the wall | that is, the wall extended in both directions. All coordinates will be positive and less than or equal to $10000$ and neither lover will start on the wall. The input will be terminated by a line containing four zeroes.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case, output the minimum time in seconds for the two lovers to meet. Print the answer to exactly $3$ decimal places, using the output format shown in the example.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>5 2 7 2\n1 1 1 100\n1 2 3 2\n2 1 2 100\n0 0 0 0</td><td>Case 1: 1.000\nCase 2: 1.414</td></tr></table>\n\n"}]}