{"title":"Weights and Measures","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/weights-and-measures/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nI know, up on top you are seeing great sights, \n\nBut down at the bottom, we, too, should have rights. \n\nWe turtles can't stand it. Our shells will all crack! \n\nBesides, we need food. We are starving!\" groaned Mack. \n\nMack, in an effort to avoid being cracked, has enlisted your advice as to the order in which turtles should be dispatched to form Yertle's throne. Each of the five thousand, six hundred and seven turtles ordered by Yertle has a different weight and strength. Your task is to build the largest stack of turtles possible. \n\nThe weight of the turtle is in grams. The strength, also in grams, is the turtle's overall carrying capacity, including its own weight. That is, a turtle weighing $300$g with a strength of $1000$g could carry $700$g of turtles on its back.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThere is only one test case in the input.\n\nStandard input consists of several lines, each containing a pair of integers separated by one or more space characters, specifying the weight and strength of a turtle ($w\\leq s$).There are at most $5,607$ turtles.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nYour output is a single integer indicating the maximum number of turtles that can be stacked without exceeding the strength of any one.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>300 1000\n1000 1200\n200 600\n100 101</td><td>3</td></tr></table>\n\n"}]}