{"title":"Windows 10","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/windows-10/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nLong long ago, there was an old monk living on the top of a mountain. Recently, our old monk found the operating system of his computer was updating to windows 10 automatically and he even can't just stop it !!\n\nWith a peaceful heart, the old monk gradually accepted this reality because his favorite comic LoveLive doesn't depend on the OS. Today, like the past day, he opens bilibili and wants to watch it again. But he observes that the voice of his computer can be represented as dB and always be integer. \n\nBecause he is old, he always needs 1 second to press a button. He found that if he wants to take up the voice, he only can add 1 dB in each second by pressing the up button. But when he wants to take down the voice, he can press the down button, and if the last second he presses the down button and the voice decrease x dB, then in this second, it will decrease 2 * x dB. But if the last second he chooses to have a rest or press the up button, in this second he can only decrease the voice by 1 dB.\n\nNow, he wonders the minimal seconds he should take to adjust the voice from p dB to q dB. Please be careful, because of some strange reasons, the voice of his computer can larger than any dB but can't be less than 0 dB.\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nFirst line contains a number $T$ ($1\\le T\\le 300000$),cases number.\n\nNext T line,each line contains two numbers $p$ and $q$ $(0\\le p,q\\le 10^9)$\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nThe minimal seconds he should take\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n1 5\n7 3</td><td>4\n4</td></tr></table>\n\n"}]}