{"title":"With Friends Like These","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/with-friends-like-these/description","statement":[{"title":"Content","format":"markdown","require":["katex"],"content":"\nIf you have ever player the video game Starcraft 2 the heart of the swarm, you may finished the mission With Friends Like These. \n\n\n\nThe queen of the blades Sarah Kerrigan find the human’s space ship Hyperion and its’ captain Matt Horner. They decide to make a deal with a mercenary Mira Han to let her\n\n release a computer master to save Jim Raynor who is the leader of revolution army and the lover of Kerrigan.\n\n\n\nBut things go badly due to the avarice of the mercenary Mira Han. Mira Han claim that she has no right to release the computer master without the agreement of Jim. Finally \n\nMatt Horner think things are not negotiable, so he has to fight with Mira by using his Battlecruiser Hyperion.\n![title](/source/lutece/with-friends-like-these/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTM5Ni8yMDE2MDUyNTEzMzQyNjIzNTU3LmpwZw==.jpg)\n\nYou can regard the space as a Cartesian coordinate system, the Hyperion is now at the point of $(0,0,0)$. The Battlecruiser Hyperion can jump to a neighboring integer point \n\nevery step, for example, if the ship is now at the point of $(1,0,-1)$, it can jump to $(1,-1,-1)$ or $(1,0,-2)$ etc in the next step. Because the space is full of minor planet, \n\nMatt can only drive the Hyperion randomly and it has the same probability to jump to any direction. \n\n\nWorrying her lover Jim, Kerrigan wants to know the expect number of points the Hyperion visited after $N$ steps.\n\nBecause the queen’s mind is invaded by worry and anxiety, this task is given to you, you need to make a program to calculate the expect number of visited points. \\\n\n$1\\le N \\le 500$\n"},{"title":"Standard Input","format":"markdown","require":["katex"],"content":"\nAn integer $N$ means $N$ steps\n"},{"title":"Standard Output","format":"markdown","require":["katex"],"content":"\nWe define $E$ as the expect number of visited points, you should output an integer $E*6^Nmod1000000007$\n"},{"title":"Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>1</td><td>12</td></tr><tr><td>2</td><td>102</td></tr></table>\n\n"}]}