{"title":"Wonderful Infinite Number","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/wonderful-infinite-number/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nPeople in Tribe Infinite honor numbers $3, 5, 7$ for their lucks. An integer is considered an Infinite Number if its prime factors are only among $3, 5, 7$. (Note: $3, 5, 7$, at least one and any is OK.) Everyone in the tribe has his/her Infinite Number as a personal ID. When a new infant comes, he/she will be given the minimal Infinite Number which is not have been used. (If a number is allocated to someone, it will belong to him/her permanently. So death and leaving are needless to worry about). Unfortunately, due to Evil Leileijj's damage, the birth log of Infinite is missing. No one knows what the next Infinite Number is. And the worst is, prince xqq will be given birth and the king may fail to give his son an Infinite Number. At the very moment, Charleszy, the cleverest man in the tribe, claims that totally $N$ people have been born since the tribe was founded. Your task is to help the king get xqq's Infinite Number.\n\nNote: according to the rules, people at the beginning are numbered $3, 5, 7, 9, 15 \\cdots $Suppose there are $5$ people already, the next Infinite Number, after $15$, is $21$.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThere are multiple cases. The first line is an integer $T(1 \\leq T \\leq 10)$, which is the number of cases. Each case has an integer $N(0 \\leq N \\leq 99999)$, indicating that $N$ people have been born since the beginning.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each case, output xqq's Infinite Number.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>4\n0\n1\n3\n5</td><td>3\n5\n9\n21</td></tr></table>\n\n"},{"title":"# Note","format":"markdown","require":["katex"],"content":"\nThe result may be extremely large, greater than $2^{64}$.\n"}]}