{"title":"Word Cloud","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/word-cloud/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nA word cloud (or tag cloud) is a visual representation of textual data based on a weighted metric. In the above cloud (which is based on this year's list of Mid-Central teams), the font size of each word is based on its number of occurrences in the data set. Tagg Johnson is a man obsessed with counting words that appear in online documents. On his computer, he keeps a spreadsheet of all the sites he visits, along with a list of words that appear on each site and the number of times such word appears. Tagg would like to generate word clouds based on the data he has collected.\n\nBefore describing the algorithm Tagg uses for generating clouds, we digress for a quick lesson in typography. The basic unit of measure is known as a point (typically abbreviated as pt). A font's size is described based on the vertical number of points from one line to the next, including any interline spacing. For example, with a 12pt font, the vertical space from the top of one character to the top of a character below it is 12 points. We assume that a character's height is precisely equal to the font's point size (regardless of whether the character is upper or lower case).\n\n![title](/source/lutece/word-cloud/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTA4MC8yMDE1MDQxODIzNTU0MDc4MzI2LmpwZw==.jpg)\n\n![title](/source/lutece/word-cloud/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vMTA4MC8yMDE1MDQxODIzNTYwODEwNDI3LmpwZw==.jpg)\n\nIn this example, apple is rendered with 23pt font using width 65pt, banana is rendered with 11pt font using width 38pt, and grape is rendered with 48pt font and width 135pt. If the overall word cloud is constrained to have width at most 260, those three words fit in a row and the overall height of that row is 48pt (due to grape). On the second row kiwi is rendered with height 43pt and width 97pt, and orange is rendered with height 28pt and width 95pt. A third row has strawberry with height 23pt and width 130pt. The overall height of this word cloud is 114pt.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nEach data set begins with a line containing two integers: W and N. The value W denotes the maximum width of the cloud; W ≤ 5000 will be at least as wide as any word at its desired font size. The value 1 ≤ N ≤ 100 denotes the number of words that appear in the cloud. Following the first line are N additional lines, each having a string S that is the word (with no whitespace), and an integer C that is a count of the number of occurrences of that word in the original data set, with 5 ≤ C ≤ 1000. Words will be given in the same order that they are to be displayed within the cloud.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each data set, output the word CLOUD followed by a space, a serial number indicating the data set, a colon, another space, and the integer height of the cloud, measured in font points.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>260 6\napple 10\nbanana 5\ngrape 20\nkiwi 18\norange 12\nstrawberry 10\n250 6\napple 10\nbanana 5\ngrape 20\nkiwi 18\norange 12\nstrawberry 10\n610 6\napple 10\nbanana 5\ngrape 20\nkiwi 18\norange 12\nstrawberry 10\n0 0</td><td>CLOUD 1: 114\nCLOUD 2: 99\nCLOUD 3: 48</td></tr></table>\n\n"}]}