{"title":"Xenospeak","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/xenospeak/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nIt's $2014$, and Bob Roberts is an expert linguist and world renowned expert on the language of the alien\nM'ca. Their language is rather unusual in that all the words are made up of the letter combinations `a`,\n`ab` and `bb` (we're using `a`s and `b`s here, since the actual M'ca characters are unprintable). Thus,\nsome words in their language are `aaabbbbb` and `aababb`, but `babb` is not (you'd be a laughingstock in\nany M'ca establishment if you tried to used `babb` in a sentence). Not surprisingly, with such a small\nalphabet, every possible combination of `a`, `ab` and `bb` form a legal M'ca word (up to a certain\nlength, which is of no importance to this problem). Bob is creating a set of M'ca-to-English dictionaries\nof all legal M'ca words and is following the traditional word ordering of the M'ca: all $1$ letter words are\nlisted first (in alphabetical order), then all $2$-letter words (in alphabetical order), and so on. The first\ntwo pages of one possible dictionary are shown below:\n\n![title](/source/lutece/xenospeak/img/aHR0cHM6Ly9hY20udWVzdGMuZWR1LmNuL21lZGlhL2ltYWdlL3Byb2JsZW0vODc1LzIwMTQwNTEwMTkxODE0Njc5MzEucG5n.png)\n\nBob needs a little help. He intends for each page of any dictionary to contain the same number of\nM'ca words, but this number will vary in different editions depending on the page size, font size, etc.\nAs with any dictionary, the first and last word of each page is printed at the top of the page to allow\neasier searching by users. Here's where you come in: given the number of words per page, and the page\nnumber, he would like a program to determine the two words printed at the top of that page.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nInput for each test case will consist of a single line containing two positive integers $n$ $m$, where $n$ is the\nnumber of words per page ($\\leq 30$) and $m$ is the page number ($m\\leq 10^{18}$). A line containing `0 0` will\nterminate input.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nFor each test case output the two words which would appear at the top of page $m$ given that $n$ words\nare printed on each page (including page $m$).\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>4 2\n9 10\n0 0</td><td>Case 1: aaa abb\nCase 2: bbbbaa aaaabab</td></tr></table>\n\n"}]}