{"title":"ZAYU","time_limit":1000,"memory_limit":64,"url":"https://acm.uestc.edu.cn/problem/zayu/description","statement":[{"title":"# Content","format":"markdown","require":["katex"],"content":"\nBUPT is a poor university, with poor campus area, poor dormitories, and also poor educational facilities.\n\nMost disciplines of the BUPT are about telecommunications and informatics, and one of them is called Microcomputer Theory. This discipline generally talks about the microcomputer system, the microprocessor with memory, the assembly language and the bus transferring system.\n\nIn fact, most universities of engineering offer this discipline, and take Intel8086 as the microprocessor for experiments. However, so poor is BUPT that the university do not have enough money to buy Intel8086, they use another microprocessor called ZAYU instead.\n\nThis kind of microprocessor is quite simple. It works with integers only, and has no storage beside a stack memory for arithmetic operations and a queue memory for storing instructions from the user.(It has no registers!) The arithmetic unit of the microprocessor operates the numbers on the stack with the instructions stored in the queue. The ZAYU can only take instructions as follows:\n1. `PSH x`, where $x$ is a non-negative integer($0\\le x\\le 2^{31}$). This instruction pushes $x$ to the top of the stack.\n2. `POP`, pop out the top number from the stack.\n3. `NEG`, change the sign of the top number.(e.g. $7\\rightarrow−7$)\n4. `DUP`, duplicate the top number on the stack.\n5. `SWP`, swap the top two numbers.\n6. `ADD`, pop the top two numbers on the stack, and push the sum of them into the stack.\n7. `SUB`, pop the top two numbers on the stack, and push the difference(the second one minus the top one) of them to the stack.\n8. `MUL`, pop the top two numbers on the stack, and push the product of them to the stack.\n9. `DIV`, pop the top two numbers on the stack, and push the quotient of division of them(the second one divides the top one) to the stack. Note that it is an integer division(e.g. $\\frac{14}{3}=4$)\n10. `MOD`, pop the top two numbers on the stack, and push the remainder of division of them(the second one modulo the top one) to the stack.\n11. `END`. This instruction ends the arithmetic process pops the top number on the stack and output it to the output device, LED etc.\n\nTo avoid ambiguities while working with negative divisors and remainders, if any operand of a division operation is negative, the absolute value of the result should always be computed with absolute values of operands, and the sign is determined as follows: the quotient is negative if and only if exactly one of the operands is negative. The remainder has the same sign as the dividend. Thus, $13\\ div\\ -4 = -3$, $-13\\ mod\\ 4 = 3$, $-13\\ mod\\ -4 = -1$, etc.\n\nAll binary operations take the top number as the right operand, and the second as the left operand. All of them remove both operands from the stack and push the result on the top.\n\nIf there is an illegal instructions, the ZAYU just throws an error signal to the output device and halts. Error occurs when:\n1. There is not enough numbers on the stack for the instruction(`POP`, `NEG` and `DUP` need at least one number while `SWP`, `ADD`, `SUB`, `MUL`, `DIV` and `MOD` need at least two).\n2. The divisor is $0$(for `DIV` or `MOD`).\n3. The absolute value of the result for any operation$\\ge 2^{31}$.\n4. The size of the stack $> 64$(for `PSH` and `DUP`).\n\nWhat's more, the size of the instruction memory are also limited, which cannot store more than $64$ instructions.\n\nQuite a poor, simple and boring chip, right? So is the homework of the discipline. The teachers always ask students to write instructions, that when some combinations of buttons pressed, the microprocessor processes the instructions and output something to light some other combinations of LEDs. What a boring task!\n\nYou are tired of doing such boring homework, drawing Karnaugh maps endlessly. As a skilled programmer, Don't Repeat Yourself is your principle. You decide to write a \"universal\" program, which would be able to write programs for homework, so that you may get more time with your girlfriend. You know that the combinations of buttons and LEDs can be expressed as integers using binary notation. So your task is to write a program, that when given $N$ pairs of integers , it is able to generates a program of the above instructions, that when executed with the stack initially containing only the input $X\\_i$, after its successful execution, the microprocessor outputs $Y\\_i$ with the stack empty.\n"},{"title":"# Standard Input","format":"markdown","require":["katex"],"content":"\nThe first line contains an integer $T$ ($T\\le 1000$), the number of test cases.\n\nFor each case, the first line contains an integer $N$ ($1\\le N\\le 8$), the number of inputs and outputs of homework. Each of the next $N$ lines contains two integers $X\\_i$ and $Y\\_i$($0\\le X\\_i,Y\\_i<64$), the $i\\_{th}$ input and output. All $X\\_i$ are distinct.\n\nThere is a blank line after each case.\n"},{"title":"# Standard Output","format":"markdown","require":["katex"],"content":"\nForeach case, the first line contains an integer $M$ ($1\\le M\\le 64$), the number of instructions.The next $M$ lines are made up of all the instructions that have been described above, one in a line. \n\nYou should be careful that the last instruction should always be `END`, which pops the last number on the stack and output it.\n\nPrint a newline AFTER each test case.\n"},{"title":"# Samples","format":"markdown","require":["katex"],"content":"\n<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>Input</td>\n\t\t<td>Output</td>\n\t</tr>\n<tr><td>2\n3\n2 6\n1 3\n3 11\n2\n10 1\n23 3</td><td>5\nDUP\nMUL\nPSH 2\nADD\nEND\n\n5\nPSH 2\nDIV\nPSH 4\nMOD\nEND</td></tr></table>\n\n"}]}