{"title":"Up the Ante","time_limit":1000,"memory_limit":62,"url":"http://www.joyoi.cn/problem/codevs-3482","statement":[{"title":"","format":"html_final","require":["katex"],"content":"\n<div class=\"panel panel-default\">\n<div class=\"area-title\">\n<span>\n题目描述\n<small>Description</small>\n</span></div>\n<div class=\"panel-body\">\n\n<p>Every summer, Stan and Ollie attend the Ex together. Stan likes to play\nCrown &amp; Anchor, a gambling game in which one bets on one of: Crown,\nAnchor, Club, Diamond, Heart, Spade. A wheel is spun and stops in a\nposition marked by three of the above symbols (not necessarily\ndistinct). If Stan has bet on one of the three symbols indicated, he\nreceives his bet back plus n times his bet, where n is the number of\ntimes that his symbol appears. <br>Every year, Stan loses money and\nOllie ridicules him for it. This year, Stan has made a side bet with\nOllie: that he can make money playing Crown &amp; Anchor. Ollie is not\nstupid and realizes that Stan might be lucky and win the first few\nrounds, so he insists that, to win the bet, Stan must be ahead after at\nleast k rounds. Also, so that the issue may be resolved before the Ex\ncloses, to win Stan must show a profit within at most m rounds. <br><br>Stan\nhas a trick up his sleeve. He has recently learned of the Monte Carlo\nstrategy for betting. The idea is that he first places the minimum bet.\nIf he wins, he collects his winnings and once again places the minimum\nbet. If he loses, he doubles his bet so that if he wins the next round,\nhe will win enough to recoup his previous losses and make a profit. This\ndoubling continues until he wins. Whenever he wins, he pockets the\nprofit and starts over with the minimum bet. <br><br>Stan thinks this is\na great strategy but the establishment thought of it first and\nimplemented a house limit - the maximum bet that Stan can place in any\ngiven round. (Even without a house limit there's a de facto Stan limit -\nthe amount of money he has with him. But we'll assume he has enough\nmoney that this limit isn't an issue.) Stan modifies his strategy so\nthat if doubling his bet would exceed the house limit, he starts over at\nthe minimum bet, hoping to recover his loss. <br><br>Stan wins the bet\nif, following this strategy, his net winnings are positive at any time\nafter playing k and before playing the m+1st round. What's the\nprobability that Stan will win the bet?</p>\n\n</div>\n</div>\n\n<div class=\"panel panel-default\">\n<div class=\"area-title\">\n<span>\n输入描述\n<small>Input Description</small>\n</span></div>\n<div class=\"panel-body\">\n<p>The first line of input contains n, the number of test cases. Each test\ncase is represented by a line containing integers k, m, and l, the\nminimum number of rounds, the maximum number of rounds, and the house\nlimit. 0 &lt; k &lt; m ≤ 30; 2 ≤ l ≤ 1000. The minimum bet is 1.</p>\n\n</div>\n</div>\n<div  class=\"panel panel-default\">\n<div class=\"area-title\">\n<span>\n输出描述\n<small>Output Description</small>\n</span></div>\n<div class=\"panel-body\">\n\n<p>For each test case, print the probability that Stan will win the bet, rounded to 4 decimal places.<br/><br/>The\ndesign of the wheel can be seen in the illustration. It has 28 possible\nstopping positions, only 14 different combinations of symbols, each of\nwhich appears twice. The 14 combinations include: 6 that contain three\nidentical symbols; 6 that contain two identical symbols, and 2 that\ncontain three distinct symbols. The patterns are designed so that each\nsymbol appears once, twice, and three times in an equal number of wheel\npositions.</p>\n\n</div>\n</div>\n\n\n<div class=\"panel panel-default\">\n<div class=\"area-title\">\n<span>\n样例输入\n<small>Sample Input</small>\n</span></div>\n<div class=\"panel-body\">\n<p>   </p><pre>1\n3 4 10</pre><p><br></p>\n\n</div>\n</div>\n\n<div class=\"panel panel-default\">\n<div class=\"area-title\">\n<span>\n样例输出\n<small>Sample Output</small>\n</span></div>\n<div class=\"panel-body\">\n<p>   </p><pre>0.5835</pre><p><br></p>\n\n</div>\n</div>\n\n<div class=\"panel panel-default\">\n<div class=\"area-title\">\n<span>\n数据范围及提示\n<small>Data Size & Hint</small>\n</span></div>\n<div class=\"panel-body\">\n<p>0 &lt; k &lt; m ≤ 30; 2 ≤ l ≤ 1000</p>\n</div>\n</div>\n"}]}