{"title":"Ants","time_limit":1000,"memory_limit":29,"url":"http://cogs.pro:8080/cogs/problem/problem.php?pid=vxixQVeeg","statement":[{"title":"题目描述","format":"html","require":["katex"],"content":"\n\n<h3>\n【题目描述】\n</h3>\n<div class=\"ptx\" lang=\"zh-CN\">\nAn army of ants walk on a horizontal pole of length l cm, each with a constant speed of 1 cm/s. When a walking ant reaches an end of the pole, it immediatelly falls off it. When two ants meet they turn back and start walking in opposite directions. We know the original positions of ants on the pole, unfortunately, we do not know the directions in which the ants are walking. Your task is to compute the earliest and the latest possible times needed for all ants to fall off the pole.\n</div>\n<h3>\n【输入格式】\n</h3>\n<div class=\"ptx\" lang=\"zh-CN\">\nThe first line of input contains one integer giving the number of cases that follow. The data for each case start with two integer numbers: the length of the pole (in cm) and n, the number of ants residing on the pole. These two numbers are followed by n integers giving the position of each ant on the pole as the distance measured from the left end of the pole, in no particular order. All input integers are not bigger than 1000000 and they are separated by whitespace.\n</div>\n<h3>\n【输出格式】\n</h3>\n<div class=\"ptx\" lang=\"zh-CN\">\nFor each case of input, output two numbers separated by a single space. The first number is the earliest possible time when all ants fall off the pole (if the directions of their walks are chosen appropriately) and the second number is the latest possible such time. <br/>\n</div>\n<h3>\n【样例输入】\n</h3>\n<pre class=\"sio\">2\n10 3\n2 6 7\n214 7\n11 12 7 13 176 23 191\n</pre>\n<h3>\n【样例输出】\n</h3>\n<pre class=\"sio\">4 8\n38 207\n</pre>\n<h3>\n【提示】\n</h3>\n<div class=\"ptx\" lang=\"zh-CN\">\n<a href=\"searchproblem?field=source&amp;key=Waterloo+local+2004.09.19\">Waterloo local 2004.09.19</a> \n</div>\n<h3>\n【来源】\n</h3>\n<h3>\n【题目来源】\n</h3>\n<a href=\"http://www.poj.org/problem?id=1852&amp;lang=zh-CN&amp;change=true\"> 北京大学 POJ 1852</a>\n\n"}]}