{"title":"[CodoJam2012] 与 Googler 共舞","time_limit":1000,"memory_limit":128,"url":"http://cogs.pro:8080/cogs/problem/problem.php?pid=pSXSJSWgP","statement":[{"title":"# 题目描述","format":"html","require":["katex"],"content":"\n\n<h3>\n\tProblem\n</h3>\n<p>\n\tYou&#39;re watching a show where Googlers (employees of Google) dance, and then each dancer is given a triplet of scores by three judges. Each triplet of scores consists of three integer scores from 0 to 10 inclusive. The judges have very similar standards, so it&#39;ssurprising if a triplet of scores contains two scores that are 2 apart. No triplet of scores contains scores that are more than 2 apart.\n</p>\n<p>\n\tFor example: (8, 8, 8) and (7, 8, 7) are not surprising. (6, 7, 8) and (6, 8, 8) are surprising. (7, 6, 9) will never happen.\n</p>\n<p>\n\tThe total points for a Googler is the sum of the three scores in that Googler&#39;s triplet of scores. The best result for a Googler is the maximum of the three scores in that Googler&#39;s triplet of scores. Given the total points for each Googler, as well as the number of surprising triplets of scores, what is the maximum number of Googlers that could have had a best result of at least p?\n</p>\n<p>\n\tFor example, suppose there were 6 Googlers, and they had the following total points: 29, 20, 8, 18, 18, 21. You remember that there were 2 surprising triplets of scores, and you want to know how many Googlers could have gotten a best result of 8 or better.\n</p>\n<p>\n\tWith those total points, and knowing that two of the triplets were surprising, the triplets of scores could have been:\n</p>\n10 9 10\n6 6 8 (*)\n2 3 3\n6 6 6\n6 6 6\n6 7 8 (*)The cases marked with a (*) are the surprising cases. This gives us 3 Googlers who got at least one score of 8 or better. There&#39;s no series of triplets of scores that would give us a higher number than 3, so the answer is 3.\n<p>\n\t<br/>\n</p>\n<h3>\n\tInput\n</h3>\n<p>\n\tThe first line of the input gives the number of test cases, T. T test cases follow. Each test case consists of a single line containing integers separated by single spaces. The first integer will be N, the number of Googlers, and the second integer will be S, the number of surprising triplets of scores. The third integer will be p, as described above. Next will be Nintegers ti: the total points of the Googlers.\n</p>\n<h3>\n\tOutput\n</h3>\n<p>\n\tFor each test case, output one line containing &#34;Case #x: y&#34;, where x is the case number (starting from 1) and y is the maximum number of Googlers who could have had a best result of greater than or equal to p.\n</p>\n<h3>\n\tLimits\n</h3>\n<p>\n\t1 ≤ T ≤ 100.<br/>\n0 ≤ S ≤ N.<br/>\n0 ≤ p ≤ 10.<br/>\n0 ≤ ti ≤ 30.<br/>\nAt least S of the ti values will be between 2 and 28, inclusive.\n</p>\n<h4>\n\tSmall dataset\n</h4>\n<p>\n\t1 ≤ N ≤ 3.\n</p>\n<h4>\n\tLarge dataset\n</h4>\n<p>\n\t1 ≤ N ≤ 100.\n</p>\n<h3>\n\tSample\n</h3>\n<div>\n\t<table>\n\t\t<tbody>\n\t\t\t<tr>\n\t\t\t\t<td>\n\t\t\t\t\t<br/>\nInput <br/>\n\t\t\t\t</td>\n\t\t\t\t<td>\n\t\t\t\t\t<br/>\nOutput <br/>\n\t\t\t\t</td>\n\t\t\t</tr>\n\t\t\t<tr>\n\t\t\t\t<td>\n\t\t\t\t\t4<br/>\n3 1 5 15 13 11<br/>\n3 0 8 23 22 21<br/>\n2 1 1 8 0<br/>\n6 2 8 29 20 8 18 18 21<br/>\n\t\t\t\t</td>\n\t\t\t\t<td>\n\t\t\t\t\tCase #1: 3<br/>\nCase #2: 2<br/>\nCase #3: 1<br/>\nCase #4: 3<br/>\n<br/>\n\t\t\t\t</td>\n\t\t\t</tr>\n\t\t</tbody>\n\t</table>\n</div>\n\n"}]}