{"title":"[CodoJam2012] 镜子大厅","time_limit":2000,"memory_limit":128,"url":"http://cogs.pro:8080/cogs/problem/problem.php?pid=pJxiNNWek","statement":[{"title":"题目描述","format":"html","require":["katex"],"content":"\n\n<h3>\n\tProblem\n</h3>\n<p>\n\tYou live in a 2-dimensional plane, and one of your favourite places to visit is the Hall of Mirrors. The Hall of Mirrors is a room (a 2-dimensional room, of course) that is laid out in a grid. Every square on the grid contains either a square mirror, empty space, or you. You have width 0 and height 0, and you are located in the exact centre of your grid square.\n</p>\n<p>\n\tDespite being very small, you can see your reflection when it is reflected back to you exactly. For example, consider the following layout, where &#39;#&#39; indicates a square mirror that completely fills its square, &#39;.&#39; indicates empty space, and the capital letter &#39;X&#39;indicates you are in the center of that square:\n</p>\n<p>\n\t<br/>\n</p>\n<pre class=\"prettyprint\">######\n#..X.#\n#.#..#\n#...##\n######</pre>\n<p>\n\t<br/>\n</p>\nIf you look straight up or straight to the right, you will be able to see your reflection.\n<p>\n\t<br/>\n</p>\n<p>\n\tUnfortunately in the Hall of Mirrors it is very foggy, so you can&#39;t see further than D units away. Suppose D=3. If you look up, your reflection will be 1 unit away (0.5 to the mirror, and 0.5 back). If you look right, your reflection will be 3 units away (1.5 to the mirror, and 1.5 back), and you will be able to see it. If you look down, your reflection will be 5 units away and you won&#39;t be able to see it.\n</p>\n<p>\n\tIt&#39;s important to understand how light travels in the Hall of Mirrors. Light travels in a straight line until it hits a mirror. If light hits any part of a mirror but its corner, it will be reflected in the normal way: it will bounce off with an angle of reflection equal to the angle of incidence. If, on the other hand, the light would touch the corner of a mirror, the situation is more complicated. The following diagrams explain the cases:\n</p>\n<p>\n\tIn the following cases, light approaches a corner and is reflected, changing its direction: <br/>\n<img src=\"/cogs/images/upload/image/20120415/20120415094056_11941.png\" alt=\"\"/><br/>\nIn the first two cases, light approached two adjacent mirrors at the point where they met. Light was reflected in the same way as if it had hit the middle of a long mirror. In the third case, light approached the corners of three adjacent mirrors, and returned in exactly the direction it came from.\n</p>\n<p>\n\tIn the following cases, light approaches the corners of one or more mirrors, but does not bounce, and instead continues in the same direction: <br/>\n<img src=\"/cogs/images/upload/image/20120415/20120415094104_44100.png\" alt=\"\"/><br/>\nThis happens when light reaches distance 0 from the corner of a mirror, but would not have to pass through the mirror in order to continue in the same direction. In this way, a ray of light can pass between two mirrors that are diagonally adjacent to each other -- effectively going through a space of size 0. Good thing it&#39;s of size 0 too, so it fits!\n</p>\n<p>\n\tIn the final case, light approaches the corner of one mirror and is destroyed: <br/>\n<img src=\"/cogs/images/upload/image/20120415/20120415094112_80457.png\" alt=\"\"/><br/>\nThe mirror was in the path of the light, and the ray of light didn&#39;t approach the corners of any other mirrors.\n</p>\n<p>\n\tNote that light stops when it hits you, but it has to hit the exact centre of your grid square.\n</p>\n<p>\n\tHow many images of yourself can you see?\n</p>\n<h3>\n\tInput\n</h3>\n<p>\n\tThe first line of the input gives the number of test cases, T. T test cases follow. Each test case starts with a line containing three space-separated integers, H, W and D. H lines follow, and each contains W characters. The characters constitute a map of the Hall of Mirrors for that test case, as described above.\n</p>\n<h3>\n\tOutput\n</h3>\n<p>\n\tFor each test case, output one line containing &#34;Case #x: y&#34;, where x is the case number (starting from 1) and y is the number of reflections of yourself you can see.\n</p>\n<h3>\n\tLimits\n</h3>\n<p>\n\t1 ≤ T ≤ 100.<br/>\n3 ≤ H, W ≤ 30.<br/>\n1 ≤ D ≤ 50.<br/>\nAll characters in each map will be &#39;#&#39;, &#39;.&#39;, or &#39;X&#39;.<br/>\nExactly one character in each map will be &#39;X&#39;.<br/>\nThe first row, the last row, the first column and the last column of each map will be entirely filled with &#39;#&#39; characters.\n</p>\n<h4>\n\tSmall dataset\n</h4>\n<p>\n\tThere will be no more than 2W+2H-4 &#39;#&#39; characters.\n</p>\n<h4>\n\tLarge dataset\n</h4>\n<p>\n\tThe restriction from the Small dataset does not apply.\n</p>\n<h3>\n\tSample\n</h3>\n<div>\n\t<table>\n\t\t<tbody>\n\t\t\t<tr>\n\t\t\t\t<td>\n\t\t\t\t\t<br/>\nInput <br/>\n\t\t\t\t</td>\n\t\t\t\t<td>\n\t\t\t\t\t<br/>\nOutput <br/>\n\t\t\t\t</td>\n\t\t\t</tr>\n\t\t\t<tr>\n\t\t\t\t<td>\n\t\t\t\t\t6<br/>\n3 3 1<br/>\n###<br/>\n#X#<br/>\n###<br/>\n3 3 2<br/>\n###<br/>\n#X#<br/>\n###<br/>\n4 3 8<br/>\n###<br/>\n#X#<br/>\n#.#<br/>\n###<br/>\n7 7 4<br/>\n#######<br/>\n#.....#<br/>\n#.....#<br/>\n#..X..#<br/>\n#....##<br/>\n#.....#<br/>\n#######<br/>\n5 6 3<br/>\n######<br/>\n#..X.#<br/>\n#.#..#<br/>\n#...##<br/>\n######<br/>\n5 6 10<br/>\n######<br/>\n#..X.#<br/>\n#.#..#<br/>\n#...##<br/>\n######<br/>\n\t\t\t\t</td>\n\t\t\t\t<td>\n\t\t\t\t\tCase #1: 4<br/>\nCase #2: 8<br/>\nCase #3: 68<br/>\nCase #4: 0<br/>\nCase #5: 2<br/>\nCase #6: 28<br/>\n<br/>\n\t\t\t\t</td>\n\t\t\t</tr>\n\t\t</tbody>\n\t</table>\n</div>\n\n"}]}