{"title":"填词游戏","time_limit":1000,"memory_limit":9,"url":"http://cogs.pro:8080/cogs/problem/problem.php?pid=pNNXyxPWk","statement":[{"title":"# 题目描述","format":"html","require":["katex"],"content":"\n\n<h3>\n\t【题目描述】\n</h3>\n<div class=\"ptx\" lang=\"zh-CN\">\n\tAlex likes solving fillwords. Fillword is a word game with very simple rules. The author of the fillword takes rectangular grid (M cells width, N cells height) and P words. Then he writes letters in the cells of the grid (one letter in one cell) so that each word can be found on the grid and the following conditions are met: <br/>\n<br/>\nno cell belongs to more than one word <br/>\n<br/>\nno cell belongs to any word more than once <br/>\n<br/>\nSome word W (let us consider its length being k) is found on the grid if you can find such sequence of cells (x1, y1), (x2, y2), ..., (xk, yk) that: <br/>\n<br/>\n(xi, yi) and (xi+1, yi+1) are neighbors (|xi-xi+1| + |yi-yi+1| = 1) for each i = 1, 2, ..., k-1 <br/>\n<br/>\nW[i] is written in the cell with coordinates (xi, yi). <br/>\n<br/>\nThe task is to find all the words on the grid. After they are found, you see that the letters in some cells are not used (they do not belong to any found word). You make up a secret word using these letters and win a big prize. <br/>\n<br/>\nTo make things clear, let us consider the following example (the words are BEG and GEE): <br/>\n\t<center>\n\t\t<img src=\"http://www.poj.org/images/1629_1.jpg\"/> \n\t</center>\n<br/>\n<br/>\nYour task is to help Alex to solve fillwords. You should find out which letters will be left after he finds all the words on the grid. The most difficult task -- to make up a secret word out of them -- we still reserve to Alex.\n</div>\n<h3>\n\t【输入格式】\n</h3>\n<div class=\"ptx\" lang=\"zh-CN\">\n\tThe first line of the input file contains three integer numbers -- N, M (2 &lt;= M, N &lt;= 10) and P (P  &lt;=100). Next N lines contain M characters each, and represent the grid. The following P lines contain words that are to be found on the fillword grid. <br/>\n<br/>\nFillword will always have at least one solution. All characters occurring in fillword will be capital English letters. <br/>\n</div>\n<h3>\n\t【输出格式】\n</h3>\n<div class=\"ptx\" lang=\"zh-CN\">\n\tOutput letters from, which a secret word should be made up. Letters should be output in lexicographical order.\n</div>\n<h3>\n\t【样例输入】\n</h3>\n<pre class=\"sio\">3 3 2\nEBG\nGEE\nEGE\nBEG\nGEE</pre>\n<h3>\n\t【样例输出】\n</h3>\n<pre class=\"sio\">EEG</pre>\n<h3>\n\t【来源】\n</h3>\n<p>\n\t</p><div class=\"ptx\" lang=\"zh-CN\" style=\"white-space:normal;\">\n\t\tNortheastern Europe 2001, Northern Subregion\n\t</div>\n<br class=\"Apple-interchange-newline\"/>\nPOJ 1629\n<p></p>\n\n"}]}