{"title":"Connections between cities","time_limit":1000,"memory_limit":32,"url":"http://www.joyoi.cn/problem/tyvj-3029","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nAfter World War X, a lot of cities have been seriously damaged, and we need to rebuild those cities. However, some materials needed can only be produced in certain places. So we need to transport these materials from city to city. For most of roads had been totally destroyed during the war, there might be no path between two cities, no circle exists as well.\r<br>Now, your task comes. After giving you the condition of the roads, we want to know if there exists a path between any two cities. If the answer is yes, output the shortest path between them.</p> \n\n \n # 输入格式 \n<p>\nInput consists of multiple problem instances.For each instance, first line contains three integers n, m and c, 2<=n<=10000, 0<=m<10000, 1<=c<=1000000. n represents the number of cities numbered from 1 to n. Following m lines, each line has three integers i, j and k, represent a road between city i and city j, with length k. Last c lines, two integers i, j each line, indicates a query of city i and city j.</p> \n\n \n # 输出格式 \n<p>\nFor each problem instance, one line for each query. If no path between two cities, output “Not connected”, otherwise output the length of the shortest path between them.</p> \n\n \n # 提示 \n<p>\nHuge input, scanf recommended.\r<br>本题数据比较弱，AC 后请到 <a href=\"http://acm.hdu.edu.cn/showproblem.php?pid=2874\">HDU2874</a> 提交。</p> "},{"title":"# 样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>5 3 2\r\n1 3 2\r\n2 4 3\r\n5 2 3\r\n1 4\r\n4 5</td><td>Not connected\r\n6</td></tr></table>\n\n"}]}