{"title":"Protecting the Flowers","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2495","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nFarmer John went to cut some wood and left N (2 <= N <= 100,000)\r<br>cows eating the grass, as usual. When he returned, he found to his\r<br>horror that the cows were in his garden eating his beautiful flowers.\r<br>Wanting to minimize the subsequent damage, FJ decided to take\r<br>immediate action and transport the cows back to their barn.\r<br>\r<br>Each cow i is at a location that is Ti minutes (1 <= Ti <= 2,000,000)\r<br>away from the barn. Furthermore, while waiting for transport, she\r<br>destroys Di (1 <= Di <= 100) flowers per minute. No matter how hard\r<br>he tries,FJ can only transport one cow at a time back to the barn.\r<br>Moving cow i to the barn requires 2*Ti minutes (Ti to get there and\r<br>Ti to return).\r<br>\r<br>Write a program to determine the order in which FJ should pick up\r<br>the cows so that the total number of flowers destroyed is minimized.\r<br>\r<br>//有六头牛，下面六行给出每头牛回家的路所要花的时间，以及它在每个时间摧毁花的数目\r<br>//John每次送一头牛回家，再返回来.希望将所有牛都送回家，然后被摧的花的总数最少.\r<br></p> \n\n \n # 输入格式 \n<p>\n* Line 1: A single integer N\r<br>\r<br>* Lines 2..N+1: Each line contains two space-separated integers, Ti\r<br>        and Di, that describe a single cow's characteristics\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\n* Line 1: A single integer that is the minimum number of destroyed\r<br>        flowers\r<br></p> "},{"title":"# 样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>6\r\n3 1\r\n2 5\r\n2 3\r\n3 2\r\n4 1\r\n1 6\r\n</td><td>86\r\n\r\nOUTPUT DETAILS:\r\n\r\nFJ returns the cows in the following order: 6, 2, 3, 4, 1, 5. While\r\nhe is transporting cow 6 to the barn, the others destroy 24 flowers;\r\nnext he will take cow 2, losing 28 more of his beautiful flora. For\r\nthe cows 3, 4, 1 he loses 16, 12, and 6 flowers respectively. When\r\nhe picks cow 5 there are no more cows damaging the flowers, so the\r\nloss for that cow is zero. The total flowers lost this way is 24 +\r\n28 + 16 + 12 + 6 = 86.\r</td></tr></table>\n\n"}]}