{"title":"River Hopscotch","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2509","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nEvery year the cows hold an event featuring a peculiar version of\r<br>hopscotch that involves carefully jumping from rock to rock in a\r<br>river. The excitement takes place on a long, straight river with a\r<br>rock at the start and another rock at the end, L units away from\r<br>the start (1 <= L <= 1,000,000,000). Along the river between the\r<br>starting and ending rocks, N (0 <= N <= 50,000) more rocks appear,\r<br>each at an integral distance Di from the start (0 < Di < L).\r<br>\r<br>To play the game, each cow in turn starts at the starting rock and\r<br>tries to reach the finish at the ending rock, jumping only from\r<br>rock to rock. Of course, less agile cows never make it to the final\r<br>rock, ending up instead in the river.\r<br>\r<br>Farmer John is proud of his cows and watches this event each year.\r<br>But as time goes by, he tires of watching the timid cows of the\r<br>other farmers limp across the short distances between rocks placed\r<br>too closely together. He plans to remove several rocks in order to\r<br>increase the shortest distance a cow will have to jump to reach the\r<br>end. He knows he cannot remove the starting and ending rocks, but\r<br>he calculates that he has enough resources to remove up to M rocks\r<br>(0 <= M <= N).\r<br>\r<br>FJ wants to know exactly how much he can increase the shortest\r<br>distance *before* he starts removing the rocks. Help Farmer John\r<br>determine the greatest possible shortest distance a cow has to jump\r<br>after removing the optimal set of M rocks.\r<br>\r<br>数轴上有n个石子，第i个石头的坐标为Di，现在要从0跳到L，每次条都从一个石子跳到相邻的下一个石子。\r<br>现在FJ允许你移走M个石子，问移走这M个石子后，相邻两个石子距离的最小值的最大值是多少。</p> \n\n \n # 输入格式 \n<p>\n* Line 1: Three space-separated integers: L, N, and M\r<br>\r<br>* Lines 2..N+1: Each line contains a single integer indicating how far\r<br>        some rock is away from the starting rock. No two rocks share\r<br>        the same position.\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\n* Line 1: A single integer that is the maximum of the shortest\r<br>        distance a cow has to jump after removing M rocks\r<br>\r<br></p> "},{"title":"# 样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>25 5 2\r\n2\r\n14\r\n11\r\n21\r\n17\r\n\r\n5 rocks at distances 2, 11, 14, 17, and 21. Starting rock at position\r\n0, finishing rock at position 25.\r\n</td><td>4\r\n\r\nOUTPUT DETAILS:\r\n\r\nBefore removing any rocks, the shortest jump was a jump of 2 from\r\n0 (the start) to 2. After removing the rocks at 2 and 14, the\r\nshortest required jump is a jump of 4 (from 17 to 21 or from 21 to\r\n25).\r</td></tr></table>\n\n"}]}