{"title":"Crisis on the Farm","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2469","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nFarmer John and his herd of exotic dancing bovines have been \r<br>practicing for his new moosical, \"The Street Cow Named Desire\". At \r<br>one point in the middle of rehearsal, his cows are stacked on top \r<br>of each other in N (1 <= N <= 1,000) sets of 30, one cow standing \r<br>on the back of the other (they are quite amazing cows). Thus, the \r<br>pasture is dotted with both these stacks of 30 cows and also, in \r<br>separate locations, M (1 <= M <= 1,000) haystacks. Below is a sample \r<br>of one way they might be laid out: \r<br>\r<br>8 ......... \r<br>7 ....CH.H. C = stack of 30 cows \r<br>6 ......... \r<br>5 ......... H = haystack \r<br>4 ..C.HH... \r<br>3 ......... \r<br>2 .....C.HH \r<br>1 ......... \r<br>123456789 \r<br>\r<br>As the musical's conductor, Farmer John has four whistles with \r<br>various tones. One whistle commands the cow at the bottom of each \r<br>stack to move (along with all the stacked cows) one unit north, \r<br>another indicates a move to the south, one indicates a move to the \r<br>east, and a fourth to order a move to the west. \r<br>\r<br>Any time the stack of cows enters a grid location with a haystack, \r<br>the cow on the top of the stack (even if the stack has height one) \r<br>will jump onto the haystack while the remaining cows move into the \r<br>same location as the haystack. Thus, if the bottom cow encounters \r<br>30 haystacks (perhaps different haystacks, perhaps not), the stack \r<br>of 30 cows is exhausted with all the cows standing on top of haystacks \r<br>(or standing on cows on haystacks). The sturdy haystacks can each \r<br>support an unlimited number of cows. \r<br>\r<br>Farmer John glances across his pasture to Farmer Don's milking \r<br>facility to see, to his horror, a huge milk tank exploding and \r<br>unleashing a giant tidal wave of milk making its way toward the \r<br>performing cows! Since any cows on a haystack are safe, FJ must now \r<br>do what he can to save the lives of as many cows as possible using \r<br>what has turned from a simple dance routine into a lifesaving \r<br>technique. \r<br>\r<br>Given the number of times K (1 <= K <= 30) farmer John can blow a \r<br>whistle until the wave of milk crashes over the pasture and also \r<br>the X_i, Y_i positions (1 <= X_i <= 1,000; 1 <= Y_i <= 1,000) of \r<br>the N stacks of cows and M haystacks (none of which currently has \r<br>any cows on it), report the greatest number of cows that can be \r<br>saved and find a sequence of whistle blows that does the job. The \r<br>sequence should be reported in terms of the four directions, 'E' \r<br>for east, 'N' for north, 'W' for west, 'S' for south. Among all \r<br>such sequences, farmer John wants the lexicographically least. \r<br>Initial locations of cows and haystacks will not share the same \r<br>coordinates in the input file. \r<br>\r<br>Cows can be moved to any location, including ones outside the \r<br>pasture. \r<br>John有N摞高度为30的牛,N摞的牛看成一个整体，要移动的时候一起移动. \r<br>将移动到草堆所在的位置时，最上面那个牛就会跳到草堆上去. \r<br>现在给出M个草堆所在的位置，以及移动的次数K（K小于30) \r<br>问最多可移动多少头牛到草堆上去,并输出你每次移动的方向 \r<br>\r<br>\r<br>\r<br></p> \n\n \n # 输入格式 \n<p>\n* Line 1: Three space-separated integers: N, M, and K \r<br>* Lines 2..N+1: Line i+1 describes the X,Y location of a stack of 30 \r<br>cows using two space-separated integers: X_i and Y_i \r<br>* Lines N+2..N+M+1: Line i+N+1 describes the X,Y location of a \r<br>haystack using two space-separated integers: X_i and Y_i \r<br></p> \n\n \n # 输出格式 \n<p>\n\r<br>* Line 1: A single integer that is the most number of cows that can be\r<br>        saved.\r<br>* Line 2: K characters, the lexicographically least sequence of\r<br>        commands FJ should issue to maximize the number of cows saved.\r<br></p> "},{"title":"样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>3 6 3 \r\n3 4 \r\n6 2 \r\n5 7 \r\n8 2 \r\n9 2 \r\n6 4 \r\n5 4 \r\n6 7 \r\n8 7 \r\n\r\n\r\n</td><td>Use the 'east' whistle three times, at which point the milk floods\r\nthe area.  Each haystack ends up saving 1 cow.\r\n\r\n6 \r\nEEE \r</td></tr></table>\n\n"}]}