{"title":"Queue","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2712","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nIf you are an average football fan, you probably know that obtaining tickets for this year’s World Cup in Germany was an impossible task. Greedy organizers and football federations grabbed the majority or available tickets and divided them among sponsors, friends and family members. As a result, jet setters have flooded the venues, while die-hard fans sit at home enjoying the games between advertisements featuring crappy beer and sugar-free chewing gum.\r<br>A couple of tickets are left for the final game and a huge queue has formed in front of the ticker office. As fans were arriving, they were labeled with successive integers. The first person in queue was labeled with number one, the second with number two, etc.\r<br>Since the fans arrived the night before, they had to wait for a long time before the ticket counter was open and, naturally, some of them had to use the restroom. Each time a person needs to use the restroom, he/she steps out of the queue and, and, after completing the task, steps back into the queue, though not necessarily at the same position as before. Since there is only one restroom available no person leaves the queue before the previous person has returned (hence, at any moment there is at most one person missing from the queue).\r<br>During the course of the night, a total of N restroom visits have occurred. Each visit is described by two positive integers A and B, denoting that the person labeled A stepped out of the queue and the stepped back into the queue immediately in front of the person labeled B. Now that all the visits have completed, the officials have to answer a series of questions. Each question is either of the form ‘P X’, asking for the position lf the person labeled X, or of the form ‘L X’, asking for the label of the person at position X.\r<br>The first person in queue is considered to be at position one, the second at position two, etc.\r<br>Write a program that, given the description of the visits and a number of questions, answers all of the questions.\r<br>\r<br>一开始将一列人按编号从1开始顺序排列，然后进行N次操作，每次将编号为A的人拿出，放在编号为B的人前面，所有操作进行完后有Q个问题，询问编号为X的人的位置，或者询问在X号位置上的人的编号。\r<br></p> \n\n \n # 输入格式 \n<p>\nThe first line of input contains an integer N(2 ≤ N ≤ 50 000)- the total number of restroom visits.\r<br>Each of the following N lines contains two different integers A and B (1 ≤ A, B ≤ 109), describing one restroom visit. The nest line contains an integer Q (1 ≤ Q ≤ 50 000) – the total number of questions.\r<br>Each of the following Q lines contains a single character (either the uppercase letter ‘P’ or the uppercase letter ‘L’) and an integer X (1≤ X ≤109) , describing one question.\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\nThe output should consist of a total of Q lines.\r<br>The ith line or output should contain a single integer R – the answer to the ith question.\r<br>If the corresponding question is of the form ‘P Xi’ then R should be the final position of the person labeled Xi.\r<br>If the corresponding question is of the form ‘L Xi’ then R should be the label of the person at position Xi.\r<br>\r<br>Grading\r<br>Partial credit is awarded for incorrect solutions that correctly answer all questions of one type. If all questions of the form ‘P X’ are answered correctly or if all questions of the form ‘L X’ are answered correctly, you will receive 50% of the corresponding test case.\r<br>In order to receive partial credit, the output should be formatted according to the specifications. Therefore, even if you choose to answer only one type of questions, you should still produce output for all questions of the other type. \r<br></p> "},{"title":"# 样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>2\r\n6 3\r\n9 6\r\n8\r\nL 1\r\nL 2\r\nL 3\r\nL 4\r\nP 1\r\nP 2\r\nP 3\r\nP 4\r\nOutput\r\n1\r\n2\r\n9\r\n6\r\n1\r\n2\r\n5\r\n6\r\n\r\nInput\r\n5\r\n7 2\r\n2 7\r\n9 7\r\n10 1\r\n10005 9995\r\n9\r\nL 1\r\nP 2\r\nL 2\r\nP 7\r\nL 7\r\nP 9\r\nP 10\r\nP 99999\r\nP 100000\r\n</td><td>10\r\n3\r\n1\r\n5\r\n4\r\n4\r\n1\r\n100000\r\n99999\r\n\r</td></tr></table>\n\n"}]}