{"title":"Around the world","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2585","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\n\r<br>Over the years, FJ has made a huge number of farmer friends all\r<br>around the world.  Since he hasn't visited 'Farmer Ted' from England\r<br>and 'Boer Harms' from Holland for a while, he'd like to visit them.\r<br>\r<br>He knows the longitude of the farm where each of his worldwide\r<br>friends resides.  This longitude is an angle (an integer in the\r<br>range 0..359) describing the farm's location on the Earth, which\r<br>we will consider to be a circle instead of the more complex and\r<br>traditional spherical representation. Except for the obvious\r<br>discontinuity, longitudes increase when traveling clockwise on this\r<br>circle.\r<br>\r<br>FJ plans to travel by airplane to visit his N (1 <= N <= 5,000)\r<br>friends (whose farms are uniquely numbered 1..N). He knows the\r<br>schedules for M (1 <= M <= 25,000) bidirectional flights connecting\r<br>the different farms.  Airplanes always travel shortest paths on the\r<br>Earth's surface (i.e., on the shortest arc of a circle).\r<br>\r<br>There will always be a unique shortest path between two farms that\r<br>are directly connected.  No pair of antipodal farms (exactly opposite\r<br>each other on the circle) is ever directly connected.\r<br>\r<br>Each airplane flight can be described as traveling in clockwise or\r<br>counterclockwise direction around the Earth's surface. For example,\r<br>a flight from longitude 30 to longitude 35 would be clockwise, as\r<br>would be a flight from longitude 350 to longitude 10.  However, a\r<br>flight from longitude 350 to longitude 200 follows a shortest path\r<br>counterclockwise around the circle.\r<br>\r<br>FJ would find it very cool if he could make a trip around the world,\r<br>visiting some of his friends along the way. He'd like to know if\r<br>this is possible and if so, what is the minimum number of flights\r<br>he can take to do so.\r<br>\r<br>He wants to start and finish his journey at the location of his\r<br>best friend (the one listed first in the input below).  In order\r<br>to make sure he actually circles the Earth, he wants to ensure that\r<br>the clockwise distance he travels is different from the counterclockwise\r<br>distance he travels.\r<br>\r<br></p> \n\n \n # 输入格式 \n<p>\n\r<br>* Line 1: Two space-separated integers: N  and M\r<br>\r<br>* Lines 2..N+1: Line i+1 contains one integer: the longitude of the\r<br>        i-th farm. Line 2 contains the location of the farm of his\r<br>        best friend.\r<br>\r<br>* Lines N+2..N+M+1: Line i+N+1 contains two integers giving the\r<br>        indices of two farms that are connected by a flight.\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\n\r<br>* Line 1: A single integer specifying the minimum number of flights FJ\r<br>        needs to visit to make a trip around the world. Every time FJ\r<br>        moves from one farm to another counts as one flight. If it is\r<br>        impossible to make such a trip, output the integer -1.\r<br>\r<br></p> "},{"title":"# 样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>\r\n3 3\r\n0\r\n120\r\n240\r\n1 2\r\n2 3\r\n1 3\r\n\r\nINPUT DETAILS:\r\n\r\nFarmer John has three friends at longitudes 0, 120, and 240.  There are\r\nthree flights: 0<->120, 120<->240, and 0<->240.  The journey must start and\r\nfinish at longitude 0.\r\n\r\n</td><td>\r\n3\r\n\r\nOUTPUT DETAILS:\r\n\r\nFJ must visit all 3 friends to make a full trip around the world.\r</td></tr></table>\n\n"}]}