{"title":"Pku3763 Tour in Wonder Land","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2719","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nYou must have heard of the literature \"Alice's Adventures in Wonderland\"! The 3D film \"Alice in Wonderland\" published by Disney Company becomes the most popular film in 2010! Today, Alice starts her new adventure in Wonderland again!\r<br>\r<br>In Wonderland, there are n cities, numbered from 1 to n. The capital is city 1. Cities are connected by bi-directional roads. The road system is constructed so that from every city, there is exactly one way to reach any other. \r<br>\r<br>Alice hopes that she could make a tour in which she visits each city exactly once then return to the capital. Furthermore, she doesn't want to traverse any road more than once. Obviously, it is impossible to make such tour with current road system.\r<br>\r<br>However, in Wonderland, we can use magic spells! The Cheshire Cat, with his magic power, plans to construct more roads to make Alice's dream come true. Sadly, if he used too many magic spells, he would be weaken. \"What is the minimum number of roads I have to construct?\" - The poor cat wonders. Could you help him answer this question?\r<br>\r<br>输入一棵树，添加最少的边使得存在从1开始的哈密尔顿回路</p> \n\n \n # 输入格式 \n<p>\nThe first line of input contains the number n --- the number of cities in Wonderland (3 ≤ n ≤ 100 000). The following n-1 lines describe the roads. Each road is represented by two integers --- the indexes of two cities it connects.\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\nThe minimum number of roads to construct. \r<br>\r<br></p> \n\n \n # 提示 \n<p>\nIn this example, we can construct 2 roads: 3-4 and 4-5, then Alice will be able to take a tour 1-2-3-4-5-1 \r<br></p> "},{"title":"样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>5\r\n1 2\r\n2 3\r\n2 4\r\n1 5\r\n\r\n</td><td>2\r</td></tr></table>\n\n"}]}