{"title":"Fliptile","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2506","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nFarmer John knows that an intellectually satisfied cow is a happy\r<br>cow who will give more milk. He has arranged a brainy activity for\r<br>cows in which they manipulate an M x N grid (1 <= M <= 15; 1 <= N\r<br><= 15) of square tiles, each of which is colored black on one side\r<br>and white on the other side.\r<br>\r<br>As one would guess, when a single white tile is flipped, it changes\r<br>to black; when a single black tile is flipped, it changes to white.\r<br>The cows are rewarded when they flip the tiles so that each tile\r<br>has the white side face up. However, the cows have rather large\r<br>hooves and when they try to flip a certain tile, they also flip all\r<br>the adjacent tiles (tiles that share a full edge with the flipped\r<br>tile). Since the flips are tiring, the cows want to minimize the\r<br>number of flips they have to make.\r<br>\r<br>Help the cows determine the minimum number of flips required, and\r<br>the locations to flip to achieve that minimum. If there are multiple\r<br>ways to achieve the task with the minimum amount of flips, return\r<br>the one with the least lexicographical ordering in the output when\r<br>considered as a string.  If the task is impossible, print one line\r<br>with the word \"IMPOSSIBLE\".\r<br>\r<br></p> \n\n \n # 输入格式 \n<p>\n* Line 1: Two space-separated integers: M and N\r<br>\r<br>* Lines 2..M+1: Line i+1 describes the colors (left to right) of row i\r<br>        of the grid with N space-separated integers which are 1 for\r<br>        black and 0 for white\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\n* Lines 1..M: Each line contains N space-separated integers, each\r<br>        specifying how many times to flip that particular location.\r<br>\r<br></p> "},{"title":"样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>4 4\r\n1 0 0 1\r\n0 1 1 0\r\n0 1 1 0\r\n1 0 0 1\r\n\r\n\r\n</td><td>\r\n0 0 0 0\r\n1 0 0 1\r\n1 0 0 1\r\n0 0 0 0\r\n\r\nOUTPUT DETAILS:\r\n\r\nAfter flipping at row 2 column 1, the board will look like:\r\n0 0 0 1\r\n1 0 1 0\r\n1 1 1 0\r\n1 0 0 1\r\n\r\nAfter flipping at row 2 column 4, the board will look like:\r\n0 0 0 0\r\n1 0 0 1\r\n1 1 1 1\r\n1 0 0 1\r\n\r\nAfter flipping at row 3 column 1, the board will look like:\r\n0 0 0 0\r\n0 0 0 1\r\n0 0 1 1\r\n0 0 0 1\r\n\r\nAfter flipping at row 3 column 4, the board will look like:\r\n0 0 0 0\r\n0 0 0 0\r\n0 0 0 0\r\n0 0 0 0\r\n\r\nAnother solution might be:\r\n0 1 1 0\r\n0 0 0 0\r\n0 0 0 0\r\n0 1 1 0\r\nbut this solution is lexicographically higher than the solution above.\r</td></tr></table>\n\n"}]}