{"title":"Treasure","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2559","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\n\r<br>Canmuu and his friends have recently acquired a large cache of\r<br>plutonium and have agreed to bury their newfound treasure at some\r<br>road intersection deep in the Canadian wilderness. Any sort of treasure\r<br>burial calls for a treasure map so they've decided to create one\r<br>of their own.\r<br>\r<br>The road network consists of N (4 <= N <= 100,000) intersections\r<br>(conveniently numbered 1..N) with N roads connecting them. As busy\r<br>intersections confuse everybody, every intersection has at least\r<br>one road that leads to it, and no intersection has more than four\r<br>roads connected to it. Excellent maintenance has ensured that a\r<br>moose can always run either way between any pair of intersections.\r<br>Furthermore, Canmuu has decided the plutonium should not be buried\r<br>at any of the 4-way intersections since busy traffic decreases the\r<br>secrecy of the buried treasure.\r<br>\r<br>The treasure map will contain all the roads and all the intersections.\r<br>But, to conceal the treasure's location, only one road intersection\r<br>on the treasure map is to be labeled: the intersection at which the\r<br>treasure is buried (which has a big red 'X', of course).\r<br>\r<br>Ever the alert moose, Canmuu drew some trial maps to see what they\r<br>would look like depending on where the treasure was buried. Canmuu\r<br>noticed that the moose might draw similar maps even if they bury\r<br>their treasure in two different locations. Their curiosity piqued,\r<br>the herd began trying to figure out how many distinct maps they\r<br>could end up making.\r<br>\r<br>Maps are indistinct if it is possible to assign a mapping such that:\r<br>\r<br>  * the X-labeled intersections on both maps correspond,\r<br>\r<br>  * a correspondence can be created for the other intersections,\r<br>    such that\r<br>\r<br>  * when the well-chosen intersection correspondence is determined,\r<br>    the roads that connect the intersections also correspond.\r<br>\r<br>By way of example, consider the maps below where N = 4; the treasure\r<br>might be buried at any of four intersections:\r<br>\r<br>        +             +             X           +\r<br>       /|            /|            /|          /|\r<br>  X---+ |       +---X |       +---+ |     +---+ |\r<br>       \\|            \\|            \\|          \\|\r<br>        +             +             +           X\r<br>\r<br>The final two maps, however, are not distinct since one can create\r<br>a correspondence for the vertices (consider the map upside down)\r<br>and then the roads correspond exactly. Thus, only three maps are\r<br>distinct.\r<br>\r<br>How many distinct maps are possible for a given set of roads?\r<br>\r<br></p> \n\n \n # 输入格式 \n<p>\n* Line 1: A single integer: N\r<br>\r<br>* Lines 2..N + 1: Two space-separated integers: A and B (1 <= A <= N;\r<br>        1 <= B <= N), indicating that there is a road connecting\r<br>        intersections A and B\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\n\r<br>* Line 1: A single integer that is the number of distinct treasure\r<br>        maps\r<br></p> "},{"title":"# 样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>\r\n4\r\n1 2\r\n2 3\r\n3 1\r\n1 4\r\n\r\nINPUT DETAILS:\r\n\r\nHere is a drawing of the roads and the intersections.\r\n\r\n                   4---1---2\r\n                        \\ /\r\n                         3\r\n\r\n</td><td>\r\n3\r\n\r\nOUTPUT DETAILS:\r\n\r\nThe treasure can be buried at any intersection. However, burying it at\r\nintersections 2 and 3 yields maps that are identical to each other. So the\r\ntotal number of distinct treasure maps is 3.\r\n\r</td></tr></table>\n\n"}]}