{"title":"Ombrophobic Bovines","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2580","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\n\r<br>FJ's cows really hate getting wet so much that the mere thought of\r<br>getting caught in the rain makes them shake in their hooves.  They\r<br>have decided to put a rain siren on the farm to let them know when\r<br>rain is approaching. They intend to create a rain evacuation plan\r<br>so that all the cows can get to shelter before the rain begins.\r<br>Weather forecasting is not always correct, though. In order to\r<br>minimize false alarms, they want to sound the siren as late as\r<br>possible while still giving enough time for all the cows to get to\r<br>some shelter.\r<br>\r<br>The farm has F (1 <= F <= 200) fields on which the cows graze.  A\r<br>set of P (1 <= P <= 1500) paths connects them. The paths are wide,\r<br>so that any number of cows can traverse a path in either direction.\r<br>\r<br>Some of the farm's fields have rain shelters under which the cows\r<br>can shield themselves. These shelters are of limited size, so a\r<br>single shelter might not be able to hold all the cows.  Fields are\r<br>small compared to the paths and require no time for cows to traverse.\r<br>\r<br>Compute the minimum amount of time before rain starts that the siren\r<br>must be sounded so that every cow can get to some shelter.\r<br>\r<br></p> \n\n \n # 输入格式 \n<p>\n\r<br>* Line 1: Two space-separated integers: F and P\r<br>\r<br>* Lines 2..F+1: Two space-separated integers that describe a field. \r<br>        The first integer (range: 0..1000) is the number of cows in\r<br>        that field.  The second integer (range: 0..1000) is the number\r<br>        of cows the shelter in that field can hold.  Line i+1\r<br>        describes field i.\r<br>\r<br>* Lines F+2..F+P+1: Three space-separated integers that describe a\r<br>        path. The first and second integers (both range 1..F) tell the\r<br>        fields connected by the path. The third integer (range:\r<br>        1..1,000,000,000) is how long any cow takes to traverse it.\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\n\r<br>* Line 1: The minimum amount of time required for all cows to get\r<br>        under a shelter, presuming they plan their routes optimally. \r<br>        If it not possible for the all the cows to get under a\r<br>        shelter, output \"-1\".\r<br>\r<br></p> "},{"title":"样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>\r\n3 4\r\n7 2\r\n0 4\r\n2 6\r\n1 2 40\r\n3 2 70\r\n2 3 90\r\n1 3 120\r\n\r\n</td><td>\r\n110\r\n\r\nOUTPUT DETAILS:\r\n\r\nIn 110 time units, two cows from field 1 can get under the shelter in that\r\nfield, four cows from field 1 can get under the shelter in field 2, and one\r\ncow can get to field 3 and join the cows from that field under the\r\nshelter in field 3.  Although there are other plans that will get all the\r\ncows under a shelter, none will do it in fewer than 110 time units.</td></tr></table>\n\n"}]}