{"title":"The Cow Prom","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2512","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nThe N (2 <= N <= 10,000) cows are so excited: it's prom night! They\r<br>are dressed in their finest gowns, complete with corsages and new\r<br>shoes. They know that tonight they will each try to perform the\r<br>Round Dance.\r<br>\r<br>Only cows can perform the Round Dance which requires a set of ropes\r<br>and a circular stock tank. To begin, the cows line up around a\r<br>circular stock tank and number themselves in clockwise order\r<br>consecutively from 1..N. Each cow faces the tank so she can see the\r<br>other dancers.\r<br>\r<br>They then acquire a total of M (2 <= M <= 50,000) ropes all of which\r<br>are distributed to the cows who hold them in their hooves.  Each\r<br>cow hopes to be given one or more ropes to hold in both her left\r<br>and right hooves; some cows might be disappointed.\r<br>\r<br>For the Round Dance to succeed for any given cow (say, Bessie), the\r<br>ropes that she holds must be configured just right. To know if\r<br>Bessie's dance is successful, one must examine the set of cows\r<br>holding the other ends of her ropes (if she has any), along with\r<br>the cows holding the other ends of any ropes they hold, etc.  When\r<br>Bessie dances clockwise around the tank, she must instantly pull\r<br>all the other cows in her group around clockwise, too. Likewise,\r<br>if she dances the other way, she must instantly pull the entire\r<br>group counterclockwise (anti-clockwise in British English).\r<br>\r<br>Of course, if the ropes are not properly distributed then a set of\r<br>cows might not form a proper dance group and thus can not succeed\r<br>at the Round Dance. One way this happens is when only one rope\r<br>connects two cows. One cow could pull the other in one direction,\r<br>but could not pull the other direction (since pushing ropes is\r<br>well-known to be fruitless). Note that the cows must Dance in\r<br>lock-step: a dangling cow (perhaps with just one rope) that is\r<br>eventually pulled along disqualifies a group from properly performing\r<br>the Round Dance since she is not immediately pulled into lockstep\r<br>with the rest.\r<br>\r<br>Given the ropes and their distribution to cows, how many groups of\r<br>cows can properly perform the Round Dance? Note that a set of ropes\r<br>and cows might wrap many times around the stock tank.\r<br>\r<br></p> \n\n \n # 输入格式 \n<p>\n* Line 1: Two space-separated integers: N and M\r<br>\r<br>* Lines 2..M+1: Each line contains two space-separated integers A and\r<br>        B that describe a rope from cow A to cow B in the clockwise\r<br>        direction.\r<br></p> \n\n \n # 输出格式 \n<p>\n\r<br>* Line 1: A single line with a single integer that is the number of\r<br>        groups successfully dancing the Round Dance.\r<br></p> "},{"title":"样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>5 4\r\n2 4\r\n3 5\r\n1 2\r\n4 1\r\n\r\nINPUT DETAILS:\r\n\r\nASCII art for Round Dancing is challenging. Nevertheless, here is a\r\nrepresentation of the cows around the stock tank:\r\n       _1___\r\n      /**** \\\r\n   5 /****** 2\r\n  / /**TANK**|\r\n  \\ \\********/\r\n   \\ \\******/  3\r\n    \\ 4____/  /\r\n     \\_______/\r\n\r\n</td><td>\r\n1\r\n\r\nOUTPUT DETAILS:\r\n\r\nCows 1, 2, and 4 are properly connected and form a complete Round\r\nDance group. Cows 3 and 5 don't have the second rope they'd need\r\nto be able to pull both ways, thus they can not properly perform the\r\nRound Dance.</td></tr></table>\n\n"}]}