{"title":"ANTENNA","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2711","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nA telecom company is developing a GSM network in the city of Vrsar. Their contract with the city specifies the minimum number of households that need to be covered by the signal. Due to budget constraints they can only build one antenna with a certain range. Since the cost is proportional to the range of the antenna, they would like to place the antenna so that the range required to meet the terms of the contract is minimized.\r<br>There are N households in Vrsar, each represented by a pair of integer coordinates. The antenna can be placed at any point in the plane (not necessarily with integer coordinates) and the range of the antenna can be any positive real number. If the range of the antenna is R, then a household is covered by the signal if the distance between the antenna and the household is at most R.\r<br>Write a program that, given the locations of the households and an integer K, finds the minimum range required and one possible location for the antenna so that at last K households are covered by the signal.\r<br>\r<br>题目分析\r<br>题目大意是给出N个点的坐标，要求能够覆盖其中至少K个点的圆的最小半径及圆心位置。\r<br></p> \n\n \n # 输入格式 \n<p>\nThe first line of input contains two integers N and K (2≤K≤N≤500) – the total number of households and the minimum number of households that need to be covered by the signal.\r<br>Each of the following N lines contains two integers X and Y (0≤X,Y≤10 000) – the coordinates of one household. No two households will be located at the same coordinates.\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\nThe first line of output should contain the minimum required range R for the antenna – a real number.\r<br>The second line of output should contain the coordinates of the antenna - two real numbers X and Y.\r<br>Note: If there are multiple solutions, you should output any one of them. All three numbers should be output either in standard decimal form or scientific notation.\r<br>\r<br>Grading\r<br>Your solution will be marked correct if and only if the following two conditions ar satisfied:\r<br>&#61548;\tThe absolute difference between R and the minimum required range as determined by the jury is less than or equal to 0.0001.\r<br>&#61548;\tThe antenna with range R+0.0002 placed at coordinates (X,Y) covers at least K households.\r<br>\r<br></p> \n\n \n # 提示 \n<p>\n存在精度误差,请不要提交</p> "},{"title":"# 样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>10 5 \r\n1 8 \r\n2 6 \r\n4 8 \r\n2 2 \r\n9 7 \r\n8 5 \r\n5 3 \r\n3 3 \r\n4 6 \r\n4 1 </td><td>2.236068 \r\n3 4 </td></tr></table>\n\n"}]}