{"title":"Apple Catching","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2587","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\n\r<br>It is a little known fact that cows love apples.  Farmer John has\r<br>two apple trees (which are conveniently numbered 1 and 2) in his\r<br>field, each full of apples.  Bessie cannot reach the apples when\r<br>they are on the tree, so she must wait for them to fall.  However,\r<br>she must catch them in the air since the apples bruise when they\r<br>hit the ground (and no one wants to eat bruised apples).  Bessie\r<br>is a quick eater, so an apple she does catch is eaten in just a few\r<br>seconds.\r<br>\r<br>Each minute, one of the two apple trees drops an apple. Bessie,\r<br>having much practice, can catch an apple if she is standing under\r<br>a tree from which one falls. While Bessie can walk between the two\r<br>trees quickly (in much less than a minute), she can stand under\r<br>only one tree at any time. Moreover, cows do not get a lot of\r<br>exercise, so she is not willing to walk back and forth between the\r<br>trees endlessly (and thus misses some apples).\r<br>\r<br>Apples fall (one each minute) for T (1 <= T <= 1,000) minutes.\r<br>Bessie is willing to walk back and forth at most W (1 <= W <= 30)\r<br>times. Given which tree will drop an apple each minute, determine\r<br>the maximum number of apples which Bessie can catch.  Bessie starts\r<br>at tree 1.\r<br>\r<br></p> \n\n \n # 输入格式 \n<p>\n\r<br>* Line 1: Two space separated integers: T and W\r<br>\r<br>* Lines 2..T+1: 1 or 2: the tree that will drop an apple each minute.\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\n\r<br>* Line 1: The maximum number of apples Bessie can catch without\r<br>        walking more than W times.\r<br>\r<br></p> "},{"title":"样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>\r\n7 2\r\n2\r\n1\r\n1\r\n2\r\n2\r\n1\r\n1\r\n\r\nINPUT DETAILS:\r\n\r\nSeven apples fall - one from tree 2, then two in a row from tree 1, then\r\ntwo in a row from tree 2, then two in a row from tree 1. Bessie is \r\nwilling to walk from one tree to the other twice.\r\n\r\n</td><td>\r\n6\r\n\r\nOUTPUT DETAILS:\r\n\r\nBessie can catch six apples by staying under tree 1 until the first two\r\nhave dropped, then moving to tree 2 for the next two, then returning back\r\nto tree 1 for the final two.</td></tr></table>\n\n"}]}