{"title":"Ural 鹰蛋","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2683","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\nImagine that you are in a building with F floors (starting at floor 1, the lowest floor), and you have a large number of identical eggs, each in its own identical protective container. For each floor in the building, you want to know whether or not an egg dropped from that floor will break. If an egg breaks when dropped from floor i, then all eggs are guaranteed to break when dropped from any floor j ≥ i. Likewise, if an egg doesn't break when dropped from floor i, then all eggs are guaranteed to never break when dropped from any floor j ≤ i.\r<br>We can define Solvable(F, D, B) to be true if and only if there exists an algorithm to determine whether or not an egg will break when dropped from any floor of a building with F floors, with the following restrictions: you may drop a maximum of D eggs (one at a time, from any floors of your choosing), and you may break a maximum of B eggs. You can assume you have at least D eggs in your possession.\r<br></p> \n\n \n # 输入格式 \n<p>\nThe first line of input gives the number of cases, N. N test cases follow. Each case is a line formatted as:\r<br>F D B\r<br>Solvable(F, D, B) is guaranteed to be true for all input cases.\r<br></p> \n\n \n # 输出格式 \n<p>\nFor each test case, output one line containing \"Case #x: \" followed by three space-separated integers: Fmax, Dmin, and Bmin. \r<br>The definitions are as follows:\r<br>1.\tFmax is defined as the largest value of F' such that Solvable(F', D, B) is true, or -1 if this value would be greater than or equal to 232 .(In other words, Fmax = -1 if and only if Solvable(232, D, B) is true.)\r<br>2.\tDmin is defined as the smallest value of D' such that Solvable(F, D', B) is true.\r<br>3.\tBmin is defined as the smallest value of B' such that Solvable(F, D, B') is true.\r<br>\r<br>Limits\r<br>1 ≤ N ≤ 100. \r<br>Small dataset\r<br>1 ≤ F ≤ 100,\r<br>1 ≤ D ≤ 100,\r<br>1 ≤ B ≤ 100. \r<br>Large dataset\r<br>1 ≤ F ≤ 2000000000,\r<br>1 ≤ D ≤ 2000000000,\r<br>1 ≤ B ≤ 2000000000. \r<br></p> "},{"title":"样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>2\r\n3 3 3\r\n7 5 3\r\n</td><td>Case #1: 7 2 1\r\nCase #2: 25 3 2</td></tr></table>\n\n"}]}