{"title":"Roping the Field","time_limit":1000,"memory_limit":64,"url":"http://www.joyoi.cn/problem/tyvj-2563","statement":[{"title":"","format":"markdown","require":["katex"],"content":"\n# \n\n \n # 题目描述 \n<p>\n\r<br>Farmer John is quite the nature artist: he often constructs large\r<br>works of art on his farm. Today, FJ wants to construct a giant\r<br>\"field web\". FJ's field is large convex polygon with fences along\r<br>the boundary and fence posts at each of the N corners (1 <= N <=\r<br>150). To construct his field web, FJ wants to run as many ropes as\r<br>possible in straight lines between pairs of non-adjacent fence posts\r<br>such that no two ropes cross.\r<br>\r<br>There is one complication: FJ's field is not completely usable.\r<br>Some evil aliens have created a total of G (0 <= G <= 100) grain\r<br>circles in the field, all of radius R (1 <= R <= 100,000). FJ is\r<br>afraid to upset the aliens, and therefore doesn't want the ropes\r<br>to pass through, or even touch the very edge of a grain circle.\r<br>Note that although the centers of all the circles are contained\r<br>within the field, a wide radius may make it extend outside of the\r<br>field, and both fences and fence posts may be within a grain circle.\r<br>\r<br>Given the locations of the fence posts and the centers of the\r<br>circles, determine the maximum number of ropes that FJ can use to\r<br>create his field web.\r<br>\r<br>FJ's fence posts and the circle centers all have integer coordinates\r<br>X and Y each of which is in the range 0..1,000,000.\r<br></p> \n\n \n # 输入格式 \n<p>\n* Line 1: Three space-separated integers: N, G, and R\r<br>\r<br>* Lines 2..N+1: Each line contains two space-separated integers that\r<br>        are the X,Y position of a fence post on the boundary of FJ's\r<br>        field.\r<br>\r<br>* Lines N+2..N+G+1: Each line contains two space-separated integers\r<br>        that are the X,Y position of a circle's center inside FJ's\r<br>        field.\r<br>\r<br></p> \n\n \n # 输出格式 \n<p>\n* Line 1: A single integer that is the largest number of ropes FJ can\r<br>        use for his artistic creation.\r<br></p> "},{"title":"# 样例数据","format":"markdown","require":["katex"],"content":"<style>\n        table,table tr th, table tr td { border:1px solid #0094ff; }\n        table { width: 200px; min-height: 25px; line-height: 25px; text-align: center; border-collapse: collapse;}   \n    </style>\n<table>\n\t<tr>\n\t\t<td>输入样例</td>\n\t\t<td>输出样例</td>\n\t</tr>\n<tr><td>5 3 1\r\n6 10\r\n10 7\r\n9 1\r\n2 0\r\n0 3\r\n2 2\r\n5 6\r\n8 3\r\n\r\nINPUT DETAILS:\r\n\r\nA pentagonal field, in which all possible ropes are blocked by three\r\ngrain circles, except for the rope between fenceposts 2 and 4.\r\n</td><td>\r\n1\r</td></tr></table>\n\n"}]}